From 0000000000000000000000000000000000000000 Mon Sep 17 00:00:00 2001
From: Giuliano Procida <gprocida@google.com>
Date: Tue, 22 Sep 2020 11:52:16 +0100
Subject: dwarf-reader: sort the types for canonicalization

This works around an issue where the order matters for canonicalization
depending on whether we see a type declaration-only or fully defined
first. The fully defined type is to prefer, hence partition the
types_to_canonicalize by whether they are declaration-only.

Signed-off-by: Giuliano Procida <gprocida@google.com>
Signed-off-by: Matthias Maennich <maennich@google.com>
---
 src/abg-dwarf-reader.cc                       |   16 +
 .../data/test-annotate/test13-pr18894.so.abi  |  858 ++++---
 .../data/test-annotate/test15-pr18892.so.abi  | 2155 +++++++++--------
 .../test-read-dwarf/test13-pr18894.so.abi     |  782 +++---
 .../test-read-dwarf/test15-pr18892.so.abi     | 2149 ++++++++--------
 5 files changed, 3238 insertions(+), 2722 deletions(-)

diff --git a/src/abg-dwarf-reader.cc b/src/abg-dwarf-reader.cc
index 9fddfad50037..cc0f528c2e14 100644
--- a/src/abg-dwarf-reader.cc
+++ b/src/abg-dwarf-reader.cc
@@ -4661,6 +4661,22 @@ public:
 	cn_timer.start();
       }
 
+    {
+      // first let's "sort" the types so that definitions appear before
+      // declarations
+      vector<Dwarf_Off> replacement, incomplete;
+      for (const auto& doff : types_to_canonicalize(source))
+	{
+	  const type_base_sptr& t = lookup_type_from_die_offset(doff, source);
+	  decl_base* db = dynamic_cast<decl_base*>(t.get());
+	  (db && db->get_is_declaration_only() ? incomplete : replacement)
+	    .push_back(doff);
+	}
+      replacement.insert(replacement.end(), incomplete.begin(),
+			 incomplete.end());
+      std::swap(types_to_canonicalize(source), replacement);
+    }
+
     if (!types_to_canonicalize(source).empty())
       {
 	tools_utils::timer single_type_cn_timer;
diff --git a/tests/data/test-annotate/test13-pr18894.so.abi b/tests/data/test-annotate/test13-pr18894.so.abi
index efb83bccf8d9..7c8902374ede 100644
--- a/tests/data/test-annotate/test13-pr18894.so.abi
+++ b/tests/data/test-annotate/test13-pr18894.so.abi
@@ -665,19 +665,17 @@
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='dbus-bus.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
-    <!-- struct DBusConnection -->
-    <class-decl name='DBusConnection' size-in-bits='2112' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-25'/>
     <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
+    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-25'/>
     <!-- unsigned long int -->
-    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-27'/>
+    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-26'/>
     <!-- typedef DBusConnection DBusConnection -->
-    <typedef-decl name='DBusConnection' type-id='type-id-25' filepath='../dbus/dbus-connection.h' line='51' column='1' id='type-id-28'/>
+    <typedef-decl name='DBusConnection' type-id='type-id-27' filepath='../dbus/dbus-connection.h' line='51' column='1' id='type-id-28'/>
     <!-- typedef __anonymous_enum__ DBusBusType -->
     <typedef-decl name='DBusBusType' type-id='type-id-29' filepath='../dbus/dbus-shared.h' line='61' column='1' id='type-id-30'/>
     <!-- enum __anonymous_enum__ -->
     <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='../dbus/dbus-shared.h' line='57' column='1' id='type-id-29'>
-      <underlying-type type-id='type-id-26'/>
+      <underlying-type type-id='type-id-25'/>
       <enumerator name='DBUS_BUS_SESSION' value='0'/>
       <enumerator name='DBUS_BUS_SYSTEM' value='1'/>
       <enumerator name='DBUS_BUS_STARTER' value='2'/>
@@ -767,7 +765,7 @@
       <!-- parameter of type 'DBusError*' -->
       <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='867' column='1'/>
       <!-- unsigned long int -->
-      <return type-id='type-id-27'/>
+      <return type-id='type-id-26'/>
     </function-decl>
     <!-- char* dbus_bus_get_id(DBusConnection*, DBusError*) -->
     <function-decl name='dbus_bus_get_id' mangled-name='dbus_bus_get_id' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-bus.c' line='948' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_bus_get_id'>
@@ -826,7 +824,7 @@
     <!-- DBusHeaderField[10] -->
     <array-type-def dimensions='1' type-id='type-id-33' size-in-bits='320' id='type-id-34'>
       <!-- <anonymous range>[10] -->
-      <subrange length='10' type-id='type-id-27' id='type-id-35'/>
+      <subrange length='10' type-id='type-id-26' id='type-id-35'/>
     </array-type-def>
     <!-- struct DBusCMutex -->
     <class-decl name='DBusCMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-36'/>
@@ -838,50 +836,207 @@
     <class-decl name='DBusHashTable' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-39'/>
     <!-- struct DBusObjectTree -->
     <class-decl name='DBusObjectTree' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-40'/>
-    <!-- struct DBusPendingCall -->
-    <class-decl name='DBusPendingCall' size-in-bits='576' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-41'/>
     <!-- struct DBusRMutex -->
-    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-42'/>
-    <!-- struct DBusTimeout -->
-    <class-decl name='DBusTimeout' size-in-bits='448' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-43'/>
+    <class-decl name='DBusRMutex' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-41'/>
     <!-- struct DBusTimeoutList -->
-    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-44'/>
+    <class-decl name='DBusTimeoutList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-42'/>
     <!-- struct DBusTransport -->
-    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-45'/>
-    <!-- struct DBusWatch -->
-    <class-decl name='DBusWatch' size-in-bits='512' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-46'/>
+    <class-decl name='DBusTransport' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-43'/>
     <!-- struct DBusWatchList -->
-    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-47'/>
+    <class-decl name='DBusWatchList' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-44'/>
     <!-- long int -->
-    <type-decl name='long int' size-in-bits='64' id='type-id-48'/>
+    <type-decl name='long int' size-in-bits='64' id='type-id-45'/>
+    <!-- struct DBusConnection -->
+    <class-decl name='DBusConnection' size-in-bits='2112' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='257' column='1' id='type-id-27'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <!-- DBusAtomic DBusConnection::refcount -->
+        <var-decl name='refcount' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='258' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <!-- DBusRMutex* DBusConnection::mutex -->
+        <var-decl name='mutex' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='260' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <!-- DBusCMutex* DBusConnection::dispatch_mutex -->
+        <var-decl name='dispatch_mutex' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='262' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <!-- DBusCondVar* DBusConnection::dispatch_cond -->
+        <var-decl name='dispatch_cond' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='263' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <!-- DBusCMutex* DBusConnection::io_path_mutex -->
+        <var-decl name='io_path_mutex' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='264' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <!-- DBusCondVar* DBusConnection::io_path_cond -->
+        <var-decl name='io_path_cond' type-id='type-id-49' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='265' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='384'>
+        <!-- DBusList* DBusConnection::outgoing_messages -->
+        <var-decl name='outgoing_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='267' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='448'>
+        <!-- DBusList* DBusConnection::incoming_messages -->
+        <var-decl name='incoming_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='268' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='512'>
+        <!-- DBusList* DBusConnection::expired_messages -->
+        <var-decl name='expired_messages' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='269' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='576'>
+        <!-- DBusMessage* DBusConnection::message_borrowed -->
+        <var-decl name='message_borrowed' type-id='type-id-50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='271' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='640'>
+        <!-- int DBusConnection::n_outgoing -->
+        <var-decl name='n_outgoing' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='275' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='672'>
+        <!-- int DBusConnection::n_incoming -->
+        <var-decl name='n_incoming' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='276' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='704'>
+        <!-- DBusCounter* DBusConnection::outgoing_counter -->
+        <var-decl name='outgoing_counter' type-id='type-id-51' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='278' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='768'>
+        <!-- DBusTransport* DBusConnection::transport -->
+        <var-decl name='transport' type-id='type-id-52' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='280' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='832'>
+        <!-- DBusWatchList* DBusConnection::watches -->
+        <var-decl name='watches' type-id='type-id-53' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='281' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='896'>
+        <!-- DBusTimeoutList* DBusConnection::timeouts -->
+        <var-decl name='timeouts' type-id='type-id-54' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='282' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='960'>
+        <!-- DBusList* DBusConnection::filter_list -->
+        <var-decl name='filter_list' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='284' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1024'>
+        <!-- DBusRMutex* DBusConnection::slot_mutex -->
+        <var-decl name='slot_mutex' type-id='type-id-47' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='286' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1088'>
+        <!-- DBusDataSlotList DBusConnection::slot_list -->
+        <var-decl name='slot_list' type-id='type-id-55' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='287' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1216'>
+        <!-- DBusHashTable* DBusConnection::pending_replies -->
+        <var-decl name='pending_replies' type-id='type-id-56' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='289' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1280'>
+        <!-- dbus_uint32_t DBusConnection::client_serial -->
+        <var-decl name='client_serial' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='291' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1344'>
+        <!-- DBusList* DBusConnection::disconnect_message_link -->
+        <var-decl name='disconnect_message_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='292' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1408'>
+        <!-- DBusWakeupMainFunction DBusConnection::wakeup_main_function -->
+        <var-decl name='wakeup_main_function' type-id='type-id-57' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='294' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1472'>
+        <!-- void* DBusConnection::wakeup_main_data -->
+        <var-decl name='wakeup_main_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='295' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1536'>
+        <!-- DBusFreeFunction DBusConnection::free_wakeup_main_data -->
+        <var-decl name='free_wakeup_main_data' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='296' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1600'>
+        <!-- DBusDispatchStatusFunction DBusConnection::dispatch_status_function -->
+        <var-decl name='dispatch_status_function' type-id='type-id-59' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='298' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1664'>
+        <!-- void* DBusConnection::dispatch_status_data -->
+        <var-decl name='dispatch_status_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='299' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1728'>
+        <!-- DBusFreeFunction DBusConnection::free_dispatch_status_data -->
+        <var-decl name='free_dispatch_status_data' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='300' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1792'>
+        <!-- DBusDispatchStatus DBusConnection::last_dispatch_status -->
+        <var-decl name='last_dispatch_status' type-id='type-id-60' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='302' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1856'>
+        <!-- DBusObjectTree* DBusConnection::objects -->
+        <var-decl name='objects' type-id='type-id-61' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='304' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1920'>
+        <!-- char* DBusConnection::server_guid -->
+        <var-decl name='server_guid' type-id='type-id-22' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='306' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='1984'>
+        <!-- dbus_bool_t DBusConnection::dispatch_acquired -->
+        <var-decl name='dispatch_acquired' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='312' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='2016'>
+        <!-- dbus_bool_t DBusConnection::io_path_acquired -->
+        <var-decl name='io_path_acquired' type-id='type-id-17' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='313' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='31'>
+        <!-- unsigned int DBusConnection::shareable -->
+        <var-decl name='shareable' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='315' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='30'>
+        <!-- unsigned int DBusConnection::exit_on_disconnect -->
+        <var-decl name='exit_on_disconnect' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='317' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='29'>
+        <!-- unsigned int DBusConnection::route_peer_messages -->
+        <var-decl name='route_peer_messages' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='319' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='28'>
+        <!-- unsigned int DBusConnection::disconnected_message_arrived -->
+        <var-decl name='disconnected_message_arrived' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='321' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='27'>
+        <!-- unsigned int DBusConnection::disconnected_message_processed -->
+        <var-decl name='disconnected_message_processed' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='325' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='26'>
+        <!-- unsigned int DBusConnection::have_connection_lock -->
+        <var-decl name='have_connection_lock' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='330' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='2080'>
+        <!-- int DBusConnection::generation -->
+        <var-decl name='generation' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='334' column='1'/>
+      </data-member>
+    </class-decl>
     <!-- typedef DBusAtomic DBusAtomic -->
-    <typedef-decl name='DBusAtomic' type-id='type-id-49' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-50'/>
+    <typedef-decl name='DBusAtomic' type-id='type-id-62' filepath='../dbus/dbus-sysdeps.h' line='222' column='1' id='type-id-46'/>
     <!-- struct DBusAtomic -->
-    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-49'>
+    <class-decl name='DBusAtomic' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='228' column='1' id='type-id-62'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- volatile dbus_int32_t DBusAtomic::value -->
-        <var-decl name='value' type-id='type-id-51' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
+        <var-decl name='value' type-id='type-id-63' visibility='default' filepath='../dbus/dbus-sysdeps.h' line='232' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef int dbus_int32_t -->
-    <typedef-decl name='dbus_int32_t' type-id='type-id-2' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-52'/>
+    <typedef-decl name='dbus_int32_t' type-id='type-id-2' filepath='../dbus/dbus-arch-deps.h' line='42' column='1' id='type-id-64'/>
     <!-- typedef DBusRMutex DBusRMutex -->
-    <typedef-decl name='DBusRMutex' type-id='type-id-42' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-53'/>
+    <typedef-decl name='DBusRMutex' type-id='type-id-41' filepath='../dbus/dbus-threads-internal.h' line='39' column='1' id='type-id-65'/>
     <!-- typedef DBusCMutex DBusCMutex -->
-    <typedef-decl name='DBusCMutex' type-id='type-id-36' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-54'/>
+    <typedef-decl name='DBusCMutex' type-id='type-id-36' filepath='../dbus/dbus-threads-internal.h' line='45' column='1' id='type-id-66'/>
     <!-- typedef DBusCondVar DBusCondVar -->
-    <typedef-decl name='DBusCondVar' type-id='type-id-37' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-55'/>
+    <typedef-decl name='DBusCondVar' type-id='type-id-37' filepath='../dbus/dbus-threads.h' line='43' column='1' id='type-id-67'/>
     <!-- typedef DBusMessage DBusMessage -->
-    <typedef-decl name='DBusMessage' type-id='type-id-56' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-57'/>
+    <typedef-decl name='DBusMessage' type-id='type-id-68' filepath='../dbus/dbus-message.h' line='44' column='1' id='type-id-69'/>
     <!-- struct DBusMessage -->
-    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-56'>
+    <class-decl name='DBusMessage' size-in-bits='1472' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='100' column='1' id='type-id-68'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- DBusAtomic DBusMessage::refcount -->
-        <var-decl name='refcount' type-id='type-id-50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
+        <var-decl name='refcount' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='101' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- DBusHeader DBusMessage::header -->
-        <var-decl name='header' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
+        <var-decl name='header' type-id='type-id-70' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='103' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
         <!-- DBusString DBusMessage::body -->
@@ -901,7 +1056,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
         <!-- long int DBusMessage::size_counter_delta -->
-        <var-decl name='size_counter_delta' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
+        <var-decl name='size_counter_delta' type-id='type-id-45' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='114' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='11'>
         <!-- dbus_uint32_t DBusMessage::changed_stamp -->
@@ -909,7 +1064,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='1088'>
         <!-- DBusDataSlotList DBusMessage::slot_list -->
-        <var-decl name='slot_list' type-id='type-id-59' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
+        <var-decl name='slot_list' type-id='type-id-55' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='118' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1216'>
         <!-- int DBusMessage::generation -->
@@ -929,13 +1084,13 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='1408'>
         <!-- long int DBusMessage::unix_fd_counter_delta -->
-        <var-decl name='unix_fd_counter_delta' type-id='type-id-48' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
+        <var-decl name='unix_fd_counter_delta' type-id='type-id-45' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message-private.h' line='132' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef DBusHeader DBusHeader -->
-    <typedef-decl name='DBusHeader' type-id='type-id-60' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-58'/>
+    <typedef-decl name='DBusHeader' type-id='type-id-71' filepath='../dbus/dbus-marshal-header.h' line='30' column='1' id='type-id-70'/>
     <!-- struct DBusHeader -->
-    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-60'>
+    <class-decl name='DBusHeader' size-in-bits='576' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='48' column='1' id='type-id-71'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- DBusString DBusHeader::data -->
         <var-decl name='data' type-id='type-id-7' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='49' column='1'/>
@@ -954,21 +1109,21 @@
       </data-member>
     </class-decl>
     <!-- typedef DBusHeaderField DBusHeaderField -->
-    <typedef-decl name='DBusHeaderField' type-id='type-id-61' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-33'/>
+    <typedef-decl name='DBusHeaderField' type-id='type-id-72' filepath='../dbus/dbus-marshal-header.h' line='31' column='1' id='type-id-33'/>
     <!-- struct DBusHeaderField -->
-    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-61'>
+    <class-decl name='DBusHeaderField' size-in-bits='32' is-struct='yes' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='40' column='1' id='type-id-72'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- int DBusHeaderField::value_pos -->
         <var-decl name='value_pos' type-id='type-id-2' visibility='default' filepath='../dbus/dbus-marshal-header.h' line='41' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef DBusDataSlotList DBusDataSlotList -->
-    <typedef-decl name='DBusDataSlotList' type-id='type-id-62' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-59'/>
+    <typedef-decl name='DBusDataSlotList' type-id='type-id-73' filepath='../dbus/dbus-dataslot.h' line='31' column='1' id='type-id-55'/>
     <!-- struct DBusDataSlotList -->
-    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-62'>
+    <class-decl name='DBusDataSlotList' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='70' column='1' id='type-id-73'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- DBusDataSlot* DBusDataSlotList::slots -->
-        <var-decl name='slots' type-id='type-id-63' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
+        <var-decl name='slots' type-id='type-id-74' visibility='default' filepath='../dbus/dbus-dataslot.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int DBusDataSlotList::n_slots -->
@@ -976,113 +1131,113 @@
       </data-member>
     </class-decl>
     <!-- typedef DBusDataSlot DBusDataSlot -->
-    <typedef-decl name='DBusDataSlot' type-id='type-id-64' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-65'/>
+    <typedef-decl name='DBusDataSlot' type-id='type-id-75' filepath='../dbus/dbus-dataslot.h' line='34' column='1' id='type-id-76'/>
     <!-- struct DBusDataSlot -->
-    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-64'>
+    <class-decl name='DBusDataSlot' size-in-bits='128' is-struct='yes' visibility='default' filepath='../dbus/dbus-dataslot.h' line='37' column='1' id='type-id-75'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- void* DBusDataSlot::data -->
         <var-decl name='data' type-id='type-id-10' visibility='default' filepath='../dbus/dbus-dataslot.h' line='38' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- DBusFreeFunction DBusDataSlot::free_data_func -->
-        <var-decl name='free_data_func' type-id='type-id-66' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
+        <var-decl name='free_data_func' type-id='type-id-58' visibility='default' filepath='../dbus/dbus-dataslot.h' line='39' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef void (void*)* DBusFreeFunction -->
-    <typedef-decl name='DBusFreeFunction' type-id='type-id-67' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-66'/>
+    <typedef-decl name='DBusFreeFunction' type-id='type-id-77' filepath='../dbus/dbus-memory.h' line='64' column='1' id='type-id-58'/>
     <!-- typedef DBusCounter DBusCounter -->
-    <typedef-decl name='DBusCounter' type-id='type-id-38' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-68'/>
+    <typedef-decl name='DBusCounter' type-id='type-id-38' filepath='../dbus/dbus-resources.h' line='32' column='1' id='type-id-78'/>
     <!-- typedef DBusTransport DBusTransport -->
-    <typedef-decl name='DBusTransport' type-id='type-id-45' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-69'/>
+    <typedef-decl name='DBusTransport' type-id='type-id-43' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-transport.h' line='33' column='1' id='type-id-79'/>
     <!-- typedef DBusWatchList DBusWatchList -->
-    <typedef-decl name='DBusWatchList' type-id='type-id-47' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-70'/>
+    <typedef-decl name='DBusWatchList' type-id='type-id-44' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='38' column='1' id='type-id-80'/>
     <!-- typedef DBusTimeoutList DBusTimeoutList -->
-    <typedef-decl name='DBusTimeoutList' type-id='type-id-44' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-71'/>
+    <typedef-decl name='DBusTimeoutList' type-id='type-id-42' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='38' column='1' id='type-id-81'/>
     <!-- typedef DBusHashTable DBusHashTable -->
-    <typedef-decl name='DBusHashTable' type-id='type-id-39' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-72'/>
+    <typedef-decl name='DBusHashTable' type-id='type-id-39' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-hash.h' line='59' column='1' id='type-id-82'/>
     <!-- typedef void (void*)* DBusWakeupMainFunction -->
-    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-67' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-73'/>
+    <typedef-decl name='DBusWakeupMainFunction' type-id='type-id-77' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='135' column='1' id='type-id-57'/>
     <!-- typedef void (DBusConnection*, typedef DBusDispatchStatus, void*)* DBusDispatchStatusFunction -->
-    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-74' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-75'/>
+    <typedef-decl name='DBusDispatchStatusFunction' type-id='type-id-83' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='128' column='1' id='type-id-59'/>
     <!-- typedef __anonymous_enum__ DBusDispatchStatus -->
-    <typedef-decl name='DBusDispatchStatus' type-id='type-id-76' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-77'/>
+    <typedef-decl name='DBusDispatchStatus' type-id='type-id-84' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='84' column='1' id='type-id-60'/>
     <!-- enum __anonymous_enum__ -->
-    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='type-id-76'>
-      <underlying-type type-id='type-id-26'/>
+    <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='80' column='1' id='type-id-84'>
+      <underlying-type type-id='type-id-25'/>
       <enumerator name='DBUS_DISPATCH_DATA_REMAINS' value='0'/>
       <enumerator name='DBUS_DISPATCH_COMPLETE' value='1'/>
       <enumerator name='DBUS_DISPATCH_NEED_MEMORY' value='2'/>
     </enum-decl>
     <!-- typedef DBusObjectTree DBusObjectTree -->
-    <typedef-decl name='DBusObjectTree' type-id='type-id-40' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-78'/>
+    <typedef-decl name='DBusObjectTree' type-id='type-id-40' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-object-tree.h' line='30' column='1' id='type-id-85'/>
     <!-- typedef DBusObjectPathVTable DBusObjectPathVTable -->
-    <typedef-decl name='DBusObjectPathVTable' type-id='type-id-79' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='53' column='1' id='type-id-80'/>
+    <typedef-decl name='DBusObjectPathVTable' type-id='type-id-86' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='53' column='1' id='type-id-87'/>
     <!-- struct DBusObjectPathVTable -->
-    <class-decl name='DBusObjectPathVTable' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='385' column='1' id='type-id-79'>
+    <class-decl name='DBusObjectPathVTable' size-in-bits='384' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='385' column='1' id='type-id-86'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- DBusObjectPathUnregisterFunction DBusObjectPathVTable::unregister_function -->
-        <var-decl name='unregister_function' type-id='type-id-81' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='386' column='1'/>
+        <var-decl name='unregister_function' type-id='type-id-88' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='386' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- DBusObjectPathMessageFunction DBusObjectPathVTable::message_function -->
-        <var-decl name='message_function' type-id='type-id-82' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='387' column='1'/>
+        <var-decl name='message_function' type-id='type-id-89' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='387' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad1 -->
-        <var-decl name='dbus_internal_pad1' type-id='type-id-67' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='389' column='1'/>
+        <var-decl name='dbus_internal_pad1' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='389' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad2 -->
-        <var-decl name='dbus_internal_pad2' type-id='type-id-67' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='390' column='1'/>
+        <var-decl name='dbus_internal_pad2' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='390' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad3 -->
-        <var-decl name='dbus_internal_pad3' type-id='type-id-67' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='391' column='1'/>
+        <var-decl name='dbus_internal_pad3' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='391' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
         <!-- void (void*)* DBusObjectPathVTable::dbus_internal_pad4 -->
-        <var-decl name='dbus_internal_pad4' type-id='type-id-67' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='392' column='1'/>
+        <var-decl name='dbus_internal_pad4' type-id='type-id-77' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='392' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef void (DBusConnection*, void*)* DBusObjectPathUnregisterFunction -->
-    <typedef-decl name='DBusObjectPathUnregisterFunction' type-id='type-id-83' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='367' column='1' id='type-id-81'/>
+    <typedef-decl name='DBusObjectPathUnregisterFunction' type-id='type-id-90' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='367' column='1' id='type-id-88'/>
     <!-- typedef typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* DBusObjectPathMessageFunction -->
-    <typedef-decl name='DBusObjectPathMessageFunction' type-id='type-id-84' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='374' column='1' id='type-id-82'/>
+    <typedef-decl name='DBusObjectPathMessageFunction' type-id='type-id-91' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='374' column='1' id='type-id-89'/>
     <!-- typedef __anonymous_enum__1 DBusHandlerResult -->
-    <typedef-decl name='DBusHandlerResult' type-id='type-id-85' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='71' column='1' id='type-id-86'/>
+    <typedef-decl name='DBusHandlerResult' type-id='type-id-92' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='71' column='1' id='type-id-93'/>
     <!-- enum __anonymous_enum__1 -->
-    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='67' column='1' id='type-id-85'>
-      <underlying-type type-id='type-id-26'/>
+    <enum-decl name='__anonymous_enum__1' is-anonymous='yes' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-shared.h' line='67' column='1' id='type-id-92'>
+      <underlying-type type-id='type-id-25'/>
       <enumerator name='DBUS_HANDLER_RESULT_HANDLED' value='0'/>
       <enumerator name='DBUS_HANDLER_RESULT_NOT_YET_HANDLED' value='1'/>
       <enumerator name='DBUS_HANDLER_RESULT_NEED_MEMORY' value='2'/>
     </enum-decl>
     <!-- typedef typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* DBusHandleMessageFunction -->
-    <typedef-decl name='DBusHandleMessageFunction' type-id='type-id-84' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='169' column='1' id='type-id-87'/>
+    <typedef-decl name='DBusHandleMessageFunction' type-id='type-id-91' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='169' column='1' id='type-id-94'/>
     <!-- typedef typedef dbus_bool_t (DBusConnection*, const char*, void*)* DBusAllowWindowsUserFunction -->
-    <typedef-decl name='DBusAllowWindowsUserFunction' type-id='type-id-88' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='153' column='1' id='type-id-89'/>
+    <typedef-decl name='DBusAllowWindowsUserFunction' type-id='type-id-95' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='153' column='1' id='type-id-96'/>
     <!-- typedef typedef dbus_bool_t (DBusConnection*, unsigned long int, void*)* DBusAllowUnixUserFunction -->
-    <typedef-decl name='DBusAllowUnixUserFunction' type-id='type-id-90' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='143' column='1' id='type-id-91'/>
+    <typedef-decl name='DBusAllowUnixUserFunction' type-id='type-id-97' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='143' column='1' id='type-id-98'/>
     <!-- typedef typedef dbus_bool_t (DBusTimeout*, void*)* DBusAddTimeoutFunction -->
-    <typedef-decl name='DBusAddTimeoutFunction' type-id='type-id-92' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='110' column='1' id='type-id-93'/>
+    <typedef-decl name='DBusAddTimeoutFunction' type-id='type-id-99' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='110' column='1' id='type-id-100'/>
     <!-- typedef DBusTimeout DBusTimeout -->
-    <typedef-decl name='DBusTimeout' type-id='type-id-43' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='45' column='1' id='type-id-94'/>
+    <typedef-decl name='DBusTimeout' type-id='type-id-101' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='45' column='1' id='type-id-102'/>
     <!-- typedef void (DBusTimeout*, void*)* DBusRemoveTimeoutFunction -->
-    <typedef-decl name='DBusRemoveTimeoutFunction' type-id='type-id-95' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='123' column='1' id='type-id-96'/>
+    <typedef-decl name='DBusRemoveTimeoutFunction' type-id='type-id-103' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='123' column='1' id='type-id-104'/>
     <!-- typedef void (DBusTimeout*, void*)* DBusTimeoutToggledFunction -->
-    <typedef-decl name='DBusTimeoutToggledFunction' type-id='type-id-95' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='117' column='1' id='type-id-97'/>
+    <typedef-decl name='DBusTimeoutToggledFunction' type-id='type-id-103' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='117' column='1' id='type-id-105'/>
     <!-- typedef typedef dbus_bool_t (DBusWatch*, void*)* DBusAddWatchFunction -->
-    <typedef-decl name='DBusAddWatchFunction' type-id='type-id-98' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='91' column='1' id='type-id-99'/>
+    <typedef-decl name='DBusAddWatchFunction' type-id='type-id-106' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='91' column='1' id='type-id-107'/>
     <!-- typedef DBusWatch DBusWatch -->
-    <typedef-decl name='DBusWatch' type-id='type-id-46' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='43' column='1' id='type-id-100'/>
+    <typedef-decl name='DBusWatch' type-id='type-id-108' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='43' column='1' id='type-id-109'/>
     <!-- typedef void (DBusWatch*, void*)* DBusRemoveWatchFunction -->
-    <typedef-decl name='DBusRemoveWatchFunction' type-id='type-id-101' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='103' column='1' id='type-id-102'/>
+    <typedef-decl name='DBusRemoveWatchFunction' type-id='type-id-110' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='103' column='1' id='type-id-111'/>
     <!-- typedef void (DBusWatch*, void*)* DBusWatchToggledFunction -->
-    <typedef-decl name='DBusWatchToggledFunction' type-id='type-id-101' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='97' column='1' id='type-id-103'/>
+    <typedef-decl name='DBusWatchToggledFunction' type-id='type-id-110' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='97' column='1' id='type-id-112'/>
     <!-- typedef DBusPreallocatedSend DBusPreallocatedSend -->
-    <typedef-decl name='DBusPreallocatedSend' type-id='type-id-104' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='47' column='1' id='type-id-105'/>
+    <typedef-decl name='DBusPreallocatedSend' type-id='type-id-113' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='47' column='1' id='type-id-114'/>
     <!-- struct DBusPreallocatedSend -->
-    <class-decl name='DBusPreallocatedSend' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='241' column='1' id='type-id-104'>
+    <class-decl name='DBusPreallocatedSend' size-in-bits='192' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='241' column='1' id='type-id-113'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- DBusConnection* DBusPreallocatedSend::connection -->
         <var-decl name='connection' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='242' column='1'/>
@@ -1097,75 +1252,75 @@
       </data-member>
     </class-decl>
     <!-- typedef DBusPendingCall DBusPendingCall -->
-    <typedef-decl name='DBusPendingCall' type-id='type-id-41' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='49' column='1' id='type-id-106'/>
+    <typedef-decl name='DBusPendingCall' type-id='type-id-115' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.h' line='49' column='1' id='type-id-116'/>
     <!-- DBusCMutex* -->
-    <pointer-type-def type-id='type-id-54' size-in-bits='64' id='type-id-107'/>
+    <pointer-type-def type-id='type-id-66' size-in-bits='64' id='type-id-48'/>
     <!-- DBusCondVar* -->
-    <pointer-type-def type-id='type-id-55' size-in-bits='64' id='type-id-108'/>
+    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-49'/>
     <!-- DBusCounter* -->
-    <pointer-type-def type-id='type-id-68' size-in-bits='64' id='type-id-109'/>
+    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-51'/>
     <!-- DBusDataSlot* -->
-    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-63'/>
+    <pointer-type-def type-id='type-id-76' size-in-bits='64' id='type-id-74'/>
     <!-- DBusHashTable* -->
-    <pointer-type-def type-id='type-id-72' size-in-bits='64' id='type-id-110'/>
+    <pointer-type-def type-id='type-id-82' size-in-bits='64' id='type-id-56'/>
     <!-- DBusMessage* -->
-    <pointer-type-def type-id='type-id-57' size-in-bits='64' id='type-id-111'/>
+    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-50'/>
     <!-- DBusObjectTree* -->
-    <pointer-type-def type-id='type-id-78' size-in-bits='64' id='type-id-112'/>
+    <pointer-type-def type-id='type-id-85' size-in-bits='64' id='type-id-61'/>
     <!-- DBusPendingCall* -->
-    <pointer-type-def type-id='type-id-106' size-in-bits='64' id='type-id-113'/>
+    <pointer-type-def type-id='type-id-116' size-in-bits='64' id='type-id-117'/>
     <!-- DBusPendingCall** -->
-    <pointer-type-def type-id='type-id-113' size-in-bits='64' id='type-id-114'/>
+    <pointer-type-def type-id='type-id-117' size-in-bits='64' id='type-id-118'/>
     <!-- DBusPreallocatedSend* -->
-    <pointer-type-def type-id='type-id-105' size-in-bits='64' id='type-id-115'/>
+    <pointer-type-def type-id='type-id-114' size-in-bits='64' id='type-id-119'/>
     <!-- DBusRMutex* -->
-    <pointer-type-def type-id='type-id-53' size-in-bits='64' id='type-id-116'/>
+    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-47'/>
     <!-- DBusTimeout* -->
-    <pointer-type-def type-id='type-id-94' size-in-bits='64' id='type-id-117'/>
+    <pointer-type-def type-id='type-id-102' size-in-bits='64' id='type-id-120'/>
     <!-- DBusTimeoutList* -->
-    <pointer-type-def type-id='type-id-71' size-in-bits='64' id='type-id-118'/>
+    <pointer-type-def type-id='type-id-81' size-in-bits='64' id='type-id-54'/>
     <!-- DBusTransport* -->
-    <pointer-type-def type-id='type-id-69' size-in-bits='64' id='type-id-119'/>
+    <pointer-type-def type-id='type-id-79' size-in-bits='64' id='type-id-52'/>
     <!-- DBusWatch* -->
-    <pointer-type-def type-id='type-id-100' size-in-bits='64' id='type-id-120'/>
+    <pointer-type-def type-id='type-id-109' size-in-bits='64' id='type-id-121'/>
     <!-- DBusWatchList* -->
-    <pointer-type-def type-id='type-id-70' size-in-bits='64' id='type-id-121'/>
+    <pointer-type-def type-id='type-id-80' size-in-bits='64' id='type-id-53'/>
     <!-- char** -->
     <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-122'/>
     <!-- char*** -->
     <pointer-type-def type-id='type-id-122' size-in-bits='64' id='type-id-123'/>
     <!-- const DBusObjectPathVTable -->
-    <qualified-type-def type-id='type-id-80' const='yes' id='type-id-124'/>
+    <qualified-type-def type-id='type-id-87' const='yes' id='type-id-124'/>
     <!-- const DBusObjectPathVTable* -->
     <pointer-type-def type-id='type-id-124' size-in-bits='64' id='type-id-125'/>
     <!-- dbus_int32_t* -->
-    <pointer-type-def type-id='type-id-52' size-in-bits='64' id='type-id-126'/>
+    <pointer-type-def type-id='type-id-64' size-in-bits='64' id='type-id-126'/>
     <!-- typedef DBusHandlerResult (DBusConnection*, DBusMessage*, void*)* -->
-    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-84'/>
+    <pointer-type-def type-id='type-id-127' size-in-bits='64' id='type-id-91'/>
     <!-- typedef dbus_bool_t (DBusConnection*, const char*, void*)* -->
-    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-88'/>
+    <pointer-type-def type-id='type-id-128' size-in-bits='64' id='type-id-95'/>
     <!-- typedef dbus_bool_t (DBusConnection*, unsigned long int, void*)* -->
-    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-90'/>
+    <pointer-type-def type-id='type-id-129' size-in-bits='64' id='type-id-97'/>
     <!-- typedef dbus_bool_t (DBusTimeout*, void*)* -->
-    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-92'/>
+    <pointer-type-def type-id='type-id-130' size-in-bits='64' id='type-id-99'/>
     <!-- typedef dbus_bool_t (DBusWatch*, void*)* -->
-    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-98'/>
+    <pointer-type-def type-id='type-id-131' size-in-bits='64' id='type-id-106'/>
     <!-- unsigned long int* -->
-    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-132'/>
+    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-132'/>
     <!-- void (DBusConnection*, typedef DBusDispatchStatus, void*)* -->
-    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-74'/>
+    <pointer-type-def type-id='type-id-133' size-in-bits='64' id='type-id-83'/>
     <!-- void (DBusConnection*, void*)* -->
-    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-83'/>
+    <pointer-type-def type-id='type-id-134' size-in-bits='64' id='type-id-90'/>
     <!-- void (DBusTimeout*, void*)* -->
-    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-95'/>
+    <pointer-type-def type-id='type-id-135' size-in-bits='64' id='type-id-103'/>
     <!-- void (DBusWatch*, void*)* -->
-    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-101'/>
+    <pointer-type-def type-id='type-id-136' size-in-bits='64' id='type-id-110'/>
     <!-- void (void*)* -->
-    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-67'/>
+    <pointer-type-def type-id='type-id-137' size-in-bits='64' id='type-id-77'/>
     <!-- void** -->
     <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-138'/>
     <!-- volatile dbus_int32_t -->
-    <qualified-type-def type-id='type-id-52' volatile='yes' id='type-id-51'/>
+    <qualified-type-def type-id='type-id-64' volatile='yes' id='type-id-63'/>
     <!-- void dbus_connection_set_change_sigpipe(dbus_bool_t) -->
     <function-decl name='dbus_connection_set_change_sigpipe' mangled-name='dbus_connection_set_change_sigpipe' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6043' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_change_sigpipe'>
       <!-- parameter of type 'typedef dbus_bool_t' -->
@@ -1178,7 +1333,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6017' column='1'/>
       <!-- parameter of type 'typedef dbus_int32_t' -->
-      <parameter type-id='type-id-52' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6018' column='1'/>
+      <parameter type-id='type-id-64' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6018' column='1'/>
       <!-- void* -->
       <return type-id='type-id-10'/>
     </function-decl>
@@ -1187,11 +1342,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5968' column='1'/>
       <!-- parameter of type 'typedef dbus_int32_t' -->
-      <parameter type-id='type-id-52' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5969' column='1'/>
+      <parameter type-id='type-id-64' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5969' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5970' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5971' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5971' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -1241,28 +1396,28 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6296' column='1'/>
       <!-- long int -->
-      <return type-id='type-id-48'/>
+      <return type-id='type-id-45'/>
     </function-decl>
     <!-- long int dbus_connection_get_outgoing_size(DBusConnection*) -->
     <function-decl name='dbus_connection_get_outgoing_size' mangled-name='dbus_connection_get_outgoing_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_outgoing_size'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6235' column='1'/>
       <!-- long int -->
-      <return type-id='type-id-48'/>
+      <return type-id='type-id-45'/>
     </function-decl>
     <!-- long int dbus_connection_get_max_received_unix_fds(DBusConnection*) -->
     <function-decl name='dbus_connection_get_max_received_unix_fds' mangled-name='dbus_connection_get_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_max_received_unix_fds'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6212' column='1'/>
       <!-- long int -->
-      <return type-id='type-id-48'/>
+      <return type-id='type-id-45'/>
     </function-decl>
     <!-- void dbus_connection_set_max_received_unix_fds(DBusConnection*, long int) -->
     <function-decl name='dbus_connection_set_max_received_unix_fds' mangled-name='dbus_connection_set_max_received_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_unix_fds'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6194' column='1'/>
       <!-- parameter of type 'long int' -->
-      <parameter type-id='type-id-48' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6195' column='1'/>
+      <parameter type-id='type-id-45' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6195' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1271,14 +1426,14 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6170' column='1'/>
       <!-- long int -->
-      <return type-id='type-id-48'/>
+      <return type-id='type-id-45'/>
     </function-decl>
     <!-- void dbus_connection_set_max_received_size(DBusConnection*, long int) -->
     <function-decl name='dbus_connection_set_max_received_size' mangled-name='dbus_connection_set_max_received_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_received_size'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6152' column='1'/>
       <!-- parameter of type 'long int' -->
-      <parameter type-id='type-id-48' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6153' column='1'/>
+      <parameter type-id='type-id-45' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6153' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1287,14 +1442,14 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6114' column='1'/>
       <!-- long int -->
-      <return type-id='type-id-48'/>
+      <return type-id='type-id-45'/>
     </function-decl>
     <!-- void dbus_connection_set_max_message_unix_fds(DBusConnection*, long int) -->
     <function-decl name='dbus_connection_set_max_message_unix_fds' mangled-name='dbus_connection_set_max_message_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_unix_fds'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6096' column='1'/>
       <!-- parameter of type 'long int' -->
-      <parameter type-id='type-id-48' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6097' column='1'/>
+      <parameter type-id='type-id-45' name='n' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6097' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1303,14 +1458,14 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6075' column='1'/>
       <!-- long int -->
-      <return type-id='type-id-48'/>
+      <return type-id='type-id-45'/>
     </function-decl>
     <!-- void dbus_connection_set_max_message_size(DBusConnection*, long int) -->
     <function-decl name='dbus_connection_set_max_message_size' mangled-name='dbus_connection_set_max_message_size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_set_max_message_size'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6057' column='1'/>
       <!-- parameter of type 'long int' -->
-      <parameter type-id='type-id-48' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6058' column='1'/>
+      <parameter type-id='type-id-45' name='size' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='6058' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1386,7 +1541,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5563' column='1'/>
       <!-- parameter of type 'typedef DBusHandleMessageFunction' -->
-      <parameter type-id='type-id-87' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5564' column='1'/>
+      <parameter type-id='type-id-94' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5564' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5565' column='1'/>
       <!-- void -->
@@ -1397,11 +1552,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5511' column='1'/>
       <!-- parameter of type 'typedef DBusHandleMessageFunction' -->
-      <parameter type-id='type-id-87' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5512' column='1'/>
+      <parameter type-id='type-id-94' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5512' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5513' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5514' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5514' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -1428,11 +1583,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5404' column='1'/>
       <!-- parameter of type 'typedef DBusAllowWindowsUserFunction' -->
-      <parameter type-id='type-id-89' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5405' column='1'/>
+      <parameter type-id='type-id-96' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5405' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5406' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5407' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5407' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1450,11 +1605,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5305' column='1'/>
       <!-- parameter of type 'typedef DBusAllowUnixUserFunction' -->
-      <parameter type-id='type-id-91' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5306' column='1'/>
+      <parameter type-id='type-id-98' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5306' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5307' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5308' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5308' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1510,11 +1665,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5073' column='1'/>
       <!-- parameter of type 'typedef DBusDispatchStatusFunction' -->
-      <parameter type-id='type-id-75' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5074' column='1'/>
+      <parameter type-id='type-id-59' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5074' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5075' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5076' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5076' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1523,11 +1678,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5027' column='1'/>
       <!-- parameter of type 'typedef DBusWakeupMainFunction' -->
-      <parameter type-id='type-id-73' name='wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5028' column='1'/>
+      <parameter type-id='type-id-57' name='wakeup_main_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5028' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5029' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5030' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='5030' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1536,15 +1691,15 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4989' column='1'/>
       <!-- parameter of type 'typedef DBusAddTimeoutFunction' -->
-      <parameter type-id='type-id-93' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4990' column='1'/>
+      <parameter type-id='type-id-100' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4990' column='1'/>
       <!-- parameter of type 'typedef DBusRemoveTimeoutFunction' -->
-      <parameter type-id='type-id-96' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4991' column='1'/>
+      <parameter type-id='type-id-104' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4991' column='1'/>
       <!-- parameter of type 'typedef DBusTimeoutToggledFunction' -->
-      <parameter type-id='type-id-97' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4992' column='1'/>
+      <parameter type-id='type-id-105' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4992' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4993' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4994' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4994' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -1553,15 +1708,15 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4926' column='1'/>
       <!-- parameter of type 'typedef DBusAddWatchFunction' -->
-      <parameter type-id='type-id-99' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4927' column='1'/>
+      <parameter type-id='type-id-107' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4927' column='1'/>
       <!-- parameter of type 'typedef DBusRemoveWatchFunction' -->
-      <parameter type-id='type-id-102' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4928' column='1'/>
+      <parameter type-id='type-id-111' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4928' column='1'/>
       <!-- parameter of type 'typedef DBusWatchToggledFunction' -->
-      <parameter type-id='type-id-103' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4929' column='1'/>
+      <parameter type-id='type-id-112' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4929' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4930' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4931' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4931' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -1593,7 +1748,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3165' column='1'/>
       <!-- DBusPreallocatedSend* -->
-      <return type-id='type-id-115'/>
+      <return type-id='type-id-119'/>
     </function-decl>
     <!-- dbus_bool_t dbus_connection_get_is_connected(DBusConnection*) -->
     <function-decl name='dbus_connection_get_is_connected' mangled-name='dbus_connection_get_is_connected' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='2973' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_get_is_connected'>
@@ -1607,7 +1762,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3191' column='1'/>
       <!-- parameter of type 'DBusPreallocatedSend*' -->
-      <parameter type-id='type-id-115' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3192' column='1'/>
+      <parameter type-id='type-id-119' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3192' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1646,28 +1801,28 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4378' column='1'/>
       <!-- typedef DBusDispatchStatus -->
-      <return type-id='type-id-77'/>
+      <return type-id='type-id-60'/>
     </function-decl>
     <!-- DBusMessage* dbus_connection_borrow_message(DBusConnection*) -->
     <function-decl name='dbus_connection_borrow_message' mangled-name='dbus_connection_borrow_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_borrow_message'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3850' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_connection_pop_message(DBusConnection*) -->
     <function-decl name='dbus_connection_pop_message' mangled-name='dbus_connection_pop_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_pop_message'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4091' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- void dbus_connection_steal_borrowed_message(DBusConnection*, DBusMessage*) -->
     <function-decl name='dbus_connection_steal_borrowed_message' mangled-name='dbus_connection_steal_borrowed_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_steal_borrowed_message'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3935' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3936' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3936' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1676,7 +1831,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3901' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3902' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3902' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -1692,9 +1847,9 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3217' column='1'/>
       <!-- parameter of type 'DBusPreallocatedSend*' -->
-      <parameter type-id='type-id-115' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3218' column='1'/>
+      <parameter type-id='type-id-119' name='preallocated' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3218' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3219' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3219' column='1'/>
       <!-- parameter of type 'dbus_uint32_t*' -->
       <parameter type-id='type-id-32' name='client_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3220' column='1'/>
       <!-- void -->
@@ -1705,7 +1860,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3302' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3303' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3303' column='1'/>
       <!-- parameter of type 'dbus_uint32_t*' -->
       <parameter type-id='type-id-32' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3304' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -1741,9 +1896,9 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3399' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3400' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3400' column='1'/>
       <!-- parameter of type 'DBusPendingCall**' -->
-      <parameter type-id='type-id-114' name='pending_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3401' column='1'/>
+      <parameter type-id='type-id-118' name='pending_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3401' column='1'/>
       <!-- parameter of type 'int' -->
       <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3402' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -1754,20 +1909,20 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3535' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3536' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3536' column='1'/>
       <!-- parameter of type 'int' -->
       <parameter type-id='type-id-2' name='timeout_milliseconds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3537' column='1'/>
       <!-- parameter of type 'DBusError*' -->
       <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3538' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusDispatchStatus dbus_connection_dispatch(DBusConnection*) -->
     <function-decl name='dbus_connection_dispatch' mangled-name='dbus_connection_dispatch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_dispatch'>
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31' name='connection' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='4549' column='1'/>
       <!-- typedef DBusDispatchStatus -->
-      <return type-id='type-id-77'/>
+      <return type-id='type-id-60'/>
     </function-decl>
     <!-- dbus_bool_t dbus_connection_read_write(DBusConnection*, int) -->
     <function-decl name='dbus_connection_read_write' mangled-name='dbus_connection_read_write' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-connection.c' line='3801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_connection_read_write'>
@@ -1792,11 +1947,11 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111'/>
+      <parameter type-id='type-id-50'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- typedef DBusHandlerResult -->
-      <return type-id='type-id-86'/>
+      <return type-id='type-id-93'/>
     </function-type>
     <!-- dbus_bool_t (DBusConnection*, const char*, void*) -->
     <function-type size-in-bits='64' id='type-id-128'>
@@ -1814,7 +1969,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31'/>
       <!-- parameter of type 'unsigned long int' -->
-      <parameter type-id='type-id-27'/>
+      <parameter type-id='type-id-26'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- typedef dbus_bool_t -->
@@ -1823,7 +1978,7 @@
     <!-- dbus_bool_t (DBusTimeout*, void*) -->
     <function-type size-in-bits='64' id='type-id-130'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117'/>
+      <parameter type-id='type-id-120'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- typedef dbus_bool_t -->
@@ -1832,7 +1987,7 @@
     <!-- dbus_bool_t (DBusWatch*, void*) -->
     <function-type size-in-bits='64' id='type-id-131'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120'/>
+      <parameter type-id='type-id-121'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- typedef dbus_bool_t -->
@@ -1843,7 +1998,7 @@
       <!-- parameter of type 'DBusConnection*' -->
       <parameter type-id='type-id-31'/>
       <!-- parameter of type 'typedef DBusDispatchStatus' -->
-      <parameter type-id='type-id-77'/>
+      <parameter type-id='type-id-60'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- void -->
@@ -1861,7 +2016,7 @@
     <!-- void (DBusTimeout*, void*) -->
     <function-type size-in-bits='64' id='type-id-135'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117'/>
+      <parameter type-id='type-id-120'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- void -->
@@ -1870,7 +2025,7 @@
     <!-- void (DBusWatch*, void*) -->
     <function-type size-in-bits='64' id='type-id-136'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120'/>
+      <parameter type-id='type-id-121'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- void -->
@@ -1954,7 +2109,7 @@
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='dbus-memory.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
     <!-- typedef unsigned long int size_t -->
-    <typedef-decl name='size_t' type-id='type-id-27' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-141'/>
+    <typedef-decl name='size_t' type-id='type-id-26' filepath='/usr/lib/gcc/x86_64-redhat-linux/4.4.7/include/stddef.h' line='211' column='1' id='type-id-141'/>
     <!-- void dbus_free(void*) -->
     <function-decl name='dbus_free' mangled-name='dbus_free' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-memory.c' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_free'>
       <!-- parameter of type 'void*' -->
@@ -2084,13 +2239,13 @@
     <!-- __va_list_tag* -->
     <pointer-type-def type-id='type-id-142' size-in-bits='64' id='type-id-146'/>
     <!-- const DBusMessage -->
-    <qualified-type-def type-id='type-id-57' const='yes' id='type-id-147'/>
+    <qualified-type-def type-id='type-id-69' const='yes' id='type-id-147'/>
     <!-- const DBusMessage* -->
     <pointer-type-def type-id='type-id-147' size-in-bits='64' id='type-id-148'/>
     <!-- dbus_bool_t dbus_message_contains_unix_fds(DBusMessage*) -->
     <function-decl name='dbus_message_contains_unix_fds' mangled-name='dbus_message_contains_unix_fds' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_contains_unix_fds'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3825' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -2120,22 +2275,22 @@
     <!-- void* dbus_message_get_data(DBusMessage*, dbus_int32_t) -->
     <function-decl name='dbus_message_get_data' mangled-name='dbus_message_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_data'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4635' column='1'/>
       <!-- parameter of type 'typedef dbus_int32_t' -->
-      <parameter type-id='type-id-52' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4636' column='1'/>
+      <parameter type-id='type-id-64' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4636' column='1'/>
       <!-- void* -->
       <return type-id='type-id-10'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_set_data(DBusMessage*, dbus_int32_t, void*, DBusFreeFunction) -->
     <function-decl name='dbus_message_set_data' mangled-name='dbus_message_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_data'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4599' column='1'/>
       <!-- parameter of type 'typedef dbus_int32_t' -->
-      <parameter type-id='type-id-52' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4600' column='1'/>
+      <parameter type-id='type-id-64' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4600' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4601' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4602' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4602' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -2156,21 +2311,21 @@
     <!-- DBusMessage* dbus_message_ref(DBusMessage*) -->
     <function-decl name='dbus_message_ref' mangled-name='dbus_message_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_ref'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1667' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- const char* dbus_message_get_sender(DBusMessage*) -->
     <function-decl name='dbus_message_get_sender' mangled-name='dbus_message_get_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_sender'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3510' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_has_sender(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_has_sender' mangled-name='dbus_message_has_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_sender'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3725' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3726' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2179,14 +2334,14 @@
     <!-- const char* dbus_message_get_destination(DBusMessage*) -->
     <function-decl name='dbus_message_get_destination' mangled-name='dbus_message_get_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_destination'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3450' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_has_destination(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_has_destination' mangled-name='dbus_message_has_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_destination'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3690' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3691' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2195,21 +2350,21 @@
     <!-- const char* dbus_message_get_error_name(DBusMessage*) -->
     <function-decl name='dbus_message_get_error_name' mangled-name='dbus_message_get_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_error_name'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3397' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- const char* dbus_message_get_member(DBusMessage*) -->
     <function-decl name='dbus_message_get_member' mangled-name='dbus_message_get_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_member'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3313' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_has_member(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_has_member' mangled-name='dbus_message_has_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_member'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3335' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3336' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2218,14 +2373,14 @@
     <!-- const char* dbus_message_get_interface(DBusMessage*) -->
     <function-decl name='dbus_message_get_interface' mangled-name='dbus_message_get_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_interface'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3227' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_has_interface(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_has_interface' mangled-name='dbus_message_has_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_interface'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3249' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3250' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2234,14 +2389,14 @@
     <!-- const char* dbus_message_get_path(DBusMessage*) -->
     <function-decl name='dbus_message_get_path' mangled-name='dbus_message_get_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3096' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_has_path(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_has_path' mangled-name='dbus_message_has_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_path'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3120' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3121' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2250,21 +2405,21 @@
     <!-- dbus_uint32_t dbus_message_get_reply_serial(DBusMessage*) -->
     <function-decl name='dbus_message_get_reply_serial' mangled-name='dbus_message_get_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_reply_serial'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1163' column='1'/>
       <!-- typedef dbus_uint32_t -->
       <return type-id='type-id-16'/>
     </function-decl>
     <!-- const char* dbus_message_get_signature(DBusMessage*) -->
     <function-decl name='dbus_message_get_signature' mangled-name='dbus_message_get_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_signature'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3543' column='1'/>
       <!-- const char* -->
       <return type-id='type-id-15'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_has_signature(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_has_signature' mangled-name='dbus_message_has_signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_has_signature'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3754' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='signature' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3755' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2273,7 +2428,7 @@
     <!-- dbus_bool_t dbus_message_set_sender(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_set_sender' mangled-name='dbus_message_set_sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_sender'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3479' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='sender' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3480' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2282,7 +2437,7 @@
     <!-- dbus_bool_t dbus_message_set_destination(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_set_destination' mangled-name='dbus_message_set_destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_destination'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3425' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='destination' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3426' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2291,7 +2446,7 @@
     <!-- dbus_bool_t dbus_message_set_reply_serial(DBusMessage*, dbus_uint32_t) -->
     <function-decl name='dbus_message_set_reply_serial' mangled-name='dbus_message_set_reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_reply_serial'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1143' column='1'/>
       <!-- parameter of type 'typedef dbus_uint32_t' -->
       <parameter type-id='type-id-16' name='reply_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1144' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2300,7 +2455,7 @@
     <!-- dbus_bool_t dbus_message_set_error_name(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_set_error_name' mangled-name='dbus_message_set_error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_error_name'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3371' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3372' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2309,7 +2464,7 @@
     <!-- dbus_bool_t dbus_message_set_member(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_set_member' mangled-name='dbus_message_set_member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_member'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3286' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='member' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3287' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2318,7 +2473,7 @@
     <!-- dbus_bool_t dbus_message_set_interface(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_set_interface' mangled-name='dbus_message_set_interface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_interface'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3198' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3199' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2327,7 +2482,7 @@
     <!-- dbus_bool_t dbus_message_get_path_decomposed(DBusMessage*, char***) -->
     <function-decl name='dbus_message_get_path_decomposed' mangled-name='dbus_message_get_path_decomposed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_path_decomposed'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3164' column='1'/>
       <!-- parameter of type 'char***' -->
       <parameter type-id='type-id-123' name='path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3165' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2336,7 +2491,7 @@
     <!-- dbus_bool_t dbus_message_set_path(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_set_path' mangled-name='dbus_message_set_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_path'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3067' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='object_path' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3068' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2345,21 +2500,21 @@
     <!-- dbus_bool_t dbus_message_get_auto_start(DBusMessage*) -->
     <function-decl name='dbus_message_get_auto_start' mangled-name='dbus_message_get_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_auto_start'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3045' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_get_no_reply(DBusMessage*) -->
     <function-decl name='dbus_message_get_no_reply' mangled-name='dbus_message_get_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_no_reply'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3003' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- void dbus_message_set_auto_start(DBusMessage*, dbus_bool_t) -->
     <function-decl name='dbus_message_set_auto_start' mangled-name='dbus_message_set_auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_auto_start'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3026' column='1'/>
       <!-- parameter of type 'typedef dbus_bool_t' -->
       <parameter type-id='type-id-17' name='auto_start' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3027' column='1'/>
       <!-- void -->
@@ -2368,7 +2523,7 @@
     <!-- void dbus_message_set_no_reply(DBusMessage*, dbus_bool_t) -->
     <function-decl name='dbus_message_set_no_reply' mangled-name='dbus_message_set_no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_no_reply'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2984' column='1'/>
       <!-- parameter of type 'typedef dbus_bool_t' -->
       <parameter type-id='type-id-17' name='no_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2985' column='1'/>
       <!-- void -->
@@ -2432,7 +2587,7 @@
     <!-- void dbus_message_iter_init_append(DBusMessage*, DBusMessageIter*) -->
     <function-decl name='dbus_message_iter_init_append' mangled-name='dbus_message_iter_init_append' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init_append'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2421' column='1'/>
       <!-- parameter of type 'DBusMessageIter*' -->
       <parameter type-id='type-id-145' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2422' column='1'/>
       <!-- void -->
@@ -2512,7 +2667,7 @@
     <!-- dbus_bool_t dbus_message_iter_init(DBusMessage*, DBusMessageIter*) -->
     <function-decl name='dbus_message_iter_init' mangled-name='dbus_message_iter_init' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_iter_init'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2064' column='1'/>
       <!-- parameter of type 'DBusMessageIter*' -->
       <parameter type-id='type-id-145' name='iter' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2065' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2521,7 +2676,7 @@
     <!-- dbus_bool_t dbus_message_append_args_valist(DBusMessage*, int, __va_list_tag*) -->
     <function-decl name='dbus_message_append_args_valist' mangled-name='dbus_message_append_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args_valist'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1824' column='1'/>
       <!-- parameter of type 'int' -->
       <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1825' column='1'/>
       <!-- parameter of type '__va_list_tag*' -->
@@ -2532,7 +2687,7 @@
     <!-- dbus_bool_t dbus_message_append_args(DBusMessage*, int, ...) -->
     <function-decl name='dbus_message_append_args' mangled-name='dbus_message_append_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_append_args'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1792' column='1'/>
       <!-- parameter of type 'int' -->
       <parameter type-id='type-id-2' name='first_arg_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1793' column='1'/>
       <parameter is-variadic='yes'/>
@@ -2542,14 +2697,14 @@
     <!-- int dbus_message_get_type(DBusMessage*) -->
     <function-decl name='dbus_message_get_type' mangled-name='dbus_message_get_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_type'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1722' column='1'/>
       <!-- int -->
       <return type-id='type-id-2'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_is_error(DBusMessage*, const char*) -->
     <function-decl name='dbus_message_is_error' mangled-name='dbus_message_is_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_error'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3657' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3658' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -2558,7 +2713,7 @@
     <!-- dbus_bool_t dbus_message_is_signal(DBusMessage*, const char*, const char*) -->
     <function-decl name='dbus_message_is_signal' mangled-name='dbus_message_is_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_signal'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3630' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3631' column='1'/>
       <!-- parameter of type 'const char*' -->
@@ -2569,7 +2724,7 @@
     <!-- dbus_bool_t dbus_message_is_method_call(DBusMessage*, const char*, const char*) -->
     <function-decl name='dbus_message_is_method_call' mangled-name='dbus_message_is_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_is_method_call'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3602' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='iface' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3603' column='1'/>
       <!-- parameter of type 'const char*' -->
@@ -2580,7 +2735,7 @@
     <!-- void dbus_message_unref(DBusMessage*) -->
     <function-decl name='dbus_message_unref' mangled-name='dbus_message_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_unref'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1690' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -2593,14 +2748,14 @@
       <!-- parameter of type 'DBusError*' -->
       <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4785' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_copy(const DBusMessage*) -->
     <function-decl name='dbus_message_copy' mangled-name='dbus_message_copy' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_copy'>
       <!-- parameter of type 'const DBusMessage*' -->
       <parameter type-id='type-id-148' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1587' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_new_signal(const char*, const char*, const char*) -->
     <function-decl name='dbus_message_new_signal' mangled-name='dbus_message_new_signal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1424' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_signal'>
@@ -2611,7 +2766,7 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1426' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_new_method_call(const char*, const char*, const char*, const char*) -->
     <function-decl name='dbus_message_new_method_call' mangled-name='dbus_message_new_method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1333' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_call'>
@@ -2624,56 +2779,56 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='method' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1336' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_new(int) -->
     <function-decl name='dbus_message_new' mangled-name='dbus_message_new' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new'>
       <!-- parameter of type 'int' -->
       <parameter type-id='type-id-2' name='message_type' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1289' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- dbus_uint32_t dbus_message_get_serial(DBusMessage*) -->
     <function-decl name='dbus_message_get_serial' mangled-name='dbus_message_get_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_serial'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1127' column='1'/>
       <!-- typedef dbus_uint32_t -->
       <return type-id='type-id-16'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_new_error(DBusMessage*, const char*, const char*) -->
     <function-decl name='dbus_message_new_error' mangled-name='dbus_message_new_error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1'/>
+      <parameter type-id='type-id-50' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1470' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1471' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='error_message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1472' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_new_error_printf(DBusMessage*, const char*, const char*, ...) -->
     <function-decl name='dbus_message_new_error_printf' mangled-name='dbus_message_new_error_printf' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_error_printf'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1'/>
+      <parameter type-id='type-id-50' name='reply_to' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1542' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='error_name' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1543' column='1'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-15' name='error_format' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1544' column='1'/>
       <parameter is-variadic='yes'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- DBusMessage* dbus_message_new_method_return(DBusMessage*) -->
     <function-decl name='dbus_message_new_method_return' mangled-name='dbus_message_new_method_return' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_new_method_return'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1'/>
+      <parameter type-id='type-id-50' name='method_call' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1373' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_get_args_valist(DBusMessage*, DBusError*, int, __va_list_tag*) -->
     <function-decl name='dbus_message_get_args_valist' mangled-name='dbus_message_get_args_valist' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args_valist'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2009' column='1'/>
       <!-- parameter of type 'DBusError*' -->
       <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='2010' column='1'/>
       <!-- parameter of type 'int' -->
@@ -2686,7 +2841,7 @@
     <!-- dbus_bool_t dbus_message_get_args(DBusMessage*, DBusError*, int, ...) -->
     <function-decl name='dbus_message_get_args' mangled-name='dbus_message_get_args' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_get_args'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1980' column='1'/>
       <!-- parameter of type 'DBusError*' -->
       <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='1981' column='1'/>
       <!-- parameter of type 'int' -->
@@ -2700,21 +2855,21 @@
       <!-- parameter of type 'DBusError*' -->
       <parameter type-id='type-id-21' name='error' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3796' column='1'/>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3797' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='3797' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- void dbus_message_lock(DBusMessage*) -->
     <function-decl name='dbus_message_lock' mangled-name='dbus_message_lock' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_lock'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='384' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
     <!-- dbus_bool_t dbus_message_marshal(DBusMessage*, char**, int*) -->
     <function-decl name='dbus_message_marshal' mangled-name='dbus_message_marshal' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_marshal'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='msg' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1'/>
+      <parameter type-id='type-id-50' name='msg' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4721' column='1'/>
       <!-- parameter of type 'char**' -->
       <parameter type-id='type-id-122' name='marshalled_data_p' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='4722' column='1'/>
       <!-- parameter of type 'int*' -->
@@ -2725,7 +2880,7 @@
     <!-- void dbus_message_set_serial(DBusMessage*, dbus_uint32_t) -->
     <function-decl name='dbus_message_set_serial' mangled-name='dbus_message_set_serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_message_set_serial'>
       <!-- parameter of type 'DBusMessage*' -->
-      <parameter type-id='type-id-111' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1'/>
+      <parameter type-id='type-id-50' name='message' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='254' column='1'/>
       <!-- parameter of type 'typedef dbus_uint32_t' -->
       <parameter type-id='type-id-16' name='serial' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-message.c' line='255' column='1'/>
       <!-- void -->
@@ -2751,30 +2906,73 @@
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='dbus-pending-call.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
+    <!-- struct DBusPendingCall -->
+    <class-decl name='DBusPendingCall' size-in-bits='576' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='63' column='1' id='type-id-115'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <!-- DBusAtomic DBusPendingCall::refcount -->
+        <var-decl name='refcount' type-id='type-id-46' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='64' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <!-- DBusDataSlotList DBusPendingCall::slot_list -->
+        <var-decl name='slot_list' type-id='type-id-55' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='66' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <!-- DBusPendingCallNotifyFunction DBusPendingCall::function -->
+        <var-decl name='function' type-id='type-id-149' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='68' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <!-- DBusConnection* DBusPendingCall::connection -->
+        <var-decl name='connection' type-id='type-id-31' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='70' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <!-- DBusMessage* DBusPendingCall::reply -->
+        <var-decl name='reply' type-id='type-id-50' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='71' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='384'>
+        <!-- DBusTimeout* DBusPendingCall::timeout -->
+        <var-decl name='timeout' type-id='type-id-120' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='72' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='448'>
+        <!-- DBusList* DBusPendingCall::timeout_link -->
+        <var-decl name='timeout_link' type-id='type-id-8' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='74' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='512'>
+        <!-- dbus_uint32_t DBusPendingCall::reply_serial -->
+        <var-decl name='reply_serial' type-id='type-id-16' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='76' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='31'>
+        <!-- unsigned int DBusPendingCall::completed -->
+        <var-decl name='completed' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='78' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='30'>
+        <!-- unsigned int DBusPendingCall::timeout_added -->
+        <var-decl name='timeout_added' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='79' column='1'/>
+      </data-member>
+    </class-decl>
     <!-- typedef void (DBusPendingCall*, void*)* DBusPendingCallNotifyFunction -->
-    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='type-id-149' filepath='../dbus/dbus-connection.h' line='162' column='1' id='type-id-150'/>
+    <typedef-decl name='DBusPendingCallNotifyFunction' type-id='type-id-150' filepath='../dbus/dbus-connection.h' line='162' column='1' id='type-id-149'/>
     <!-- void (DBusPendingCall*, void*)* -->
-    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-149'/>
+    <pointer-type-def type-id='type-id-151' size-in-bits='64' id='type-id-150'/>
     <!-- void* dbus_pending_call_get_data(DBusPendingCall*, dbus_int32_t) -->
     <function-decl name='dbus_pending_call_get_data' mangled-name='dbus_pending_call_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_data'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='827' column='1'/>
       <!-- parameter of type 'typedef dbus_int32_t' -->
-      <parameter type-id='type-id-52' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='828' column='1'/>
+      <parameter type-id='type-id-64' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='828' column='1'/>
       <!-- void* -->
       <return type-id='type-id-10'/>
     </function-decl>
     <!-- DBusMessage* dbus_pending_call_steal_reply(DBusPendingCall*) -->
     <function-decl name='dbus_pending_call_steal_reply' mangled-name='dbus_pending_call_steal_reply' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_steal_reply'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='702' column='1'/>
       <!-- DBusMessage* -->
-      <return type-id='type-id-111'/>
+      <return type-id='type-id-50'/>
     </function-decl>
     <!-- dbus_bool_t dbus_pending_call_get_completed(DBusPendingCall*) -->
     <function-decl name='dbus_pending_call_get_completed' mangled-name='dbus_pending_call_get_completed' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_get_completed'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='679' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -2795,61 +2993,61 @@
     <!-- void dbus_pending_call_block(DBusPendingCall*) -->
     <function-decl name='dbus_pending_call_block' mangled-name='dbus_pending_call_block' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_block'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='737' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
     <!-- void dbus_pending_call_cancel(DBusPendingCall*) -->
     <function-decl name='dbus_pending_call_cancel' mangled-name='dbus_pending_call_cancel' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_cancel'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='663' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
     <!-- void dbus_pending_call_unref(DBusPendingCall*) -->
     <function-decl name='dbus_pending_call_unref' mangled-name='dbus_pending_call_unref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_unref'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='597' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
     <!-- DBusPendingCall* dbus_pending_call_ref(DBusPendingCall*) -->
     <function-decl name='dbus_pending_call_ref' mangled-name='dbus_pending_call_ref' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_ref'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='577' column='1'/>
       <!-- DBusPendingCall* -->
-      <return type-id='type-id-113'/>
+      <return type-id='type-id-117'/>
     </function-decl>
     <!-- dbus_bool_t dbus_pending_call_set_data(DBusPendingCall*, dbus_int32_t, void*, DBusFreeFunction) -->
     <function-decl name='dbus_pending_call_set_data' mangled-name='dbus_pending_call_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_data'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='801' column='1'/>
       <!-- parameter of type 'typedef dbus_int32_t' -->
-      <parameter type-id='type-id-52' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='802' column='1'/>
+      <parameter type-id='type-id-64' name='slot' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='802' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='803' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='804' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='804' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- dbus_bool_t dbus_pending_call_set_notify(DBusPendingCall*, DBusPendingCallNotifyFunction, void*, DBusFreeFunction) -->
     <function-decl name='dbus_pending_call_set_notify' mangled-name='dbus_pending_call_set_notify' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_pending_call_set_notify'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1'/>
+      <parameter type-id='type-id-117' name='pending' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='622' column='1'/>
       <!-- parameter of type 'typedef DBusPendingCallNotifyFunction' -->
-      <parameter type-id='type-id-150' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='623' column='1'/>
+      <parameter type-id='type-id-149' name='function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='623' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='624' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='625' column='1'/>
+      <parameter type-id='type-id-58' name='free_user_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-pending-call.c' line='625' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- void (DBusPendingCall*, void*) -->
     <function-type size-in-bits='64' id='type-id-151'>
       <!-- parameter of type 'DBusPendingCall*' -->
-      <parameter type-id='type-id-113'/>
+      <parameter type-id='type-id-117'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10'/>
       <!-- void -->
@@ -2860,18 +3058,18 @@
     <!-- char[16] -->
     <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='128' id='type-id-152'>
       <!-- <anonymous range>[16] -->
-      <subrange length='16' type-id='type-id-27' id='type-id-153'/>
+      <subrange length='16' type-id='type-id-26' id='type-id-153'/>
     </array-type-def>
     <!-- dbus_uint32_t[4] -->
     <array-type-def dimensions='1' type-id='type-id-16' size-in-bits='128' id='type-id-154'>
       <!-- <anonymous range>[4] -->
-      <subrange length='4' type-id='type-id-27' id='type-id-155'/>
+      <subrange length='4' type-id='type-id-26' id='type-id-155'/>
     </array-type-def>
     <!-- struct DBusServer -->
     <class-decl name='DBusServer' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../dbus/dbus-server-protected.h' line='57' column='1' id='type-id-156'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- DBusAtomic DBusServer::refcount -->
-        <var-decl name='refcount' type-id='type-id-50' visibility='default' filepath='../dbus/dbus-server-protected.h' line='58' column='1'/>
+        <var-decl name='refcount' type-id='type-id-46' visibility='default' filepath='../dbus/dbus-server-protected.h' line='58' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- const DBusServerVTable* DBusServer::vtable -->
@@ -2879,7 +3077,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- DBusRMutex* DBusServer::mutex -->
-        <var-decl name='mutex' type-id='type-id-116' visibility='default' filepath='../dbus/dbus-server-protected.h' line='60' column='1'/>
+        <var-decl name='mutex' type-id='type-id-47' visibility='default' filepath='../dbus/dbus-server-protected.h' line='60' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <!-- DBusGUID DBusServer::guid -->
@@ -2891,11 +3089,11 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
         <!-- DBusWatchList* DBusServer::watches -->
-        <var-decl name='watches' type-id='type-id-121' visibility='default' filepath='../dbus/dbus-server-protected.h' line='66' column='1'/>
+        <var-decl name='watches' type-id='type-id-53' visibility='default' filepath='../dbus/dbus-server-protected.h' line='66' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
         <!-- DBusTimeoutList* DBusServer::timeouts -->
-        <var-decl name='timeouts' type-id='type-id-118' visibility='default' filepath='../dbus/dbus-server-protected.h' line='67' column='1'/>
+        <var-decl name='timeouts' type-id='type-id-54' visibility='default' filepath='../dbus/dbus-server-protected.h' line='67' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
         <!-- char* DBusServer::address -->
@@ -2911,7 +3109,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
         <!-- DBusDataSlotList DBusServer::slot_list -->
-        <var-decl name='slot_list' type-id='type-id-59' visibility='default' filepath='../dbus/dbus-server-protected.h' line='74' column='1'/>
+        <var-decl name='slot_list' type-id='type-id-55' visibility='default' filepath='../dbus/dbus-server-protected.h' line='74' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
         <!-- DBusNewConnectionFunction DBusServer::new_connection_function -->
@@ -2923,7 +3121,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
         <!-- DBusFreeFunction DBusServer::new_connection_free_data_function -->
-        <var-decl name='new_connection_free_data_function' type-id='type-id-66' visibility='default' filepath='../dbus/dbus-server-protected.h' line='80' column='1'/>
+        <var-decl name='new_connection_free_data_function' type-id='type-id-58' visibility='default' filepath='../dbus/dbus-server-protected.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1088'>
         <!-- char** DBusServer::auth_mechanisms -->
@@ -2998,7 +3196,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='891' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='892' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='892' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
@@ -3018,7 +3216,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1118' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1119' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_func' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='1119' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -3050,15 +3248,15 @@
       <!-- parameter of type 'DBusServer*' -->
       <parameter type-id='type-id-166' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='982' column='1'/>
       <!-- parameter of type 'typedef DBusAddTimeoutFunction' -->
-      <parameter type-id='type-id-93' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='983' column='1'/>
+      <parameter type-id='type-id-100' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='983' column='1'/>
       <!-- parameter of type 'typedef DBusRemoveTimeoutFunction' -->
-      <parameter type-id='type-id-96' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='984' column='1'/>
+      <parameter type-id='type-id-104' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='984' column='1'/>
       <!-- parameter of type 'typedef DBusTimeoutToggledFunction' -->
-      <parameter type-id='type-id-97' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='985' column='1'/>
+      <parameter type-id='type-id-105' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='985' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='986' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='987' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='987' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -3067,15 +3265,15 @@
       <!-- parameter of type 'DBusServer*' -->
       <parameter type-id='type-id-166' name='server' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='929' column='1'/>
       <!-- parameter of type 'typedef DBusAddWatchFunction' -->
-      <parameter type-id='type-id-99' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='930' column='1'/>
+      <parameter type-id='type-id-107' name='add_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='930' column='1'/>
       <!-- parameter of type 'typedef DBusRemoveWatchFunction' -->
-      <parameter type-id='type-id-102' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='931' column='1'/>
+      <parameter type-id='type-id-111' name='remove_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='931' column='1'/>
       <!-- parameter of type 'typedef DBusWatchToggledFunction' -->
-      <parameter type-id='type-id-103' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='932' column='1'/>
+      <parameter type-id='type-id-112' name='toggled_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='932' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='933' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='934' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-server.c' line='934' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -3485,7 +3683,7 @@
     <!-- DBusCondVar* () -->
     <function-type size-in-bits='64' id='type-id-202'>
       <!-- DBusCondVar* -->
-      <return type-id='type-id-108'/>
+      <return type-id='type-id-49'/>
     </function-type>
     <!-- DBusMutex* () -->
     <function-type size-in-bits='64' id='type-id-204'>
@@ -3495,7 +3693,7 @@
     <!-- dbus_bool_t (DBusCondVar*, DBusMutex*, int) -->
     <function-type size-in-bits='64' id='type-id-207'>
       <!-- parameter of type 'DBusCondVar*' -->
-      <parameter type-id='type-id-108'/>
+      <parameter type-id='type-id-49'/>
       <!-- parameter of type 'DBusMutex*' -->
       <parameter type-id='type-id-203'/>
       <!-- parameter of type 'int' -->
@@ -3518,14 +3716,14 @@
     <!-- void (DBusCondVar*) -->
     <function-type size-in-bits='64' id='type-id-210'>
       <!-- parameter of type 'DBusCondVar*' -->
-      <parameter type-id='type-id-108'/>
+      <parameter type-id='type-id-49'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-type>
     <!-- void (DBusCondVar*, DBusMutex*) -->
     <function-type size-in-bits='64' id='type-id-211'>
       <!-- parameter of type 'DBusCondVar*' -->
-      <parameter type-id='type-id-108'/>
+      <parameter type-id='type-id-49'/>
       <!-- parameter of type 'DBusMutex*' -->
       <parameter type-id='type-id-203'/>
       <!-- void -->
@@ -3540,46 +3738,81 @@
     </function-type>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='dbus-timeout.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
+    <!-- struct DBusTimeout -->
+    <class-decl name='DBusTimeout' size-in-bits='448' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='41' column='1' id='type-id-101'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <!-- int DBusTimeout::refcount -->
+        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='42' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <!-- int DBusTimeout::interval -->
+        <var-decl name='interval' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='43' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <!-- DBusTimeoutHandler DBusTimeout::handler -->
+        <var-decl name='handler' type-id='type-id-213' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='45' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <!-- void* DBusTimeout::handler_data -->
+        <var-decl name='handler_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='46' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <!-- DBusFreeFunction DBusTimeout::free_handler_data_function -->
+        <var-decl name='free_handler_data_function' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='47' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <!-- void* DBusTimeout::data -->
+        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='49' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <!-- DBusFreeFunction DBusTimeout::free_data_function -->
+        <var-decl name='free_data_function' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='50' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='31'>
+        <!-- unsigned int DBusTimeout::enabled -->
+        <var-decl name='enabled' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='51' column='1'/>
+      </data-member>
+    </class-decl>
     <!-- typedef typedef dbus_bool_t (void*)* DBusTimeoutHandler -->
-    <typedef-decl name='DBusTimeoutHandler' type-id='type-id-213' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='41' column='1' id='type-id-214'/>
+    <typedef-decl name='DBusTimeoutHandler' type-id='type-id-214' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.h' line='41' column='1' id='type-id-213'/>
     <!-- typedef dbus_bool_t (void*)* -->
-    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-213'/>
+    <pointer-type-def type-id='type-id-215' size-in-bits='64' id='type-id-214'/>
     <!-- int dbus_timeout_get_interval(DBusTimeout*) -->
     <function-decl name='dbus_timeout_get_interval' mangled-name='dbus_timeout_get_interval' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='416' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_timeout_get_interval'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='416' column='1'/>
+      <parameter type-id='type-id-120' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='416' column='1'/>
       <!-- int -->
       <return type-id='type-id-2'/>
     </function-decl>
     <!-- void* dbus_timeout_get_data(DBusTimeout*) -->
     <function-decl name='dbus_timeout_get_data' mangled-name='dbus_timeout_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='429' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_timeout_get_data'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='429' column='1'/>
+      <parameter type-id='type-id-120' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='429' column='1'/>
       <!-- void* -->
       <return type-id='type-id-10'/>
     </function-decl>
     <!-- void dbus_timeout_set_data(DBusTimeout*, void*, DBusFreeFunction) -->
     <function-decl name='dbus_timeout_set_data' mangled-name='dbus_timeout_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='446' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_timeout_set_data'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='446' column='1'/>
+      <parameter type-id='type-id-120' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='446' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='447' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='448' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='448' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
     <!-- dbus_bool_t dbus_timeout_handle(DBusTimeout*) -->
     <function-decl name='dbus_timeout_handle' mangled-name='dbus_timeout_handle' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='472' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_timeout_handle'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='472' column='1'/>
+      <parameter type-id='type-id-120' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='472' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- dbus_bool_t dbus_timeout_get_enabled(DBusTimeout*) -->
     <function-decl name='dbus_timeout_get_enabled' mangled-name='dbus_timeout_get_enabled' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='486' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_timeout_get_enabled'>
       <!-- parameter of type 'DBusTimeout*' -->
-      <parameter type-id='type-id-117' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='486' column='1'/>
+      <parameter type-id='type-id-120' name='timeout' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-timeout.c' line='486' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
@@ -3614,14 +3847,57 @@
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='dbus-watch.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
+    <!-- struct DBusWatch -->
+    <class-decl name='DBusWatch' size-in-bits='512' is-struct='yes' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='41' column='1' id='type-id-108'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <!-- int DBusWatch::refcount -->
+        <var-decl name='refcount' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='42' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='32'>
+        <!-- int DBusWatch::fd -->
+        <var-decl name='fd' type-id='type-id-2' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='43' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <!-- unsigned int DBusWatch::flags -->
+        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='44' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='128'>
+        <!-- DBusWatchHandler DBusWatch::handler -->
+        <var-decl name='handler' type-id='type-id-216' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='46' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='192'>
+        <!-- void* DBusWatch::handler_data -->
+        <var-decl name='handler_data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='47' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='256'>
+        <!-- DBusFreeFunction DBusWatch::free_handler_data_function -->
+        <var-decl name='free_handler_data_function' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='48' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='320'>
+        <!-- void* DBusWatch::data -->
+        <var-decl name='data' type-id='type-id-10' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='50' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='384'>
+        <!-- DBusFreeFunction DBusWatch::free_data_function -->
+        <var-decl name='free_data_function' type-id='type-id-58' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='51' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='31'>
+        <!-- unsigned int DBusWatch::enabled -->
+        <var-decl name='enabled' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='52' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='30'>
+        <!-- unsigned int DBusWatch::oom_last_time -->
+        <var-decl name='oom_last_time' type-id='type-id-3' visibility='default' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='53' column='1'/>
+      </data-member>
+    </class-decl>
     <!-- typedef typedef dbus_bool_t (DBusWatch*, unsigned int, void*)* DBusWatchHandler -->
-    <typedef-decl name='DBusWatchHandler' type-id='type-id-216' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='43' column='1' id='type-id-217'/>
+    <typedef-decl name='DBusWatchHandler' type-id='type-id-217' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.h' line='43' column='1' id='type-id-216'/>
     <!-- typedef dbus_bool_t (DBusWatch*, unsigned int, void*)* -->
-    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-216'/>
+    <pointer-type-def type-id='type-id-218' size-in-bits='64' id='type-id-217'/>
     <!-- dbus_bool_t dbus_watch_handle(DBusWatch*, unsigned int) -->
     <function-decl name='dbus_watch_handle' mangled-name='dbus_watch_handle' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='698' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_handle'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='698' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='698' column='1'/>
       <!-- parameter of type 'unsigned int' -->
       <parameter type-id='type-id-3' name='flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='699' column='1'/>
       <!-- typedef dbus_bool_t -->
@@ -3630,60 +3906,60 @@
     <!-- dbus_bool_t dbus_watch_get_enabled(DBusWatch*) -->
     <function-decl name='dbus_watch_get_enabled' mangled-name='dbus_watch_get_enabled' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='667' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_get_enabled'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='667' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='667' column='1'/>
       <!-- typedef dbus_bool_t -->
       <return type-id='type-id-17'/>
     </function-decl>
     <!-- void dbus_watch_set_data(DBusWatch*, void*, DBusFreeFunction) -->
     <function-decl name='dbus_watch_set_data' mangled-name='dbus_watch_set_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='642' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_set_data'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='642' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='642' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-10' name='data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='643' column='1'/>
       <!-- parameter of type 'typedef DBusFreeFunction' -->
-      <parameter type-id='type-id-66' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='644' column='1'/>
+      <parameter type-id='type-id-58' name='free_data_function' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='644' column='1'/>
       <!-- void -->
       <return type-id='type-id-4'/>
     </function-decl>
     <!-- void* dbus_watch_get_data(DBusWatch*) -->
     <function-decl name='dbus_watch_get_data' mangled-name='dbus_watch_get_data' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='623' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_get_data'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='623' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='623' column='1'/>
       <!-- void* -->
       <return type-id='type-id-10'/>
     </function-decl>
     <!-- unsigned int dbus_watch_get_flags(DBusWatch*) -->
     <function-decl name='dbus_watch_get_flags' mangled-name='dbus_watch_get_flags' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='607' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_get_flags'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='607' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='607' column='1'/>
       <!-- unsigned int -->
       <return type-id='type-id-3'/>
     </function-decl>
     <!-- int dbus_watch_get_socket(DBusWatch*) -->
     <function-decl name='dbus_watch_get_socket' mangled-name='dbus_watch_get_socket' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='586' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_get_socket'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='586' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='586' column='1'/>
       <!-- int -->
       <return type-id='type-id-2'/>
     </function-decl>
     <!-- int dbus_watch_get_unix_fd(DBusWatch*) -->
     <function-decl name='dbus_watch_get_unix_fd' mangled-name='dbus_watch_get_unix_fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='557' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_get_unix_fd'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='557' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='557' column='1'/>
       <!-- int -->
       <return type-id='type-id-2'/>
     </function-decl>
     <!-- int dbus_watch_get_fd(DBusWatch*) -->
     <function-decl name='dbus_watch_get_fd' mangled-name='dbus_watch_get_fd' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='536' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='dbus_watch_get_fd'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='536' column='1'/>
+      <parameter type-id='type-id-121' name='watch' filepath='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus/dbus-watch.c' line='536' column='1'/>
       <!-- int -->
       <return type-id='type-id-2'/>
     </function-decl>
     <!-- dbus_bool_t (DBusWatch*, unsigned int, void*) -->
     <function-type size-in-bits='64' id='type-id-218'>
       <!-- parameter of type 'DBusWatch*' -->
-      <parameter type-id='type-id-120'/>
+      <parameter type-id='type-id-121'/>
       <!-- parameter of type 'unsigned int' -->
       <parameter type-id='type-id-3'/>
       <!-- parameter of type 'void*' -->
diff --git a/tests/data/test-annotate/test15-pr18892.so.abi b/tests/data/test-annotate/test15-pr18892.so.abi
index 1af9906fa404..7b61907ec50c 100644
--- a/tests/data/test-annotate/test15-pr18892.so.abi
+++ b/tests/data/test-annotate/test15-pr18892.so.abi
@@ -3051,17 +3051,15 @@
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/interception/interception_type_test.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/interception' language='LANG_C_plus_plus'>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
-    <!-- struct backtrace_freelist_struct -->
-    <class-decl name='backtrace_freelist_struct' size-in-bits='128' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-3'/>
     <!-- struct backtrace_state -->
-    <class-decl name='backtrace_state' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='127' column='1' id='type-id-4'>
+    <class-decl name='backtrace_state' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='127' column='1' id='type-id-3'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- const char* backtrace_state::filename -->
         <var-decl name='filename' type-id='type-id-2' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='130' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int backtrace_state::threaded -->
-        <var-decl name='threaded' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='132' column='1'/>
+        <var-decl name='threaded' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='132' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- void* backtrace_state::lock -->
@@ -3069,7 +3067,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <!-- fileline backtrace_state::fileline_fn -->
-        <var-decl name='fileline_fn' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='138' column='1'/>
+        <var-decl name='fileline_fn' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='138' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <!-- void* backtrace_state::fileline_data -->
@@ -3077,7 +3075,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
         <!-- syminfo backtrace_state::syminfo_fn -->
-        <var-decl name='syminfo_fn' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='142' column='1'/>
+        <var-decl name='syminfo_fn' type-id='type-id-6' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='142' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
         <!-- void* backtrace_state::syminfo_data -->
@@ -3085,54 +3083,54 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
         <!-- int backtrace_state::fileline_initialization_failed -->
-        <var-decl name='fileline_initialization_failed' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='146' column='1'/>
+        <var-decl name='fileline_initialization_failed' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='146' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='480'>
         <!-- int backtrace_state::lock_alloc -->
-        <var-decl name='lock_alloc' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='148' column='1'/>
+        <var-decl name='lock_alloc' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='148' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
         <!-- backtrace_freelist_struct* backtrace_state::freelist -->
-        <var-decl name='freelist' type-id='type-id-8' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='150' column='1'/>
+        <var-decl name='freelist' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='150' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef int (backtrace_state*, typedef uintptr_t, typedef backtrace_full_callback, typedef backtrace_error_callback, void*)* fileline -->
-    <typedef-decl name='fileline' type-id='type-id-9' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='114' column='1' id='type-id-6'/>
+    <typedef-decl name='fileline' type-id='type-id-8' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='114' column='1' id='type-id-5'/>
     <!-- typedef void (backtrace_state*, typedef uintptr_t, typedef backtrace_syminfo_callback, typedef backtrace_error_callback, void*)* syminfo -->
-    <typedef-decl name='syminfo' type-id='type-id-10' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='121' column='1' id='type-id-7'/>
+    <typedef-decl name='syminfo' type-id='type-id-9' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='121' column='1' id='type-id-6'/>
     <!-- struct backtrace_vector -->
-    <class-decl name='backtrace_vector' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='221' column='1' id='type-id-11'>
+    <class-decl name='backtrace_vector' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='221' column='1' id='type-id-10'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- void* backtrace_vector::base -->
         <var-decl name='base' type-id='type-id-1' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='224' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- size_t backtrace_vector::size -->
-        <var-decl name='size' type-id='type-id-12' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='226' column='1'/>
+        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='226' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- size_t backtrace_vector::alc -->
-        <var-decl name='alc' type-id='type-id-12' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='228' column='1'/>
+        <var-decl name='alc' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='228' column='1'/>
       </data-member>
     </class-decl>
     <!-- typedef int (void*, void*)* __compar_fn_t -->
-    <typedef-decl name='__compar_fn_t' type-id='type-id-13' filepath='/usr/include/stdlib.h' line='742' column='1' id='type-id-14'/>
+    <typedef-decl name='__compar_fn_t' type-id='type-id-12' filepath='/usr/include/stdlib.h' line='742' column='1' id='type-id-13'/>
     <!-- backtrace_freelist_struct* -->
-    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-8'/>
+    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-7'/>
     <!-- backtrace_state* -->
-    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-15'/>
+    <pointer-type-def type-id='type-id-3' size-in-bits='64' id='type-id-15'/>
     <!-- backtrace_vector* -->
-    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-16'/>
+    <pointer-type-def type-id='type-id-10' size-in-bits='64' id='type-id-16'/>
     <!-- const unsigned char -->
     <qualified-type-def type-id='type-id-17' const='yes' id='type-id-18'/>
     <!-- const unsigned char* -->
     <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-19'/>
     <!-- fileline* -->
-    <pointer-type-def type-id='type-id-6' size-in-bits='64' id='type-id-20'/>
+    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-20'/>
     <!-- int (backtrace_state*, typedef uintptr_t, typedef backtrace_full_callback, typedef backtrace_error_callback, void*)* -->
-    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-9'/>
+    <pointer-type-def type-id='type-id-21' size-in-bits='64' id='type-id-8'/>
     <!-- void (backtrace_state*, typedef uintptr_t, typedef backtrace_syminfo_callback, typedef backtrace_error_callback, void*)* -->
-    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-10'/>
+    <pointer-type-def type-id='type-id-22' size-in-bits='64' id='type-id-9'/>
     <!-- int __asan_backtrace_dwarf_add(backtrace_state*, uintptr_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, const unsigned char*, size_t, int, backtrace_error_callback, void*, fileline*) -->
     <function-decl name='__asan_backtrace_dwarf_add' mangled-name='__asan_backtrace_dwarf_add' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2958' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_dwarf_add'>
       <!-- parameter of type 'backtrace_state*' -->
@@ -3142,25 +3140,25 @@
       <!-- parameter of type 'const unsigned char*' -->
       <parameter type-id='type-id-19' name='dwarf_info' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2960' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='dwarf_info_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2961' column='1'/>
+      <parameter type-id='type-id-11' name='dwarf_info_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2961' column='1'/>
       <!-- parameter of type 'const unsigned char*' -->
       <parameter type-id='type-id-19' name='dwarf_line' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2962' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='dwarf_line_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2963' column='1'/>
+      <parameter type-id='type-id-11' name='dwarf_line_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2963' column='1'/>
       <!-- parameter of type 'const unsigned char*' -->
       <parameter type-id='type-id-19' name='dwarf_abbrev' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2964' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='dwarf_abbrev_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2965' column='1'/>
+      <parameter type-id='type-id-11' name='dwarf_abbrev_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2965' column='1'/>
       <!-- parameter of type 'const unsigned char*' -->
       <parameter type-id='type-id-19' name='dwarf_ranges' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2966' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='dwarf_ranges_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2967' column='1'/>
+      <parameter type-id='type-id-11' name='dwarf_ranges_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2967' column='1'/>
       <!-- parameter of type 'const unsigned char*' -->
       <parameter type-id='type-id-19' name='dwarf_str' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2968' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='dwarf_str_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2969' column='1'/>
+      <parameter type-id='type-id-11' name='dwarf_str_size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2969' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='is_bigendian' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2970' column='1'/>
+      <parameter type-id='type-id-4' name='is_bigendian' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2970' column='1'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2971' column='1'/>
       <!-- parameter of type 'void*' -->
@@ -3168,14 +3166,14 @@
       <!-- parameter of type 'fileline*' -->
       <parameter type-id='type-id-20' name='fileline_fn' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/dwarf.c' line='2972' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void* __asan_backtrace_vector_grow(backtrace_state*, size_t, backtrace_error_callback, void*, backtrace_vector*) -->
     <function-decl name='__asan_backtrace_vector_grow' mangled-name='__asan_backtrace_vector_grow' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='235' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_grow'>
       <!-- parameter of type 'backtrace_state*' -->
       <parameter type-id='type-id-15'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24'/>
       <!-- parameter of type 'void*' -->
@@ -3190,12 +3188,12 @@
       <!-- parameter of type 'char*' -->
       <parameter type-id='type-id-25'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <parameter is-variadic='yes'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void __asan_backtrace_free(backtrace_state*, void*, size_t, backtrace_error_callback, void*) -->
     <function-decl name='__asan_backtrace_free' mangled-name='__asan_backtrace_free' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='212' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_free'>
@@ -3204,7 +3202,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24'/>
       <!-- parameter of type 'void*' -->
@@ -3217,9 +3215,9 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- void* -->
       <return type-id='type-id-1'/>
     </function-decl>
@@ -3230,11 +3228,11 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'typedef __compar_fn_t' -->
-      <parameter type-id='type-id-14'/>
+      <parameter type-id='type-id-13'/>
       <!-- void* -->
       <return type-id='type-id-1'/>
     </function-decl>
@@ -3243,9 +3241,9 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- typedef size_t -->
-      <return type-id='type-id-12'/>
+      <return type-id='type-id-11'/>
     </function-decl>
     <!-- int __asan_internal_strcmp(const char*, const char*) -->
     <function-decl name='__asan_internal_strcmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='43' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -3254,14 +3252,14 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void* __asan_backtrace_alloc(backtrace_state*, size_t, backtrace_error_callback, void*) -->
     <function-decl name='__asan_backtrace_alloc' mangled-name='__asan_backtrace_alloc' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='206' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_alloc'>
       <!-- parameter of type 'backtrace_state*' -->
       <parameter type-id='type-id-15'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24'/>
       <!-- parameter of type 'void*' -->
@@ -3274,11 +3272,11 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'int (void*, void*)*' -->
-      <parameter type-id='type-id-13'/>
+      <parameter type-id='type-id-12'/>
       <!-- void -->
       <return type-id='type-id-26'/>
     </function-decl>
@@ -3293,7 +3291,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int (backtrace_state*, uintptr_t, backtrace_full_callback, backtrace_error_callback, void*) -->
     <function-type size-in-bits='64' id='type-id-21'>
@@ -3308,7 +3306,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-type>
     <!-- void (backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
     <function-type size-in-bits='64' id='type-id-22'>
@@ -3334,7 +3332,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
@@ -3351,7 +3349,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='168' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_backtrace_syminfo(backtrace_state*, uintptr_t, backtrace_syminfo_callback, backtrace_error_callback, void*) -->
     <function-decl name='__asan_backtrace_syminfo' mangled-name='__asan_backtrace_syminfo' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='182' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_syminfo'>
@@ -3366,7 +3364,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/fileline.c' line='184' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_backtrace_open(const char*, backtrace_error_callback, void*, int*) -->
     <function-decl name='__asan_backtrace_open' mangled-name='__asan_backtrace_open' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='159' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_open'>
@@ -3379,14 +3377,14 @@
       <!-- parameter of type 'int*' -->
       <parameter type-id='type-id-30'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_backtrace_initialize(backtrace_state*, int, backtrace_error_callback, void*, fileline*) -->
     <function-decl name='__asan_backtrace_initialize' mangled-name='__asan_backtrace_initialize' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='268' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_initialize'>
       <!-- parameter of type 'backtrace_state*' -->
       <parameter type-id='type-id-15'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24'/>
       <!-- parameter of type 'void*' -->
@@ -3394,10 +3392,21 @@
       <!-- parameter of type 'fileline*' -->
       <parameter type-id='type-id-20'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
+    <!-- struct backtrace_freelist_struct -->
+    <class-decl name='backtrace_freelist_struct' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='55' column='1' id='type-id-14'>
+      <data-member access='public' layout-offset-in-bits='0'>
+        <!-- backtrace_freelist_struct* backtrace_freelist_struct::next -->
+        <var-decl name='next' type-id='type-id-7' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='58' column='1'/>
+      </data-member>
+      <data-member access='public' layout-offset-in-bits='64'>
+        <!-- size_t backtrace_freelist_struct::size -->
+        <var-decl name='size' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='60' column='1'/>
+      </data-member>
+    </class-decl>
     <!-- void* __asan_backtrace_vector_finish(backtrace_state*, backtrace_vector*, backtrace_error_callback, void*) -->
     <function-decl name='__asan_backtrace_vector_finish' mangled-name='__asan_backtrace_vector_finish' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmap.c' line='258' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_vector_finish'>
       <!-- parameter of type 'backtrace_state*' -->
@@ -3429,7 +3438,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- size_t backtrace_view::len -->
-        <var-decl name='len' type-id='type-id-12' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='176' column='1'/>
+        <var-decl name='len' type-id='type-id-11' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/internal.h' line='176' column='1'/>
       </data-member>
     </class-decl>
     <!-- backtrace_view* -->
@@ -3439,11 +3448,11 @@
       <!-- parameter of type 'backtrace_state*' -->
       <parameter type-id='type-id-15' name='state' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='53' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
+      <parameter type-id='type-id-4' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
       <!-- parameter of type 'typedef off_t' -->
       <parameter type-id='type-id-32' name='offset' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
+      <parameter type-id='type-id-11' name='size' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='54' column='1'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='55' column='1'/>
       <!-- parameter of type 'void*' -->
@@ -3451,7 +3460,7 @@
       <!-- parameter of type 'backtrace_view*' -->
       <parameter type-id='type-id-35' name='view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='56' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void __asan_backtrace_release_view(backtrace_state*, backtrace_view*, backtrace_error_callback, void*) -->
     <function-decl name='__asan_backtrace_release_view' mangled-name='__asan_backtrace_release_view' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/mmapio.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_release_view'>
@@ -3469,20 +3478,20 @@
     <!-- int getpagesize() -->
     <function-decl name='getpagesize' filepath='/usr/include/unistd.h' line='992' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void* mmap(void*, size_t, int, int, int, __off_t) -->
     <function-decl name='mmap' filepath='/usr/include/sys/mman.h' line='58' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'typedef __off_t' -->
       <parameter type-id='type-id-31'/>
       <!-- void* -->
@@ -3493,42 +3502,42 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
     <!-- int __asan_backtrace_close(int, backtrace_error_callback, void*) -->
     <function-decl name='__asan_backtrace_close' mangled-name='__asan_backtrace_close' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_backtrace_close'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1'/>
+      <parameter type-id='type-id-4' name='descriptor' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='91' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1' name='data' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/posix.c' line='92' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int open(const char*, int, ...) -->
     <function-decl name='open' filepath='/usr/include/fcntl.h' line='131' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <parameter is-variadic='yes'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int fcntl(int, int, ...) -->
     <function-decl name='fcntl' filepath='/usr/include/fcntl.h' line='122' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <parameter is-variadic='yes'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int* __errno_location() -->
     <function-decl name='__errno_location' filepath='/usr/include/bits/errno.h' line='47' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -3538,9 +3547,9 @@
     <!-- int close(int) -->
     <function-decl name='close' filepath='/usr/include/unistd.h' line='350' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C89'>
@@ -3549,7 +3558,7 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2' name='filename' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='threaded' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
+      <parameter type-id='type-id-4' name='threaded' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='46' column='1'/>
       <!-- parameter of type 'typedef backtrace_error_callback' -->
       <parameter type-id='type-id-24' name='error_callback' filepath='../../.././libsanitizer/libbacktrace/../../libbacktrace/state.c' line='47' column='1'/>
       <!-- parameter of type 'void*' -->
@@ -3719,7 +3728,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int len -->
-        <var-decl name='len' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='466' column='1'/>
+        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='466' column='1'/>
       </data-member>
     </class-decl>
     <!-- struct {const demangle_operator_info* op;} -->
@@ -3741,18 +3750,18 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- int demangle_operator_info::len -->
-        <var-decl name='len' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='44' column='1'/>
+        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='44' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
         <!-- int demangle_operator_info::args -->
-        <var-decl name='args' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='46' column='1'/>
+        <var-decl name='args' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='46' column='1'/>
       </data-member>
     </class-decl>
     <!-- struct {int args; demangle_component* name;} -->
     <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='477' column='1' id='type-id-49'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- int args -->
-        <var-decl name='args' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='480' column='1'/>
+        <var-decl name='args' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='480' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- demangle_component* name -->
@@ -3829,7 +3838,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int demangle_builtin_type_info::len -->
-        <var-decl name='len' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='82' column='1'/>
+        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='82' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- const char* demangle_builtin_type_info::java_name -->
@@ -3837,7 +3846,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <!-- int demangle_builtin_type_info::java_len -->
-        <var-decl name='java_len' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='86' column='1'/>
+        <var-decl name='java_len' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='86' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='224'>
         <!-- d_builtin_type_print demangle_builtin_type_info::print -->
@@ -3866,7 +3875,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int len -->
-        <var-decl name='len' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='527' column='1'/>
+        <var-decl name='len' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='527' column='1'/>
       </data-member>
     </class-decl>
     <!-- struct {long int number;} -->
@@ -3880,7 +3889,7 @@
     <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='538' column='1' id='type-id-56'>
       <data-member access='public' layout-offset-in-bits='0'>
         <!-- int character -->
-        <var-decl name='character' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='540' column='1'/>
+        <var-decl name='character' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='540' column='1'/>
       </data-member>
     </class-decl>
     <!-- struct {demangle_component* left; demangle_component* right;} -->
@@ -3902,7 +3911,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int num -->
-        <var-decl name='num' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='557' column='1'/>
+        <var-decl name='num' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/../include/demangle.h' line='557' column='1'/>
       </data-member>
     </class-decl>
     <!-- struct d_info -->
@@ -3917,7 +3926,7 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- int d_info::options -->
-        <var-decl name='options' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='100' column='1'/>
+        <var-decl name='options' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='100' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <!-- const char* d_info::n -->
@@ -3929,11 +3938,11 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
         <!-- int d_info::next_comp -->
-        <var-decl name='next_comp' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='106' column='1'/>
+        <var-decl name='next_comp' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='106' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='352'>
         <!-- int d_info::num_comps -->
-        <var-decl name='num_comps' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='108' column='1'/>
+        <var-decl name='num_comps' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='108' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
         <!-- demangle_component** d_info::subs -->
@@ -3941,15 +3950,15 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
         <!-- int d_info::next_sub -->
-        <var-decl name='next_sub' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='112' column='1'/>
+        <var-decl name='next_sub' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='112' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='480'>
         <!-- int d_info::num_subs -->
-        <var-decl name='num_subs' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='114' column='1'/>
+        <var-decl name='num_subs' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='114' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
         <!-- int d_info::did_subs -->
-        <var-decl name='did_subs' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='118' column='1'/>
+        <var-decl name='did_subs' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='118' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
         <!-- demangle_component* d_info::last_name -->
@@ -3957,15 +3966,15 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
         <!-- int d_info::expansion -->
-        <var-decl name='expansion' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='124' column='1'/>
+        <var-decl name='expansion' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='124' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='672'>
         <!-- int d_info::is_expression -->
-        <var-decl name='is_expression' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='126' column='1'/>
+        <var-decl name='is_expression' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='126' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
         <!-- int d_info::is_conversion -->
-        <var-decl name='is_conversion' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='129' column='1'/>
+        <var-decl name='is_conversion' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.h' line='129' column='1'/>
       </data-member>
     </class-decl>
     <!-- const demangle_builtin_type_info -->
@@ -3993,20 +4002,20 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2' name='s' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
+      <parameter type-id='type-id-4' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='783' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_cplus_demangle_fill_extended_operator(demangle_component*, int, demangle_component*) -->
     <function-decl name='__asan_cplus_demangle_fill_extended_operator' mangled-name='__asan_cplus_demangle_fill_extended_operator' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_extended_operator'>
       <!-- parameter of type 'demangle_component*' -->
       <parameter type-id='type-id-61' name='p' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='args' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
+      <parameter type-id='type-id-4' name='args' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='797' column='1'/>
       <!-- parameter of type 'demangle_component*' -->
       <parameter type-id='type-id-61' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='798' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_cplus_demangle_fill_ctor(demangle_component*, gnu_v3_ctor_kinds, demangle_component*) -->
     <function-decl name='__asan_cplus_demangle_fill_ctor' mangled-name='__asan_cplus_demangle_fill_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='812' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_ctor'>
@@ -4017,7 +4026,7 @@
       <!-- parameter of type 'demangle_component*' -->
       <parameter type-id='type-id-61' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='814' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_cplus_demangle_fill_dtor(demangle_component*, gnu_v3_dtor_kinds, demangle_component*) -->
     <function-decl name='__asan_cplus_demangle_fill_dtor' mangled-name='__asan_cplus_demangle_fill_dtor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='831' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_fill_dtor'>
@@ -4028,7 +4037,7 @@
       <!-- parameter of type 'demangle_component*' -->
       <parameter type-id='type-id-61' name='name' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='833' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- demangle_component* __asan_cplus_demangle_type(d_info*) -->
     <function-decl name='__asan_cplus_demangle_type' mangled-name='__asan_cplus_demangle_type' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='2230' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_type'>
@@ -4042,14 +4051,14 @@
       <!-- parameter of type 'd_info*' -->
       <parameter type-id='type-id-72' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='top_level' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
+      <parameter type-id='type-id-4' name='top_level' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='1140' column='1'/>
       <!-- demangle_component* -->
       <return type-id='type-id-61'/>
     </function-decl>
     <!-- int __asan_cplus_demangle_print_callback(int, const demangle_component*, demangle_callbackref, void*) -->
     <function-decl name='__asan_cplus_demangle_print_callback' mangled-name='__asan_cplus_demangle_print_callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print_callback'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1'/>
+      <parameter type-id='type-id-4' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4029' column='1'/>
       <!-- parameter of type 'const demangle_component*' -->
       <parameter type-id='type-id-71' name='dc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4030' column='1'/>
       <!-- parameter of type 'typedef demangle_callbackref' -->
@@ -4057,16 +4066,16 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4031' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- char* __asan_cplus_demangle_print(int, const demangle_component*, int, size_t*) -->
     <function-decl name='__asan_cplus_demangle_print' mangled-name='__asan_cplus_demangle_print' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_cplus_demangle_print'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
+      <parameter type-id='type-id-4' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
       <!-- parameter of type 'const demangle_component*' -->
       <parameter type-id='type-id-71' name='dc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4069' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='estimate' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
+      <parameter type-id='type-id-4' name='estimate' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
       <!-- parameter of type 'size_t*' -->
       <parameter type-id='type-id-74' name='palc' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='4070' column='1'/>
       <!-- char* -->
@@ -4077,9 +4086,9 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
+      <parameter type-id='type-id-4' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
+      <parameter type-id='type-id-11' name='len' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5731' column='1'/>
       <!-- parameter of type 'd_info*' -->
       <parameter type-id='type-id-72' name='di' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='5732' column='1'/>
       <!-- void -->
@@ -4090,7 +4099,7 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
+      <parameter type-id='type-id-4' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6018' column='1'/>
       <!-- char* -->
       <return type-id='type-id-25'/>
     </function-decl>
@@ -4099,13 +4108,13 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2' name='mangled' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
+      <parameter type-id='type-id-4' name='options' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6026' column='1'/>
       <!-- parameter of type 'typedef demangle_callbackref' -->
       <parameter type-id='type-id-73' name='callback' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6027' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- char* __asan_java_demangle_v3(const char*) -->
     <function-decl name='__asan_java_demangle_v3' mangled-name='__asan_java_demangle_v3' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6039' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_java_demangle_v3'>
@@ -4123,7 +4132,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1' name='opaque' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6048' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- gnu_v3_ctor_kinds __asan_is_gnu_v3_mangled_ctor(const char*) -->
     <function-decl name='__asan_is_gnu_v3_mangled_ctor' mangled-name='__asan_is_gnu_v3_mangled_ctor' filepath='../../.././libsanitizer/libbacktrace/../../libiberty/cp-demangle.c' line='6137' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='__asan_is_gnu_v3_mangled_ctor'>
@@ -4155,7 +4164,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- void* -->
       <return type-id='type-id-1'/>
     </function-decl>
@@ -4166,7 +4175,7 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- void* -->
       <return type-id='type-id-1'/>
     </function-decl>
@@ -4175,7 +4184,7 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- typedef size_t -->
-      <return type-id='type-id-12'/>
+      <return type-id='type-id-11'/>
     </function-decl>
     <!-- int sprintf(char*, const char*, ...) -->
     <function-decl name='sprintf' filepath='/usr/include/stdio.h' line='363' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -4185,7 +4194,7 @@
       <parameter type-id='type-id-2'/>
       <parameter is-variadic='yes'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_internal_strncmp(const char*, const char*, size_t) -->
     <function-decl name='__asan_internal_strncmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='44' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -4194,9 +4203,9 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int __asan_internal_memcmp(void*, void*, size_t) -->
     <function-decl name='__asan_internal_memcmp' filepath='../../.././libsanitizer/libbacktrace/backtrace-rename.h' line='42' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -4205,9 +4214,9 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/libbacktrace/bridge.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/libbacktrace' language='LANG_C_plus_plus'>
@@ -4451,9 +4460,9 @@
         <!-- parameter of type 'const char*' -->
         <parameter type-id='type-id-2'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- void -->
         <return type-id='type-id-26'/>
       </function-decl>
@@ -4801,7 +4810,7 @@
       <!-- parameter of type 'char*' -->
       <parameter type-id='type-id-25'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- bool -->
       <return type-id='type-id-116'/>
     </function-type>
@@ -4824,7 +4833,7 @@
         <!-- parameter of type 'typedef __sanitizer::fd_t' -->
         <parameter type-id='type-id-118'/>
         <!-- int -->
-        <return type-id='type-id-5'/>
+        <return type-id='type-id-4'/>
       </function-decl>
     </namespace-decl>
   </abi-instr>
@@ -4888,7 +4897,7 @@
             <!-- implicit parameter of type '__sanitizer::InternalMmapVector<long unsigned int>*' -->
             <parameter type-id='type-id-120' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -5061,7 +5070,7 @@
             <!-- implicit parameter of type '__sanitizer::InternalMmapVector<unsigned int>*' -->
             <parameter type-id='type-id-122' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -5221,7 +5230,7 @@
       <!-- bool __sanitizer::IsSpace(int) -->
       <function-decl name='IsSpace' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='299' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- bool -->
         <return type-id='type-id-116'/>
       </function-decl>
@@ -5234,7 +5243,7 @@
         <!-- parameter of type 'typedef __sanitizer::uptr' -->
         <parameter type-id='type-id-83' name='n' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='633' column='1'/>
         <!-- int -->
-        <return type-id='type-id-5'/>
+        <return type-id='type-id-4'/>
       </function-decl>
       <!-- __sanitizer::uptr __sanitizer::RoundDownTo(__sanitizer::uptr, __sanitizer::uptr) -->
       <function-decl name='RoundDownTo' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='265' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -5248,7 +5257,7 @@
       <!-- bool __sanitizer::IsDigit(int) -->
       <function-decl name='IsDigit' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common.h' line='303' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- bool -->
         <return type-id='type-id-116'/>
       </function-decl>
@@ -5266,7 +5275,7 @@
         <!-- parameter of type 'void*' -->
         <parameter type-id='type-id-1'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'typedef __sanitizer::uptr' -->
         <parameter type-id='type-id-83'/>
         <!-- void* -->
@@ -5297,7 +5306,7 @@
         <!-- parameter of type 'const char*' -->
         <parameter type-id='type-id-2'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- char* -->
         <return type-id='type-id-25'/>
       </function-decl>
@@ -5319,7 +5328,7 @@
         <!-- parameter of type 'char**' -->
         <parameter type-id='type-id-110'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- typedef __sanitizer::s64 -->
         <return type-id='type-id-137'/>
       </function-decl>
@@ -5350,11 +5359,11 @@
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <!-- int sigaltstack::ss_flags -->
-        <var-decl name='ss_flags' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/sigstack.h' line='53' column='1'/>
+        <var-decl name='ss_flags' type-id='type-id-4' visibility='default' filepath='/usr/include/bits/sigstack.h' line='53' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <!-- size_t sigaltstack::ss_size -->
-        <var-decl name='ss_size' type-id='type-id-12' visibility='default' filepath='/usr/include/bits/sigstack.h' line='54' column='1'/>
+        <var-decl name='ss_size' type-id='type-id-11' visibility='default' filepath='/usr/include/bits/sigstack.h' line='54' column='1'/>
       </data-member>
     </class-decl>
     <!-- struct link_map -->
@@ -5447,7 +5456,7 @@
         <!-- parameter of type 'const char*' -->
         <parameter type-id='type-id-2'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'typedef __sanitizer::u32' -->
         <parameter type-id='type-id-170'/>
         <!-- typedef __sanitizer::uptr -->
@@ -5489,7 +5498,7 @@
         <!-- parameter of type 'typedef __sanitizer::OFF_T' -->
         <parameter type-id='type-id-171'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- typedef __sanitizer::uptr -->
         <return type-id='type-id-83'/>
       </function-decl>
@@ -5509,7 +5518,7 @@
         <!-- parameter of type 'const char*' -->
         <parameter type-id='type-id-2'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- typedef __sanitizer::uptr -->
         <return type-id='type-id-83'/>
       </function-decl>
@@ -5550,11 +5559,11 @@
         <!-- parameter of type 'typedef __sanitizer::uptr' -->
         <parameter type-id='type-id-83'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'typedef __sanitizer::u64' -->
         <parameter type-id='type-id-173'/>
         <!-- typedef __sanitizer::uptr -->
@@ -5618,9 +5627,9 @@
       <!-- __sanitizer::uptr __sanitizer::internal_ptrace(int, int, void*, void*) -->
       <function-decl name='internal_ptrace' mangled-name='_ZN11__sanitizer15internal_ptraceEiiPvS0_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='573' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5' name='request' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1524' column='1'/>
+        <parameter type-id='type-id-4' name='request' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1524' column='1'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5' name='pid' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1524' column='1'/>
+        <parameter type-id='type-id-4' name='pid' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1524' column='1'/>
         <!-- parameter of type 'void*' -->
         <parameter type-id='type-id-1' name='addr' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_common_interceptors.inc' line='1524' column='1'/>
         <!-- parameter of type 'void*' -->
@@ -5631,11 +5640,11 @@
       <!-- __sanitizer::uptr __sanitizer::internal_waitpid(int, int*, int) -->
       <function-decl name='internal_waitpid' mangled-name='_ZN11__sanitizer16internal_waitpidEiPii' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='577' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'int*' -->
         <parameter type-id='type-id-30'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- typedef __sanitizer::uptr -->
         <return type-id='type-id-83'/>
       </function-decl>
@@ -5647,7 +5656,7 @@
       <!-- __sanitizer::uptr __sanitizer::internal_prctl(int, __sanitizer::uptr, __sanitizer::uptr, __sanitizer::uptr, __sanitizer::uptr) -->
       <function-decl name='internal_prctl' mangled-name='_ZN11__sanitizer14internal_prctlEimmmm' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='598' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'typedef __sanitizer::uptr' -->
         <parameter type-id='type-id-83'/>
         <!-- parameter of type 'typedef __sanitizer::uptr' -->
@@ -5703,7 +5712,7 @@
       <!-- __sanitizer::uptr __sanitizer::internal_sigaction(int, const __sanitizer::__sanitizer_kernel_sigaction_t*, __sanitizer::__sanitizer_kernel_sigaction_t*) -->
       <function-decl name='internal_sigaction' mangled-name='_ZN11__sanitizer18internal_sigactionEiPKNS_30__sanitizer_kernel_sigaction_tEPS0_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.cc' line='607' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'const __sanitizer::__sanitizer_kernel_sigaction_t*' -->
         <parameter type-id='type-id-162'/>
         <!-- parameter of type '__sanitizer::__sanitizer_kernel_sigaction_t*' -->
@@ -5716,7 +5725,7 @@
         <!-- parameter of type '__sanitizer::__sanitizer_kernel_sigset_t*' -->
         <parameter type-id='type-id-180'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- void -->
         <return type-id='type-id-26'/>
       </function-decl>
@@ -5759,7 +5768,7 @@
         <!-- parameter of type 'void*' -->
         <parameter type-id='type-id-1'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'void*' -->
         <parameter type-id='type-id-1'/>
         <!-- parameter of type 'int*' -->
@@ -5878,7 +5887,7 @@
             <!-- implicit parameter of type '__sanitizer::MemoryMappingLayout*' -->
             <parameter type-id='type-id-152' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -5917,7 +5926,7 @@
             <!-- implicit parameter of type '__sanitizer::MemoryMappingLayout*' -->
             <parameter type-id='type-id-152' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -5953,11 +5962,11 @@
       <class-decl name='ThreadLister' size-in-bits='384' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='46' column='1' id='type-id-153'>
         <data-member access='private' layout-offset-in-bits='0'>
           <!-- int __sanitizer::ThreadLister::pid_ -->
-          <var-decl name='pid_' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='59' column='1'/>
+          <var-decl name='pid_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='59' column='1'/>
         </data-member>
         <data-member access='private' layout-offset-in-bits='32'>
           <!-- int __sanitizer::ThreadLister::descriptor_ -->
-          <var-decl name='descriptor_' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='60' column='1'/>
+          <var-decl name='descriptor_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='60' column='1'/>
         </data-member>
         <data-member access='private' layout-offset-in-bits='64'>
           <!-- __sanitizer::InternalScopedBuffer<char> __sanitizer::ThreadLister::buffer_ -->
@@ -5973,7 +5982,7 @@
         </data-member>
         <data-member access='private' layout-offset-in-bits='320'>
           <!-- int __sanitizer::ThreadLister::bytes_read_ -->
-          <var-decl name='bytes_read_' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='64' column='1'/>
+          <var-decl name='bytes_read_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_linux.h' line='64' column='1'/>
         </data-member>
         <member-function access='public' constructor='yes'>
           <!-- __sanitizer::ThreadLister::ThreadLister(int) -->
@@ -5981,7 +5990,7 @@
             <!-- implicit parameter of type '__sanitizer::ThreadLister*' -->
             <parameter type-id='type-id-154' is-artificial='yes'/>
             <!-- parameter of type 'int' -->
-            <parameter type-id='type-id-5'/>
+            <parameter type-id='type-id-4'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -5992,7 +6001,7 @@
             <!-- implicit parameter of type '__sanitizer::ThreadLister*' -->
             <parameter type-id='type-id-154' is-artificial='yes'/>
             <!-- parameter of type 'int' -->
-            <parameter type-id='type-id-5'/>
+            <parameter type-id='type-id-4'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -6003,7 +6012,7 @@
             <!-- implicit parameter of type '__sanitizer::ThreadLister*' -->
             <parameter type-id='type-id-154' is-artificial='yes'/>
             <!-- int -->
-            <return type-id='type-id-5'/>
+            <return type-id='type-id-4'/>
           </function-decl>
         </member-function>
         <member-function access='public'>
@@ -6039,7 +6048,7 @@
             <!-- implicit parameter of type '__sanitizer::ThreadLister*' -->
             <parameter type-id='type-id-154' is-artificial='yes'/>
             <!-- parameter of type 'int' -->
-            <parameter type-id='type-id-5'/>
+            <parameter type-id='type-id-4'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -6050,7 +6059,7 @@
             <!-- implicit parameter of type '__sanitizer::ThreadLister*' -->
             <parameter type-id='type-id-154' is-artificial='yes'/>
             <!-- parameter of type 'int' -->
-            <parameter type-id='type-id-5'/>
+            <parameter type-id='type-id-4'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -6060,7 +6069,7 @@
     <!-- void (int, void*, void*) -->
     <function-type size-in-bits='64' id='type-id-166'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'void*' -->
@@ -6125,7 +6134,7 @@
     <!-- pthread_attr_t* -->
     <pointer-type-def type-id='type-id-190' size-in-bits='64' id='type-id-197'/>
     <!-- size_t* -->
-    <pointer-type-def type-id='type-id-12' size-in-bits='64' id='type-id-74'/>
+    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-74'/>
     <!-- namespace __sanitizer -->
     <namespace-decl name='__sanitizer'>
       <!-- __sanitizer::uptr __sanitizer::Unwind_GetIP(_Unwind_Context*) -->
@@ -6186,7 +6195,7 @@
         <!-- parameter of type 'char*' -->
         <parameter type-id='type-id-25'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- bool -->
         <return type-id='type-id-116'/>
       </function-decl>
@@ -6235,7 +6244,7 @@
       <!-- parameter of type 'size_t*' -->
       <parameter type-id='type-id-74'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void* dlsym(void*, const char*) -->
     <function-decl name='dlsym' filepath='/usr/include/dlfcn.h' line='65' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -6249,30 +6258,30 @@
     <!-- int prctl(int, ...) -->
     <function-decl name='prctl' filepath='/usr/include/sys/prctl.h' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <parameter is-variadic='yes'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- size_t confstr(int, char*, size_t) -->
     <function-decl name='confstr' filepath='/usr/include/unistd.h' line='620' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'char*' -->
       <parameter type-id='type-id-25'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- typedef size_t -->
-      <return type-id='type-id-12'/>
+      <return type-id='type-id-11'/>
     </function-decl>
     <!-- int pthread_attr_setstacksize(pthread_attr_t*, size_t) -->
     <function-decl name='pthread_attr_setstacksize' filepath='/usr/include/pthread.h' line='367' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'pthread_attr_t*' -->
       <parameter type-id='type-id-197'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- bool (const char*) -->
     <function-type size-in-bits='64' id='type-id-193'>
@@ -6377,15 +6386,15 @@
       <!-- __sanitizer::uptr __sanitizer::sa_siginfo -->
       <var-decl name='sa_siginfo' type-id='type-id-83' mangled-name='_ZN11__sanitizer10sa_siginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='180' column='1'/>
       <!-- int __sanitizer::e_tabsz -->
-      <var-decl name='e_tabsz' type-id='type-id-5' mangled-name='_ZN11__sanitizer7e_tabszE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='183' column='1'/>
+      <var-decl name='e_tabsz' type-id='type-id-4' mangled-name='_ZN11__sanitizer7e_tabszE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='183' column='1'/>
       <!-- int __sanitizer::af_inet -->
-      <var-decl name='af_inet' type-id='type-id-5' mangled-name='_ZN11__sanitizer7af_inetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='196' column='1'/>
+      <var-decl name='af_inet' type-id='type-id-4' mangled-name='_ZN11__sanitizer7af_inetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='196' column='1'/>
       <!-- int __sanitizer::af_inet6 -->
-      <var-decl name='af_inet6' type-id='type-id-5' mangled-name='_ZN11__sanitizer8af_inet6E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='197' column='1'/>
+      <var-decl name='af_inet6' type-id='type-id-4' mangled-name='_ZN11__sanitizer8af_inet6E' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='197' column='1'/>
       <!-- int __sanitizer::glob_nomatch -->
-      <var-decl name='glob_nomatch' type-id='type-id-5' mangled-name='_ZN11__sanitizer12glob_nomatchE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='209' column='1'/>
+      <var-decl name='glob_nomatch' type-id='type-id-4' mangled-name='_ZN11__sanitizer12glob_nomatchE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='209' column='1'/>
       <!-- int __sanitizer::glob_altdirfunc -->
-      <var-decl name='glob_altdirfunc' type-id='type-id-5' mangled-name='_ZN11__sanitizer15glob_altdirfuncE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='210' column='1'/>
+      <var-decl name='glob_altdirfunc' type-id='type-id-4' mangled-name='_ZN11__sanitizer15glob_altdirfuncE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='210' column='1'/>
       <!-- unsigned int __sanitizer::path_max -->
       <var-decl name='path_max' type-id='type-id-129' mangled-name='_ZN11__sanitizer8path_maxE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='243' column='1'/>
       <!-- unsigned int __sanitizer::struct_user_regs_struct_sz -->
@@ -6395,43 +6404,43 @@
       <!-- unsigned int __sanitizer::struct_user_fpxregs_struct_sz -->
       <var-decl name='struct_user_fpxregs_struct_sz' type-id='type-id-129' mangled-name='_ZN11__sanitizer29struct_user_fpxregs_struct_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='218' column='1'/>
       <!-- int __sanitizer::ptrace_peektext -->
-      <var-decl name='ptrace_peektext' type-id='type-id-5' mangled-name='_ZN11__sanitizer15ptrace_peektextE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='223' column='1'/>
+      <var-decl name='ptrace_peektext' type-id='type-id-4' mangled-name='_ZN11__sanitizer15ptrace_peektextE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='223' column='1'/>
       <!-- int __sanitizer::ptrace_peekdata -->
-      <var-decl name='ptrace_peekdata' type-id='type-id-5' mangled-name='_ZN11__sanitizer15ptrace_peekdataE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='224' column='1'/>
+      <var-decl name='ptrace_peekdata' type-id='type-id-4' mangled-name='_ZN11__sanitizer15ptrace_peekdataE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='224' column='1'/>
       <!-- int __sanitizer::ptrace_peekuser -->
-      <var-decl name='ptrace_peekuser' type-id='type-id-5' mangled-name='_ZN11__sanitizer15ptrace_peekuserE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='225' column='1'/>
+      <var-decl name='ptrace_peekuser' type-id='type-id-4' mangled-name='_ZN11__sanitizer15ptrace_peekuserE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='225' column='1'/>
       <!-- int __sanitizer::ptrace_getregs -->
-      <var-decl name='ptrace_getregs' type-id='type-id-5' mangled-name='_ZN11__sanitizer14ptrace_getregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='226' column='1'/>
+      <var-decl name='ptrace_getregs' type-id='type-id-4' mangled-name='_ZN11__sanitizer14ptrace_getregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='226' column='1'/>
       <!-- int __sanitizer::ptrace_setregs -->
-      <var-decl name='ptrace_setregs' type-id='type-id-5' mangled-name='_ZN11__sanitizer14ptrace_setregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='227' column='1'/>
+      <var-decl name='ptrace_setregs' type-id='type-id-4' mangled-name='_ZN11__sanitizer14ptrace_setregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='227' column='1'/>
       <!-- int __sanitizer::ptrace_getfpregs -->
-      <var-decl name='ptrace_getfpregs' type-id='type-id-5' mangled-name='_ZN11__sanitizer16ptrace_getfpregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='228' column='1'/>
+      <var-decl name='ptrace_getfpregs' type-id='type-id-4' mangled-name='_ZN11__sanitizer16ptrace_getfpregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='228' column='1'/>
       <!-- int __sanitizer::ptrace_setfpregs -->
-      <var-decl name='ptrace_setfpregs' type-id='type-id-5' mangled-name='_ZN11__sanitizer16ptrace_setfpregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='229' column='1'/>
+      <var-decl name='ptrace_setfpregs' type-id='type-id-4' mangled-name='_ZN11__sanitizer16ptrace_setfpregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='229' column='1'/>
       <!-- int __sanitizer::ptrace_getfpxregs -->
-      <var-decl name='ptrace_getfpxregs' type-id='type-id-5' mangled-name='_ZN11__sanitizer17ptrace_getfpxregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='230' column='1'/>
+      <var-decl name='ptrace_getfpxregs' type-id='type-id-4' mangled-name='_ZN11__sanitizer17ptrace_getfpxregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='230' column='1'/>
       <!-- int __sanitizer::ptrace_setfpxregs -->
-      <var-decl name='ptrace_setfpxregs' type-id='type-id-5' mangled-name='_ZN11__sanitizer17ptrace_setfpxregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='231' column='1'/>
+      <var-decl name='ptrace_setfpxregs' type-id='type-id-4' mangled-name='_ZN11__sanitizer17ptrace_setfpxregsE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='231' column='1'/>
       <!-- int __sanitizer::ptrace_getsiginfo -->
-      <var-decl name='ptrace_getsiginfo' type-id='type-id-5' mangled-name='_ZN11__sanitizer17ptrace_getsiginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='232' column='1'/>
+      <var-decl name='ptrace_getsiginfo' type-id='type-id-4' mangled-name='_ZN11__sanitizer17ptrace_getsiginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='232' column='1'/>
       <!-- int __sanitizer::ptrace_setsiginfo -->
-      <var-decl name='ptrace_setsiginfo' type-id='type-id-5' mangled-name='_ZN11__sanitizer17ptrace_setsiginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='233' column='1'/>
+      <var-decl name='ptrace_setsiginfo' type-id='type-id-4' mangled-name='_ZN11__sanitizer17ptrace_setsiginfoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='233' column='1'/>
       <!-- int __sanitizer::ptrace_getregset -->
-      <var-decl name='ptrace_getregset' type-id='type-id-5' mangled-name='_ZN11__sanitizer16ptrace_getregsetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='238' column='1'/>
+      <var-decl name='ptrace_getregset' type-id='type-id-4' mangled-name='_ZN11__sanitizer16ptrace_getregsetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='238' column='1'/>
       <!-- int __sanitizer::ptrace_setregset -->
-      <var-decl name='ptrace_setregset' type-id='type-id-5' mangled-name='_ZN11__sanitizer16ptrace_setregsetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='239' column='1'/>
+      <var-decl name='ptrace_setregset' type-id='type-id-4' mangled-name='_ZN11__sanitizer16ptrace_setregsetE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='239' column='1'/>
       <!-- unsigned int __sanitizer::struct_shminfo_sz -->
       <var-decl name='struct_shminfo_sz' type-id='type-id-129' mangled-name='_ZN11__sanitizer17struct_shminfo_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='188' column='1'/>
       <!-- unsigned int __sanitizer::struct_shm_info_sz -->
       <var-decl name='struct_shm_info_sz' type-id='type-id-129' mangled-name='_ZN11__sanitizer18struct_shm_info_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='189' column='1'/>
       <!-- int __sanitizer::shmctl_ipc_stat -->
-      <var-decl name='shmctl_ipc_stat' type-id='type-id-5' mangled-name='_ZN11__sanitizer15shmctl_ipc_statE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='190' column='1'/>
+      <var-decl name='shmctl_ipc_stat' type-id='type-id-4' mangled-name='_ZN11__sanitizer15shmctl_ipc_statE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='190' column='1'/>
       <!-- int __sanitizer::shmctl_ipc_info -->
-      <var-decl name='shmctl_ipc_info' type-id='type-id-5' mangled-name='_ZN11__sanitizer15shmctl_ipc_infoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='191' column='1'/>
+      <var-decl name='shmctl_ipc_info' type-id='type-id-4' mangled-name='_ZN11__sanitizer15shmctl_ipc_infoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='191' column='1'/>
       <!-- int __sanitizer::shmctl_shm_info -->
-      <var-decl name='shmctl_shm_info' type-id='type-id-5' mangled-name='_ZN11__sanitizer15shmctl_shm_infoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='192' column='1'/>
+      <var-decl name='shmctl_shm_info' type-id='type-id-4' mangled-name='_ZN11__sanitizer15shmctl_shm_infoE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='192' column='1'/>
       <!-- int __sanitizer::shmctl_shm_stat -->
-      <var-decl name='shmctl_shm_stat' type-id='type-id-5' mangled-name='_ZN11__sanitizer15shmctl_shm_statE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='193' column='1'/>
+      <var-decl name='shmctl_shm_stat' type-id='type-id-4' mangled-name='_ZN11__sanitizer15shmctl_shm_statE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='193' column='1'/>
       <!-- unsigned int __sanitizer::struct_arpreq_sz -->
       <var-decl name='struct_arpreq_sz' type-id='type-id-129' mangled-name='_ZN11__sanitizer16struct_arpreq_szE' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_platform_limits_posix.cc' line='246' column='1'/>
       <!-- unsigned int __sanitizer::struct_ifreq_sz -->
@@ -7474,7 +7483,7 @@
         <!-- parameter of type 'void ()*' -->
         <parameter type-id='type-id-108' name='f' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='342' column='1'/>
         <!-- int -->
-        <return type-id='type-id-5'/>
+        <return type-id='type-id-4'/>
       </function-decl>
     </namespace-decl>
     <!-- __uid_t getuid() -->
@@ -7492,11 +7501,11 @@
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int setrlimit(__rlimit_resource_t, const rlimit*) -->
     <function-decl name='setrlimit' filepath='/usr/include/sys/resource.h' line='70' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -7505,7 +7514,7 @@
       <!-- parameter of type 'const rlimit*' -->
       <parameter type-id='type-id-206'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- unsigned int sleep(unsigned int) -->
     <function-decl name='sleep' filepath='/usr/include/unistd.h' line='441' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -7519,7 +7528,7 @@
       <!-- parameter of type 'typedef __useconds_t' -->
       <parameter type-id='type-id-203'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- void abort() -->
     <function-decl name='abort' filepath='/usr/include/stdlib.h' line='514' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -7531,14 +7540,14 @@
       <!-- parameter of type 'void ()*' -->
       <parameter type-id='type-id-108' name='f' filepath='../../.././libsanitizer/tsan/tsan_interceptors.cc' line='342' column='1'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
     <!-- int isatty(int) -->
     <function-decl name='isatty' filepath='/usr/include/unistd.h' line='798' column='1' visibility='default' binding='global' size-in-bits='64'>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/sanitizer_common/sanitizer_printf.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/sanitizer_common' language='LANG_C_plus_plus'>
@@ -7551,13 +7560,13 @@
         <!-- parameter of type 'char*' -->
         <parameter type-id='type-id-25'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'const char*' -->
         <parameter type-id='type-id-2'/>
         <!-- parameter of type 'typedef __va_list_tag __va_list_tag*' -->
         <parameter type-id='type-id-210'/>
         <!-- int -->
-        <return type-id='type-id-5'/>
+        <return type-id='type-id-4'/>
       </function-decl>
       <!-- void __sanitizer::SetPrintfAndReportCallback(void (const char*)*) -->
       <function-decl name='SetPrintfAndReportCallback' mangled-name='_ZN11__sanitizer26SetPrintfAndReportCallbackEPFvPKcE' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_printf.cc' line='192' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -7771,7 +7780,7 @@
             <!-- implicit parameter of type '__sanitizer::InternalMmapVector<__sanitizer::StackDepotReverseMap::IdDescPair>*' -->
             <parameter type-id='type-id-214' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -7985,7 +7994,7 @@
       <!-- void __sanitizer::TracerThreadSignalHandler(int, void*, void*) -->
       <function-decl name='TracerThreadSignalHandler' mangled-name='_ZN11__sanitizer25TracerThreadSignalHandlerEiPvS0_' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='193' column='1' visibility='default' binding='global' size-in-bits='64'>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- parameter of type 'void*' -->
         <parameter type-id='type-id-1'/>
         <!-- parameter of type 'void*' -->
@@ -8043,7 +8052,7 @@
             <!-- implicit parameter of type '__sanitizer::ScopedStackSpaceWithGuard*' -->
             <parameter type-id='type-id-239' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -8077,7 +8086,7 @@
             <!-- implicit parameter of type '__sanitizer::ScopedSetTracerPID*' -->
             <parameter type-id='type-id-237' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -8156,7 +8165,7 @@
       <class-decl name='StopTheWorldScope' size-in-bits='32' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='307' column='1' id='type-id-240'>
         <data-member access='private' layout-offset-in-bits='0'>
           <!-- int __sanitizer::StopTheWorldScope::process_was_dumpable_ -->
-          <var-decl name='process_was_dumpable_' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='354' column='1'/>
+          <var-decl name='process_was_dumpable_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_stoptheworld_linux_libcdep.cc' line='354' column='1'/>
         </data-member>
         <member-function access='public' constructor='yes'>
           <!-- __sanitizer::StopTheWorldScope::StopTheWorldScope() -->
@@ -8173,7 +8182,7 @@
             <!-- implicit parameter of type '__sanitizer::StopTheWorldScope*' -->
             <parameter type-id='type-id-241' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -8227,18 +8236,18 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- int -->
-      <return type-id='type-id-5'/>
+      <return type-id='type-id-4'/>
     </function-type>
     <!-- void (const char*, size_t, void*) -->
     <function-type size-in-bits='64' id='type-id-259'>
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- parameter of type 'typedef size_t' -->
-      <parameter type-id='type-id-12'/>
+      <parameter type-id='type-id-11'/>
       <!-- parameter of type 'void*' -->
       <parameter type-id='type-id-1'/>
       <!-- void -->
@@ -8251,7 +8260,7 @@
       <!-- parameter of type 'const char*' -->
       <parameter type-id='type-id-2'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- void -->
       <return type-id='type-id-26'/>
     </function-type>
@@ -8313,9 +8322,9 @@
         <!-- parameter of type 'char*' -->
         <parameter type-id='type-id-25'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- int -->
-        <return type-id='type-id-5'/>
+        <return type-id='type-id-4'/>
       </function-decl>
       <!-- bool __sanitizer::__sanitizer_symbolize_data(const char*, __sanitizer::u64, char*, int) -->
       <function-decl name='__sanitizer_symbolize_data' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='312' column='1' visibility='default' binding='global' size-in-bits='64'>
@@ -8326,7 +8335,7 @@
         <!-- parameter of type 'char*' -->
         <parameter type-id='type-id-25'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- bool -->
         <return type-id='type-id-116'/>
       </function-decl>
@@ -8339,7 +8348,7 @@
         <!-- parameter of type 'char*' -->
         <parameter type-id='type-id-25'/>
         <!-- parameter of type 'int' -->
-        <parameter type-id='type-id-5'/>
+        <parameter type-id='type-id-4'/>
         <!-- bool -->
         <return type-id='type-id-116'/>
       </function-decl>
@@ -8504,11 +8513,11 @@
         </data-member>
         <data-member access='private' layout-offset-in-bits='64'>
           <!-- int __sanitizer::ExternalSymbolizer::input_fd_ -->
-          <var-decl name='input_fd_' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='295' column='1'/>
+          <var-decl name='input_fd_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='295' column='1'/>
         </data-member>
         <data-member access='private' layout-offset-in-bits='96'>
           <!-- int __sanitizer::ExternalSymbolizer::output_fd_ -->
-          <var-decl name='output_fd_' type-id='type-id-5' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='296' column='1'/>
+          <var-decl name='output_fd_' type-id='type-id-4' visibility='default' filepath='../../.././libsanitizer/sanitizer_common/sanitizer_symbolizer_posix_libcdep.cc' line='296' column='1'/>
         </data-member>
         <data-member access='private' static='yes'>
           <!-- static const __sanitizer::uptr __sanitizer::ExternalSymbolizer::kBufferSize -->
@@ -8764,7 +8773,7 @@
       <!-- parameter of type 'int*' -->
       <parameter type-id='type-id-30'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- typedef __pid_t -->
       <return type-id='type-id-234'/>
     </function-decl>
@@ -8793,7 +8802,7 @@
       <!-- parameter of type 'char*' -->
       <parameter type-id='type-id-25'/>
       <!-- parameter of type 'int' -->
-      <parameter type-id='type-id-5'/>
+      <parameter type-id='type-id-4'/>
       <!-- bool -->
       <return type-id='type-id-116'/>
     </function-type>
@@ -8802,7 +8811,7 @@
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../.././libsanitizer/tsan/tsan_clock.cc' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-ImG4Cf/gcc-4.9.2/x86_64-unknown-linux-gnu/libsanitizer/tsan' language='LANG_C_plus_plus'>
     <!-- int -->
-    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
+    <type-decl name='int' size-in-bits='32' id='type-id-4'/>
     <!-- long long unsigned int -->
     <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-136'/>
     <!-- long long unsigned int[16384] -->
@@ -8975,7 +8984,7 @@
             <!-- implicit parameter of type '__tsan::Vector<long long unsigned int>*' -->
             <parameter type-id='type-id-289' is-artificial='yes'/>
             <!-- artificial parameter of type 'int' -->
-            <parameter type-id='type-id-5' is-artificial='yes'/>
+            <parameter type-id='type-id-4' is-artificial='yes'/>
             <!-- void -->
             <return type-id='type-id-26'/>
           </function-decl>
@@ -9517,7 +9526,7 @@
           <!-- implicit parameter of type 'BlockingCall*' -->
