From 0000000000000000000000000000000000000000 Mon Sep 17 00:00:00 2001
From: Giuliano Procida <gprocida@google.com>
Date: Wed, 28 Oct 2020 12:35:56 +0000
Subject: Improve enum synthetic type names

The ordering of canonical types (in an abi-instr XML element) appears
to be sensitive to the particular C++ library used and the presence of
other threads doing heap allocation. This patch forces distinct
synthetic enum-underlying types to have distinct names, which ensures
deterministic XML output order.

	* src/abg-dwarf-reader.cc
	(build_internal_underlying_enum_type_name): Add a size
	argument (and don't default is_anonymous argument). Append
	size of type to synthetic type name.
	(build_enum_underlying_type): Pass type size to
	build_internal_underlying_enum_type_name.
	* tests/data/test-abidiff-exit/test-decl-enum-report-3.txt:
	Update. Note that there may be an issue with leaf-mode
	reporting of pointer type changes.
	* tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0.abi:
	Regenerate this (catching up with various abidw updates).
	* tests/data/test-annotate/test-anonymous-members-0.o.abi:
	Refresh with new type names.
	* tests/data/test-annotate/test0.abi: Likewise.
	* tests/data/test-annotate/test13-pr18894.so.abi: Likewise.
	* tests/data/test-annotate/test14-pr18893.so.abi: Likewise.
	* tests/data/test-annotate/test15-pr18892.so.abi: Likewise.
	* tests/data/test-annotate/test17-pr19027.so.abi: Likewise.

+    build_internal_underlying_enum_type_name(enum_name, is_anonymous,
+					     enum_size);
 
   type_decl_sptr result(new type_decl(ctxt.env(), underlying_type_name,
 				      enum_size, enum_size, location()));
diff --git a/tests/data/test-abidiff-exit/test-decl-enum-report-3.txt b/tests/data/test-abidiff-exit/test-decl-enum-report-3.txt
index b5b84c71f6fb..b3b11368a3d4 100644
--- a/tests/data/test-abidiff-exit/test-decl-enum-report-3.txt
+++ b/tests/data/test-abidiff-exit/test-decl-enum-report-3.txt
@@ -1,5 +1,5 @@
-Leaf changes summary: 0 artifact changed
+Leaf changes summary: 0 artifact changed (2 filtered out)
 Changed leaf types summary: 0 leaf type changed
-Removed/Changed/Added functions summary: 0 Removed, 0 Changed, 0 Added function
+Removed/Changed/Added functions summary: 0 Removed, 0 Changed (2 filtered out), 0 Added function
 Removed/Changed/Added variables summary: 0 Removed, 0 Changed, 0 Added variable
 
diff --git a/tests/data/test-annotate/test-anonymous-members-0.o.abi b/tests/data/test-annotate/test-anonymous-members-0.o.abi
index 5eca89ddb25f..51d01dfc52c9 100644
--- a/tests/data/test-annotate/test-anonymous-members-0.o.abi
+++ b/tests/data/test-annotate/test-anonymous-members-0.o.abi
@@ -10,8 +10,8 @@
     <type-decl name='double' size-in-bits='64' id='type-id-2'/>
     <!-- int -->
     <type-decl name='int' size-in-bits='32' id='type-id-3'/>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-4'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-4'/>
     <!-- unsigned int -->
     <type-decl name='unsigned int' size-in-bits='32' id='type-id-5'/>
     <!-- void -->
diff --git a/tests/data/test-annotate/test0.abi b/tests/data/test-annotate/test0.abi
index 5ac64e7051d6..06cb2044be0b 100644
--- a/tests/data/test-annotate/test0.abi
+++ b/tests/data/test-annotate/test0.abi
@@ -44,8 +44,8 @@
     <type-decl name='long int' size-in-bits='64' id='type-id-3'/>
     <!-- long long int -->
     <type-decl name='long long int' size-in-bits='64' id='type-id-4'/>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-5'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-5'/>
     <!-- void -->
     <type-decl name='void' id='type-id-6'/>
     <!-- char* -->
diff --git a/tests/data/test-annotate/test13-pr18894.so.abi b/tests/data/test-annotate/test13-pr18894.so.abi
index 7c8902374ede..ee057ef1568a 100644
--- a/tests/data/test-annotate/test13-pr18894.so.abi
+++ b/tests/data/test-annotate/test13-pr18894.so.abi
@@ -665,8 +665,8 @@
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='dbus-bus.c' comp-dir-path='/tmp/legendre/spack-stage/spack-stage-hI99PR/dbus-1.9.0/dbus' language='LANG_C89'>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-25'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-25'/>
     <!-- unsigned long int -->
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-26'/>
     <!-- typedef DBusConnection DBusConnection -->
diff --git a/tests/data/test-annotate/test14-pr18893.so.abi b/tests/data/test-annotate/test14-pr18893.so.abi
index c3a4a6730182..f1b606eb23dd 100644
--- a/tests/data/test-annotate/test14-pr18893.so.abi
+++ b/tests/data/test-annotate/test14-pr18893.so.abi
@@ -14490,8 +14490,8 @@
       <!-- <anonymous range>[8] -->
       <subrange length='8' type-id='type-id-3' id='type-id-327'/>
     </array-type-def>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-38'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-38'/>
     <!-- unsigned long int -->
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
     <!-- unsigned long int[16] -->
diff --git a/tests/data/test-annotate/test15-pr18892.so.abi b/tests/data/test-annotate/test15-pr18892.so.abi
index 7b61907ec50c..8760b7b616df 100644
--- a/tests/data/test-annotate/test15-pr18892.so.abi
+++ b/tests/data/test-annotate/test15-pr18892.so.abi
@@ -8821,8 +8821,8 @@
     </array-type-def>
     <!-- sizetype -->
     <type-decl name='sizetype' size-in-bits='64' id='type-id-38'/>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-46'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-46'/>
     <!-- unsigned int -->
     <type-decl name='unsigned int' size-in-bits='32' id='type-id-129'/>
     <!-- unsigned long int -->
diff --git a/tests/data/test-annotate/test17-pr19027.so.abi b/tests/data/test-annotate/test17-pr19027.so.abi
index 9caf6bc6c2d3..79ada2185739 100644
--- a/tests/data/test-annotate/test17-pr19027.so.abi
+++ b/tests/data/test-annotate/test17-pr19027.so.abi
@@ -537,8 +537,8 @@
     <type-decl name='int' size-in-bits='32' id='type-id-9'/>
     <!-- long int -->
     <type-decl name='long int' size-in-bits='64' id='type-id-10'/>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-11'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-11'/>
     <!-- unsigned int -->
     <type-decl name='unsigned int' size-in-bits='32' id='type-id-12'/>
     <!-- unsigned long int -->
diff --git a/tests/data/test-annotate/test18-pr19037-libvtkRenderingLIC-6.1.so.abi b/tests/data/test-annotate/test18-pr19037-libvtkRenderingLIC-6.1.so.abi
index e1ae24200030..89efef8f30a2 100644
--- a/tests/data/test-annotate/test18-pr19037-libvtkRenderingLIC-6.1.so.abi
+++ b/tests/data/test-annotate/test18-pr19037-libvtkRenderingLIC-6.1.so.abi
@@ -931,8 +931,8 @@
     <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-22'/>
     <!-- signed char -->
     <type-decl name='signed char' size-in-bits='8' id='type-id-23'/>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-24'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-24'/>
     <!-- unsigned int -->
     <type-decl name='unsigned int' size-in-bits='32' id='type-id-13'/>
     <!-- unsigned long int -->
diff --git a/tests/data/test-annotate/test19-pr19023-libtcmalloc_and_profiler.so.abi b/tests/data/test-annotate/test19-pr19023-libtcmalloc_and_profiler.so.abi
index 51ed1f7d8937..ffe064fb7f69 100644
--- a/tests/data/test-annotate/test19-pr19023-libtcmalloc_and_profiler.so.abi
+++ b/tests/data/test-annotate/test19-pr19023-libtcmalloc_and_profiler.so.abi
@@ -32022,8 +32022,8 @@
       <!-- <anonymous range>[88] -->
       <subrange length='88' type-id='type-id-5' id='type-id-1255'/>
     </array-type-def>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-133'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-133'/>
     <!-- unsigned char -->
     <type-decl name='unsigned char' size-in-bits='8' id='type-id-3'/>
     <!-- unsigned char[2169] -->
diff --git a/tests/data/test-annotate/test20-pr19025-libvtkParallelCore-6.1.so.abi b/tests/data/test-annotate/test20-pr19025-libvtkParallelCore-6.1.so.abi
index 82dfd635cf65..0bd8d7acd4ad 100644
--- a/tests/data/test-annotate/test20-pr19025-libvtkParallelCore-6.1.so.abi
+++ b/tests/data/test-annotate/test20-pr19025-libvtkParallelCore-6.1.so.abi
@@ -817,8 +817,8 @@
     <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-23'/>
     <!-- signed char -->
     <type-decl name='signed char' size-in-bits='8' id='type-id-24'/>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-25'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-25'/>
     <!-- unsigned char -->
     <type-decl name='unsigned char' size-in-bits='8' id='type-id-26'/>
     <!-- unsigned int -->
diff --git a/tests/data/test-annotate/test21-pr19092.so.abi b/tests/data/test-annotate/test21-pr19092.so.abi
index b979f913d31d..fa2cb68a442c 100644
--- a/tests/data/test-annotate/test21-pr19092.so.abi
+++ b/tests/data/test-annotate/test21-pr19092.so.abi
@@ -981,8 +981,8 @@
       <!-- <anonymous range>[1] -->
       <subrange length='1' type-id='type-id-6' id='type-id-9'/>
     </array-type-def>
-    <!-- unnamed&#45;enum&#45;underlying&#45;type -->
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
+    <!-- unnamed&#45;enum&#45;underlying&#45;type&#45;32 -->
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-26'/>
     <!-- unsigned char -->
     <type-decl name='unsigned char' size-in-bits='8' id='type-id-27'/>
     <!-- unsigned int -->
diff --git a/tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0.abi b/tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0.abi
index 45984d7317e9..480f96132204 100644
--- a/tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0.abi
+++ b/tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0.abi
@@ -1,4 +1,4 @@
-<abi-corpus path='tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0' soname='librte_bus_dpaa.so.20.0'>
+<abi-corpus path='tests/data/test-diff-dwarf-abixml/PR25409-librte_bus_dpaa.so.20.0' architecture='elf-amd-x86_64' soname='librte_bus_dpaa.so.20.0'>
   <elf-needed>
     <dependency name='libm.so.6'/>
     <dependency name='libdl.so.2'/>
@@ -137,7 +137,7 @@
     <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='48' id='type-id-15'>
       <subrange length='6' type-id='type-id-10' id='type-id-16'/>
     </array-type-def>
-    <type-decl name='unnamed-enum-underlying-type' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-17'/>
+    <type-decl name='unnamed-enum-underlying-type-32' is-anonymous='yes' size-in-bits='32' alignment-in-bits='32' id='type-id-17'/>
     <type-decl name='unsigned char' size-in-bits='8' id='type-id-18'/>
     <type-decl name='unsigned long int' size-in-bits='64' id='type-id-19'/>
     <type-decl name='void' id='type-id-20'/>
@@ -3057,85 +3057,78 @@
     </function-decl>
   </abi-instr>
   <abi-instr version='1.0' address-size='64' path='../../dpdk/drivers/bus/dpaa/dpaa_bus.c' comp-dir-path='/home/dmarchan/v19.11/build-clang-shared' language='LANG_C99'>
-    <array-type-def dimensions='2' type-id='type-id-348' size-in-bits='8192' id='type-id-349'>
-      <subrange length='64' type-id='type-id-10' id='type-id-350'/>
-      <subrange length='8' type-id='type-id-10' id='type-id-44'/>
-    </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-351' size-in-bits='8192' id='type-id-352'>
-      <subrange length='64' type-id='type-id-10' id='type-id-350'/>
-    </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-351' size-in-bits='8192' id='type-id-353'>
+    <array-type-def dimensions='1' type-id='type-id-348' size-in-bits='8192' id='type-id-349'>
       <subrange length='64' type-id='type-id-10' id='type-id-350'/>
     </array-type-def>
-    <array-type-def dimensions='2' type-id='type-id-348' size-in-bits='8192' id='type-id-354'>
+    <array-type-def dimensions='2' type-id='type-id-351' size-in-bits='8192' id='type-id-352'>
       <subrange length='64' type-id='type-id-10' id='type-id-350'/>
       <subrange length='8' type-id='type-id-10' id='type-id-44'/>
     </array-type-def>
-    <type-decl name='bool' size-in-bits='8' id='type-id-355'/>
-    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='8192' id='type-id-356'>
-      <subrange length='1024' type-id='type-id-10' id='type-id-357'/>
+    <type-decl name='bool' size-in-bits='8' id='type-id-353'/>
+    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='8192' id='type-id-354'>
+      <subrange length='1024' type-id='type-id-10' id='type-id-355'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='512' id='type-id-358'>
+    <array-type-def dimensions='1' type-id='type-id-45' size-in-bits='512' id='type-id-356'>
       <subrange length='64' type-id='type-id-10' id='type-id-350'/>
     </array-type-def>
-    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-359'/>
-    <class-decl name='rte_cryptodev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-360'/>
-    <class-decl name='rte_eth_dev_callback' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-361'/>
-    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='16384' id='type-id-362'>
-      <subrange length='512' type-id='type-id-10' id='type-id-363'/>
+    <class-decl name='rte_class' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-357'/>
+    <class-decl name='rte_cryptodev' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-358'/>
+    <class-decl name='rte_eth_dev_callback' is-struct='yes' visibility='default' is-declaration-only='yes' id='type-id-359'/>
+    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='16384' id='type-id-360'>
+      <subrange length='512' type-id='type-id-10' id='type-id-361'/>
     </array-type-def>
-    <type-decl name='long int' size-in-bits='64' id='type-id-364'/>
-    <array-type-def dimensions='1' type-id='type-id-365' size-in-bits='196608' id='type-id-366'>
-      <subrange length='512' type-id='type-id-10' id='type-id-363'/>
+    <type-decl name='long int' size-in-bits='64' id='type-id-362'/>
+    <array-type-def dimensions='1' type-id='type-id-363' size-in-bits='196608' id='type-id-364'>
+      <subrange length='512' type-id='type-id-10' id='type-id-361'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-367' size-in-bits='3456' id='type-id-368'>
-      <subrange length='24' type-id='type-id-10' id='type-id-369'/>
+    <array-type-def dimensions='1' type-id='type-id-365' size-in-bits='3456' id='type-id-366'>
+      <subrange length='24' type-id='type-id-10' id='type-id-367'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-370' size-in-bits='2304' id='type-id-371'>
+    <array-type-def dimensions='1' type-id='type-id-368' size-in-bits='2304' id='type-id-369'>
       <subrange length='8' type-id='type-id-10' id='type-id-44'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-372' size-in-bits='1024' id='type-id-373'>
+    <array-type-def dimensions='1' type-id='type-id-370' size-in-bits='1024' id='type-id-371'>
       <subrange length='32' type-id='type-id-10' id='type-id-53'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-374' size-in-bits='65536' id='type-id-375'>
-      <subrange length='1024' type-id='type-id-10' id='type-id-357'/>
+    <array-type-def dimensions='1' type-id='type-id-372' size-in-bits='65536' id='type-id-373'>
+      <subrange length='1024' type-id='type-id-10' id='type-id-355'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='256' id='type-id-376'>
+    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='256' id='type-id-374'>
       <subrange length='16' type-id='type-id-10' id='type-id-13'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='1024' id='type-id-377'>
+    <array-type-def dimensions='1' type-id='type-id-4' size-in-bits='1024' id='type-id-375'>
       <subrange length='64' type-id='type-id-10' id='type-id-350'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='128' id='type-id-378'>
+    <array-type-def dimensions='1' type-id='type-id-7' size-in-bits='128' id='type-id-376'>
       <subrange length='4' type-id='type-id-10' id='type-id-50'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='8192' id='type-id-379'>
-      <subrange length='128' type-id='type-id-10' id='type-id-380'/>
+    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='8192' id='type-id-377'>
+      <subrange length='128' type-id='type-id-10' id='type-id-378'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='256' id='type-id-381'>
+    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='256' id='type-id-379'>
       <subrange length='4' type-id='type-id-10' id='type-id-50'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='4096' id='type-id-382'>
+    <array-type-def dimensions='1' type-id='type-id-11' size-in-bits='4096' id='type-id-380'>
       <subrange length='64' type-id='type-id-10' id='type-id-350'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='8192' id='type-id-383'>
-      <subrange length='1024' type-id='type-id-10' id='type-id-357'/>
+    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='8192' id='type-id-381'>
+      <subrange length='1024' type-id='type-id-10' id='type-id-355'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='128' id='type-id-384'>
+    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='128' id='type-id-382'>
       <subrange length='16' type-id='type-id-10' id='type-id-13'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='64' id='type-id-385'>
+    <array-type-def dimensions='1' type-id='type-id-14' size-in-bits='64' id='type-id-383'>
       <subrange length='8' type-id='type-id-10' id='type-id-44'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='1024' id='type-id-386'>
+    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='1024' id='type-id-384'>
       <subrange length='16' type-id='type-id-10' id='type-id-13'/>
     </array-type-def>
-    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='256' id='type-id-387'>
+    <array-type-def dimensions='1' type-id='type-id-59' size-in-bits='256' id='type-id-385'>
       <subrange length='4' type-id='type-id-10' id='type-id-50'/>
     </array-type-def>
-    <class-decl name='dpaa_portal_dqrr' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='187' column='1' id='type-id-388'>
+    <class-decl name='dpaa_portal_dqrr' size-in-bits='1152' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='187' column='1' id='type-id-386'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='mbuf' type-id='type-id-386' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='188' column='1'/>
+        <var-decl name='mbuf' type-id='type-id-384' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='188' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
         <var-decl name='dqrr_held' type-id='type-id-11' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='189' column='1'/>
@@ -3144,62 +3137,62 @@
         <var-decl name='dqrr_size' type-id='type-id-14' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='190' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_dpaa_driver' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='87' column='1' id='type-id-389'>
+    <class-decl name='rte_dpaa_driver' size-in-bits='640' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='87' column='1' id='type-id-387'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-390' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1'/>
+        <var-decl name='next' type-id='type-id-388' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='driver' type-id='type-id-391' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='89' column='1'/>
+        <var-decl name='driver' type-id='type-id-389' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='89' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='dpaa_bus' type-id='type-id-392' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='90' column='1'/>
+        <var-decl name='dpaa_bus' type-id='type-id-390' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='90' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='drv_type' type-id='type-id-393' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='91' column='1'/>
+        <var-decl name='drv_type' type-id='type-id-391' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='probe' type-id='type-id-394' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='92' column='1'/>
+        <var-decl name='probe' type-id='type-id-392' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='92' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='remove' type-id='type-id-395' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='93' column='1'/>
+        <var-decl name='remove' type-id='type-id-393' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='93' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1' id='type-id-390'>
+    <class-decl name='__anonymous_struct__' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1' id='type-id-388'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqe_next' type-id='type-id-396' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1'/>
+        <var-decl name='tqe_next' type-id='type-id-394' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqe_prev' type-id='type-id-397' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1'/>
+        <var-decl name='tqe_prev' type-id='type-id-395' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='88' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-391'>
+    <class-decl name='rte_driver' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='89' column='1' id='type-id-389'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-398' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
+        <var-decl name='next' type-id='type-id-396' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='name' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
+        <var-decl name='name' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='91' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='alias' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
+        <var-decl name='alias' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='92' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-398'>
+    <class-decl name='__anonymous_struct__1' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1' id='type-id-396'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqe_next' type-id='type-id-400' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
+        <var-decl name='tqe_next' type-id='type-id-398' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqe_prev' type-id='type-id-401' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
+        <var-decl name='tqe_prev' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='90' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_dpaa_bus' size-in-bits='1344' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='55' column='1' id='type-id-402'>
+    <class-decl name='rte_dpaa_bus' size-in-bits='1344' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='55' column='1' id='type-id-400'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='bus' type-id='type-id-403' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='56' column='1'/>
+        <var-decl name='bus' type-id='type-id-401' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='56' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
-        <var-decl name='device_list' type-id='type-id-404' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='57' column='1'/>
+        <var-decl name='device_list' type-id='type-id-402' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1152'>
-        <var-decl name='driver_list' type-id='type-id-405' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='58' column='1'/>
+        <var-decl name='driver_list' type-id='type-id-403' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='58' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1280'>
         <var-decl name='device_count' type-id='type-id-1' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='59' column='1'/>
@@ -3208,304 +3201,304 @@
         <var-decl name='detected' type-id='type-id-1' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='60' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-403'>
+    <class-decl name='rte_bus' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='246' column='1' id='type-id-401'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-406' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
+        <var-decl name='next' type-id='type-id-404' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='name' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
+        <var-decl name='name' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='248' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='scan' type-id='type-id-407' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
+        <var-decl name='scan' type-id='type-id-405' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='249' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='probe' type-id='type-id-408' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
+        <var-decl name='probe' type-id='type-id-406' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='250' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='find_device' type-id='type-id-409' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
+        <var-decl name='find_device' type-id='type-id-407' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='251' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='plug' type-id='type-id-410' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
+        <var-decl name='plug' type-id='type-id-408' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='252' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='unplug' type-id='type-id-411' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
+        <var-decl name='unplug' type-id='type-id-409' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='253' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='parse' type-id='type-id-412' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
+        <var-decl name='parse' type-id='type-id-410' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='254' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='dma_map' type-id='type-id-413' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
+        <var-decl name='dma_map' type-id='type-id-411' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='255' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='dma_unmap' type-id='type-id-414' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
+        <var-decl name='dma_unmap' type-id='type-id-412' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='256' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='conf' type-id='type-id-415' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
+        <var-decl name='conf' type-id='type-id-413' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='257' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
-        <var-decl name='get_iommu_class' type-id='type-id-416' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
+        <var-decl name='get_iommu_class' type-id='type-id-414' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='258' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='dev_iterate' type-id='type-id-417' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
+        <var-decl name='dev_iterate' type-id='type-id-415' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='259' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='hot_unplug_handler' type-id='type-id-418' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
+        <var-decl name='hot_unplug_handler' type-id='type-id-416' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='260' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
-        <var-decl name='sigbus_handler' type-id='type-id-419' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
+        <var-decl name='sigbus_handler' type-id='type-id-417' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='262' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-406'>
+    <class-decl name='__anonymous_struct__2' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1' id='type-id-404'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqe_next' type-id='type-id-420' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
+        <var-decl name='tqe_next' type-id='type-id-418' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqe_prev' type-id='type-id-421' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
+        <var-decl name='tqe_prev' type-id='type-id-419' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='247' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='rte_bus_scan_t' type-id='type-id-422' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-407'/>
-    <typedef-decl name='rte_bus_probe_t' type-id='type-id-422' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-408'/>
-    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-423' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-409'/>
-    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-424'>
+    <typedef-decl name='rte_bus_scan_t' type-id='type-id-420' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='56' column='1' id='type-id-405'/>
+    <typedef-decl name='rte_bus_probe_t' type-id='type-id-420' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='68' column='1' id='type-id-406'/>
+    <typedef-decl name='rte_bus_find_device_t' type-id='type-id-421' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='93' column='1' id='type-id-407'/>
+    <class-decl name='rte_device' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='104' column='1' id='type-id-422'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-425' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
+        <var-decl name='next' type-id='type-id-423' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='name' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
+        <var-decl name='name' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='106' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='driver' type-id='type-id-426' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
+        <var-decl name='driver' type-id='type-id-424' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='107' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='bus' type-id='type-id-427' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
+        <var-decl name='bus' type-id='type-id-425' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='108' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
         <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='109' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='devargs' type-id='type-id-428' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
+        <var-decl name='devargs' type-id='type-id-426' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='110' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-425'>
+    <class-decl name='__anonymous_struct__3' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1' id='type-id-423'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqe_next' type-id='type-id-429' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
+        <var-decl name='tqe_next' type-id='type-id-427' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqe_prev' type-id='type-id-430' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
+        <var-decl name='tqe_prev' type-id='type-id-428' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='105' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-431'>
+    <class-decl name='rte_devargs' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='47' column='1' id='type-id-429'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-432' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
+        <var-decl name='next' type-id='type-id-430' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='type' type-id='type-id-433' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
+        <var-decl name='type' type-id='type-id-431' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='51' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
-        <var-decl name='policy' type-id='type-id-434' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
+        <var-decl name='policy' type-id='type-id-432' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='53' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='name' type-id='type-id-358' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
+        <var-decl name='name' type-id='type-id-356' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='55' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='' type-id='type-id-435' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='57' column='1'/>
+        <var-decl name='' type-id='type-id-433' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='57' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
-        <var-decl name='bus' type-id='type-id-420' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
+        <var-decl name='bus' type-id='type-id-418' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='cls' type-id='type-id-436' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
+        <var-decl name='cls' type-id='type-id-434' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='63' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='bus_str' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
+        <var-decl name='bus_str' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
-        <var-decl name='cls_str' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
+        <var-decl name='cls_str' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='65' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
-        <var-decl name='data' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
+        <var-decl name='data' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='66' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-432'>
+    <class-decl name='__anonymous_struct__4' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1' id='type-id-430'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqe_next' type-id='type-id-428' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
+        <var-decl name='tqe_next' type-id='type-id-426' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqe_prev' type-id='type-id-437' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
+        <var-decl name='tqe_prev' type-id='type-id-435' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='49' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_devtype' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-433'>
+    <enum-decl name='rte_devtype' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='31' column='1' id='type-id-431'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_DEVTYPE_WHITELISTED_PCI' value='0'/>
       <enumerator name='RTE_DEVTYPE_BLACKLISTED_PCI' value='1'/>
       <enumerator name='RTE_DEVTYPE_VIRTUAL' value='2'/>
     </enum-decl>
-    <enum-decl name='rte_dev_policy' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-434'>
+    <enum-decl name='rte_dev_policy' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='72' column='1' id='type-id-432'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_DEV_WHITELISTED' value='0'/>
       <enumerator name='RTE_DEV_BLACKLISTED' value='1'/>
     </enum-decl>
-    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-435'>
+    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='57' column='1' id='type-id-433'>
       <data-member access='private'>
-        <var-decl name='args' type-id='type-id-438' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
+        <var-decl name='args' type-id='type-id-436' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='59' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='drv_str' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
+        <var-decl name='drv_str' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_devargs.h' line='60' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-439' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-440'/>
-    <typedef-decl name='rte_bus_plug_t' type-id='type-id-441' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-410'/>
-    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-441' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-411'/>
-    <typedef-decl name='rte_bus_parse_t' type-id='type-id-442' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-412'/>
-    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-443' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-413'/>
-    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-443' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-414'/>
-    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-415'>
+    <typedef-decl name='rte_dev_cmp_t' type-id='type-id-437' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='202' column='1' id='type-id-438'/>
+    <typedef-decl name='rte_bus_plug_t' type-id='type-id-439' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='107' column='1' id='type-id-408'/>
+    <typedef-decl name='rte_bus_unplug_t' type-id='type-id-439' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='120' column='1' id='type-id-409'/>
+    <typedef-decl name='rte_bus_parse_t' type-id='type-id-440' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='140' column='1' id='type-id-410'/>
+    <typedef-decl name='rte_dev_dma_map_t' type-id='type-id-441' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='160' column='1' id='type-id-411'/>
+    <typedef-decl name='rte_dev_dma_unmap_t' type-id='type-id-441' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='181' column='1' id='type-id-412'/>
+    <class-decl name='rte_bus_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='225' column='1' id='type-id-413'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='scan_mode' type-id='type-id-444' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
+        <var-decl name='scan_mode' type-id='type-id-442' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='226' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_bus_scan_mode' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-444'>
+    <enum-decl name='rte_bus_scan_mode' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='216' column='1' id='type-id-442'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_BUS_SCAN_UNDEFINED' value='0'/>
       <enumerator name='RTE_BUS_SCAN_WHITELIST' value='1'/>
       <enumerator name='RTE_BUS_SCAN_BLACKLIST' value='2'/>
     </enum-decl>
-    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-445' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-416'/>
-    <enum-decl name='rte_iova_mode' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-446'>
+    <typedef-decl name='rte_bus_get_iommu_class_t' type-id='type-id-443' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='240' column='1' id='type-id-414'/>
+    <enum-decl name='rte_iova_mode' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='39' column='1' id='type-id-444'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_IOVA_DC' value='0'/>
       <enumerator name='RTE_IOVA_PA' value='1'/>
       <enumerator name='RTE_IOVA_VA' value='2'/>
     </enum-decl>
-    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-447' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-417'/>
-    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-448'>
+    <typedef-decl name='rte_dev_iterate_t' type-id='type-id-445' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='288' column='1' id='type-id-415'/>
+    <class-decl name='rte_dev_iterator' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='250' column='1' id='type-id-446'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='dev_str' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
+        <var-decl name='dev_str' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='251' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='bus_str' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
+        <var-decl name='bus_str' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='252' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='cls_str' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
+        <var-decl name='cls_str' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='253' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='bus' type-id='type-id-420' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
+        <var-decl name='bus' type-id='type-id-418' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='254' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='cls' type-id='type-id-436' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
+        <var-decl name='cls' type-id='type-id-434' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='255' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='device' type-id='type-id-429' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
+        <var-decl name='device' type-id='type-id-427' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='256' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
         <var-decl name='class_device' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='257' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-441' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-418'/>
-    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-449' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-419'/>
-    <class-decl name='rte_dpaa_device_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='44' column='1' id='type-id-404'>
+    <typedef-decl name='rte_bus_hot_unplug_handler_t' type-id='type-id-439' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='196' column='1' id='type-id-416'/>
+    <typedef-decl name='rte_bus_sigbus_handler_t' type-id='type-id-447' filepath='../../dpdk/lib/librte_eal/common/include/rte_bus.h' line='211' column='1' id='type-id-417'/>
+    <class-decl name='rte_dpaa_device_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='44' column='1' id='type-id-402'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqh_first' type-id='type-id-450' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='44' column='1'/>
+        <var-decl name='tqh_first' type-id='type-id-448' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='44' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqh_last' type-id='type-id-451' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='44' column='1'/>
+        <var-decl name='tqh_last' type-id='type-id-449' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='44' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_dpaa_device' size-in-bits='214592' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='69' column='1' id='type-id-452'>
+    <class-decl name='rte_dpaa_device' size-in-bits='214592' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='69' column='1' id='type-id-450'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-453' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1'/>
+        <var-decl name='next' type-id='type-id-451' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='device' type-id='type-id-424' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='71' column='1'/>
+        <var-decl name='device' type-id='type-id-422' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='' type-id='type-id-454' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='72' column='1'/>
+        <var-decl name='' type-id='type-id-452' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='72' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='driver' type-id='type-id-396' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='76' column='1'/>
+        <var-decl name='driver' type-id='type-id-394' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='id' type-id='type-id-455' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='77' column='1'/>
+        <var-decl name='id' type-id='type-id-453' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='77' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
-        <var-decl name='intr_handle' type-id='type-id-456' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='78' column='1'/>
+        <var-decl name='intr_handle' type-id='type-id-454' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='78' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='214016'>
-        <var-decl name='device_type' type-id='type-id-393' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='79' column='1'/>
+        <var-decl name='device_type' type-id='type-id-391' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='214048'>
-        <var-decl name='name' type-id='type-id-358' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='80' column='1'/>
+        <var-decl name='name' type-id='type-id-356' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='80' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1' id='type-id-453'>
+    <class-decl name='__anonymous_struct__5' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1' id='type-id-451'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqe_next' type-id='type-id-450' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1'/>
+        <var-decl name='tqe_next' type-id='type-id-448' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqe_prev' type-id='type-id-451' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1'/>
+        <var-decl name='tqe_prev' type-id='type-id-449' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='70' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='72' column='1' id='type-id-454'>
+    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='72' column='1' id='type-id-452'>
       <data-member access='private'>
-        <var-decl name='eth_dev' type-id='type-id-457' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='73' column='1'/>
+        <var-decl name='eth_dev' type-id='type-id-455' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='73' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='crypto_dev' type-id='type-id-458' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='74' column='1'/>
+        <var-decl name='crypto_dev' type-id='type-id-456' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='74' column='1'/>
       </data-member>
     </union-decl>
-    <class-decl name='rte_eth_dev' size-in-bits='132608' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='777' column='1' id='type-id-459'>
+    <class-decl name='rte_eth_dev' size-in-bits='132608' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='777' column='1' id='type-id-457'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='rx_pkt_burst' type-id='type-id-460' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='778' column='1'/>
+        <var-decl name='rx_pkt_burst' type-id='type-id-458' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='778' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tx_pkt_burst' type-id='type-id-461' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='779' column='1'/>
+        <var-decl name='tx_pkt_burst' type-id='type-id-459' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='779' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='tx_pkt_prepare' type-id='type-id-462' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='780' column='1'/>
+        <var-decl name='tx_pkt_prepare' type-id='type-id-460' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='780' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='data' type-id='type-id-463' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='786' column='1'/>
+        <var-decl name='data' type-id='type-id-461' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='786' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <var-decl name='process_private' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='787' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='dev_ops' type-id='type-id-464' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='788' column='1'/>
+        <var-decl name='dev_ops' type-id='type-id-462' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='788' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='device' type-id='type-id-429' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='789' column='1'/>
+        <var-decl name='device' type-id='type-id-427' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='789' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='intr_handle' type-id='type-id-465' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='790' column='1'/>
+        <var-decl name='intr_handle' type-id='type-id-463' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='790' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='link_intr_cbs' type-id='type-id-466' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='792' column='1'/>
+        <var-decl name='link_intr_cbs' type-id='type-id-464' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='792' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='post_rx_burst_cbs' type-id='type-id-375' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='797' column='1'/>
+        <var-decl name='post_rx_burst_cbs' type-id='type-id-373' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='797' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='66176'>
-        <var-decl name='pre_tx_burst_cbs' type-id='type-id-375' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='802' column='1'/>
+        <var-decl name='pre_tx_burst_cbs' type-id='type-id-373' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='802' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='131712'>
-        <var-decl name='state' type-id='type-id-467' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='803' column='1'/>
+        <var-decl name='state' type-id='type-id-465' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='803' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='131776'>
         <var-decl name='security_ctx' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='804' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='131840'>
-        <var-decl name='reserved_64s' type-id='type-id-381' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='806' column='1'/>
+        <var-decl name='reserved_64s' type-id='type-id-379' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='806' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='132096'>
-        <var-decl name='reserved_ptrs' type-id='type-id-387' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='807' column='1'/>
+        <var-decl name='reserved_ptrs' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='807' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_rx_burst_t' type-id='type-id-468' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='340' column='1' id='type-id-460'/>
-    <typedef-decl name='eth_tx_burst_t' type-id='type-id-468' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='345' column='1' id='type-id-461'/>
-    <typedef-decl name='eth_tx_prep_t' type-id='type-id-468' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='350' column='1' id='type-id-462'/>
-    <class-decl name='rte_eth_dev_data' size-in-bits='55808' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='820' column='1' id='type-id-469'>
+    <typedef-decl name='eth_rx_burst_t' type-id='type-id-466' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='340' column='1' id='type-id-458'/>
+    <typedef-decl name='eth_tx_burst_t' type-id='type-id-466' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='345' column='1' id='type-id-459'/>
+    <typedef-decl name='eth_tx_prep_t' type-id='type-id-466' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='350' column='1' id='type-id-460'/>
+    <class-decl name='rte_eth_dev_data' size-in-bits='55808' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='820' column='1' id='type-id-467'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='name' type-id='type-id-358' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='821' column='1'/>
+        <var-decl name='name' type-id='type-id-356' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='821' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
         <var-decl name='rx_queues' type-id='type-id-240' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='823' column='1'/>
@@ -3520,16 +3513,16 @@
         <var-decl name='nb_tx_queues' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='826' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='672'>
-        <var-decl name='sriov' type-id='type-id-470' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='828' column='1'/>
+        <var-decl name='sriov' type-id='type-id-468' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='828' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
         <var-decl name='dev_private' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='830' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='dev_link' type-id='type-id-471' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='835' column='1'/>
+        <var-decl name='dev_link' type-id='type-id-469' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='835' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='dev_conf' type-id='type-id-472' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='836' column='1'/>
+        <var-decl name='dev_conf' type-id='type-id-470' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='836' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='25536'>
         <var-decl name='mtu' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='837' column='1'/>
@@ -3541,13 +3534,13 @@
         <var-decl name='rx_mbuf_alloc_failed' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='841' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='25664'>
-        <var-decl name='mac_addrs' type-id='type-id-473' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='842' column='1'/>
+        <var-decl name='mac_addrs' type-id='type-id-471' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='842' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='25728'>
-        <var-decl name='mac_pool_sel' type-id='type-id-379' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='846' column='1'/>
+        <var-decl name='mac_pool_sel' type-id='type-id-377' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='846' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='33920'>
-        <var-decl name='hash_mac_addrs' type-id='type-id-473' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='848' column='1'/>
+        <var-decl name='hash_mac_addrs' type-id='type-id-471' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='848' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='33984'>
         <var-decl name='port_id' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='852' column='1'/>
@@ -3568,37 +3561,37 @@
         <var-decl name='lro' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='859' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='34008'>
-        <var-decl name='rx_queue_state' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='860' column='1'/>
+        <var-decl name='rx_queue_state' type-id='type-id-381' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='860' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='42200'>
-        <var-decl name='tx_queue_state' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='862' column='1'/>
+        <var-decl name='tx_queue_state' type-id='type-id-381' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='862' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='50400'>
         <var-decl name='dev_flags' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='864' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='50432'>
-        <var-decl name='kdrv' type-id='type-id-474' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='865' column='1'/>
+        <var-decl name='kdrv' type-id='type-id-472' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='865' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='50464'>
         <var-decl name='numa_node' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='866' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='50496'>
-        <var-decl name='vlan_filter_conf' type-id='type-id-475' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='867' column='1'/>
+        <var-decl name='vlan_filter_conf' type-id='type-id-473' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='867' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='54592'>
-        <var-decl name='owner' type-id='type-id-476' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='869' column='1'/>
+        <var-decl name='owner' type-id='type-id-474' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='869' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='55168'>
         <var-decl name='representor_id' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='870' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='55232'>
-        <var-decl name='reserved_64s' type-id='type-id-381' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='875' column='1'/>
+        <var-decl name='reserved_64s' type-id='type-id-379' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='875' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='55488'>
-        <var-decl name='reserved_ptrs' type-id='type-id-387' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='876' column='1'/>
+        <var-decl name='reserved_ptrs' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='876' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_dev_sriov' size-in-bits='48' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1476' column='1' id='type-id-470'>
+    <class-decl name='rte_eth_dev_sriov' size-in-bits='48' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1476' column='1' id='type-id-468'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='active' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1477' column='1'/>
       </data-member>
@@ -3612,7 +3605,7 @@
         <var-decl name='def_pool_q_idx' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1480' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_link' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='308' column='1' id='type-id-471'>
+    <class-decl name='rte_eth_link' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='308' column='1' id='type-id-469'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='link_speed' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='309' column='1'/>
       </data-member>
@@ -3626,38 +3619,38 @@
         <var-decl name='link_status' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='312' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_conf' size-in-bits='24640' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1045' column='1' id='type-id-472'>
+    <class-decl name='rte_eth_conf' size-in-bits='24640' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1045' column='1' id='type-id-470'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='link_speeds' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1046' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='rxmode' type-id='type-id-477' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1053' column='1'/>
+        <var-decl name='rxmode' type-id='type-id-475' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1053' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='txmode' type-id='type-id-478' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1054' column='1'/>
+        <var-decl name='txmode' type-id='type-id-476' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1054' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
         <var-decl name='lpbk_mode' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1055' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
-        <var-decl name='rx_adv_conf' type-id='type-id-479' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1068' column='1'/>
+        <var-decl name='rx_adv_conf' type-id='type-id-477' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1068' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='17984'>
-        <var-decl name='tx_adv_conf' type-id='type-id-480' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1076' column='1'/>
+        <var-decl name='tx_adv_conf' type-id='type-id-478' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1076' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='18080'>
         <var-decl name='dcb_capability_en' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1079' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='18112'>
-        <var-decl name='fdir_conf' type-id='type-id-481' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1080' column='1'/>
+        <var-decl name='fdir_conf' type-id='type-id-479' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1080' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='24576'>
-        <var-decl name='intr_conf' type-id='type-id-482' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1081' column='1'/>
+        <var-decl name='intr_conf' type-id='type-id-480' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1081' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_rxmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='394' column='1' id='type-id-477'>
+    <class-decl name='rte_eth_rxmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='394' column='1' id='type-id-475'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='mq_mode' type-id='type-id-483' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='396' column='1'/>
+        <var-decl name='mq_mode' type-id='type-id-481' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='396' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='max_rx_pkt_len' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='397' column='1'/>
@@ -3678,7 +3671,7 @@
         <var-decl name='reserved_ptrs' type-id='type-id-60' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='409' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_rx_mq_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='344' column='1' id='type-id-483'>
+    <enum-decl name='rte_eth_rx_mq_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='344' column='1' id='type-id-481'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='ETH_MQ_RX_NONE' value='0'/>
       <enumerator name='ETH_MQ_RX_RSS' value='1'/>
@@ -3689,9 +3682,9 @@
       <enumerator name='ETH_MQ_RX_VMDQ_DCB' value='6'/>
       <enumerator name='ETH_MQ_RX_VMDQ_DCB_RSS' value='7'/>
     </enum-decl>
-    <class-decl name='rte_eth_txmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='792' column='1' id='type-id-478'>
+    <class-decl name='rte_eth_txmode' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='792' column='1' id='type-id-476'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='mq_mode' type-id='type-id-484' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='793' column='1'/>
+        <var-decl name='mq_mode' type-id='type-id-482' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='793' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='offloads' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='799' column='1'/>
@@ -3715,28 +3708,28 @@
         <var-decl name='reserved_ptrs' type-id='type-id-60' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='812' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_tx_mq_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='377' column='1' id='type-id-484'>
+    <enum-decl name='rte_eth_tx_mq_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='377' column='1' id='type-id-482'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='ETH_MQ_TX_NONE' value='0'/>
       <enumerator name='ETH_MQ_TX_DCB' value='1'/>
       <enumerator name='ETH_MQ_TX_VMDQ_DCB' value='2'/>
       <enumerator name='ETH_MQ_TX_VMDQ_ONLY' value='3'/>
     </enum-decl>
-    <class-decl name='__anonymous_struct__6' size-in-bits='16960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1060' column='1' id='type-id-479'>
+    <class-decl name='__anonymous_struct__6' size-in-bits='16960' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1060' column='1' id='type-id-477'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='rss_conf' type-id='type-id-485' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1061' column='1'/>
+        <var-decl name='rss_conf' type-id='type-id-483' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1061' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='vmdq_dcb_conf' type-id='type-id-486' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1062' column='1'/>
+        <var-decl name='vmdq_dcb_conf' type-id='type-id-484' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1062' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8512'>
-        <var-decl name='dcb_rx_conf' type-id='type-id-487' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1064' column='1'/>
+        <var-decl name='dcb_rx_conf' type-id='type-id-485' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1064' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8640'>
-        <var-decl name='vmdq_rx_conf' type-id='type-id-488' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1066' column='1'/>
+        <var-decl name='vmdq_rx_conf' type-id='type-id-486' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1066' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_rss_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='448' column='1' id='type-id-485'>
+    <class-decl name='rte_eth_rss_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='448' column='1' id='type-id-483'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='rss_key' type-id='type-id-36' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='449' column='1'/>
       </data-member>
@@ -3747,9 +3740,9 @@
         <var-decl name='rss_hf' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='451' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_vmdq_dcb_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='745' column='1' id='type-id-486'>
+    <class-decl name='rte_eth_vmdq_dcb_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='745' column='1' id='type-id-484'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='nb_queue_pools' type-id='type-id-489' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='746' column='1'/>
+        <var-decl name='nb_queue_pools' type-id='type-id-487' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='746' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='enable_default_pool' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='747' column='1'/>
@@ -3761,20 +3754,20 @@
         <var-decl name='nb_pool_maps' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='749' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='pool_map' type-id='type-id-352' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='753' column='1'/>
+        <var-decl name='pool_map' type-id='type-id-349' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='753' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8256'>
-        <var-decl name='dcb_tc' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='754' column='1'/>
+        <var-decl name='dcb_tc' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='754' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_nb_pools' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='704' column='1' id='type-id-489'>
+    <enum-decl name='rte_eth_nb_pools' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='704' column='1' id='type-id-487'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='ETH_8_POOLS' value='8'/>
       <enumerator name='ETH_16_POOLS' value='16'/>
       <enumerator name='ETH_32_POOLS' value='32'/>
       <enumerator name='ETH_64_POOLS' value='64'/>
     </enum-decl>
-    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='750' column='1' id='type-id-351'>
+    <class-decl name='__anonymous_struct__7' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='750' column='1' id='type-id-348'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='vlan_id' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='751' column='1'/>
       </data-member>
@@ -3782,22 +3775,22 @@
         <var-decl name='pools' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='752' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_dcb_rx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='712' column='1' id='type-id-487'>
+    <class-decl name='rte_eth_dcb_rx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='712' column='1' id='type-id-485'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='nb_tcs' type-id='type-id-490' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='713' column='1'/>
+        <var-decl name='nb_tcs' type-id='type-id-488' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='713' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='dcb_tc' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='715' column='1'/>
+        <var-decl name='dcb_tc' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='715' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_nb_tcs' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='695' column='1' id='type-id-490'>
+    <enum-decl name='rte_eth_nb_tcs' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='695' column='1' id='type-id-488'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='ETH_4_TCS' value='4'/>
       <enumerator name='ETH_8_TCS' value='8'/>
     </enum-decl>
-    <class-decl name='rte_eth_vmdq_rx_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='776' column='1' id='type-id-488'>
+    <class-decl name='rte_eth_vmdq_rx_conf' size-in-bits='8320' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='776' column='1' id='type-id-486'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='nb_queue_pools' type-id='type-id-489' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='777' column='1'/>
+        <var-decl name='nb_queue_pools' type-id='type-id-487' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='777' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='enable_default_pool' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='778' column='1'/>
@@ -3815,62 +3808,62 @@
         <var-decl name='rx_mode' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='782' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='pool_map' type-id='type-id-353' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='786' column='1'/>
+        <var-decl name='pool_map' type-id='type-id-349' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='786' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__2' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1069' column='1' id='type-id-480'>
+    <union-decl name='__anonymous_union__2' size-in-bits='96' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1069' column='1' id='type-id-478'>
       <data-member access='private'>
-        <var-decl name='vmdq_dcb_tx_conf' type-id='type-id-491' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1070' column='1'/>
+        <var-decl name='vmdq_dcb_tx_conf' type-id='type-id-489' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1070' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='dcb_tx_conf' type-id='type-id-492' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1072' column='1'/>
+        <var-decl name='dcb_tx_conf' type-id='type-id-490' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1072' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='vmdq_tx_conf' type-id='type-id-493' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1074' column='1'/>
+        <var-decl name='vmdq_tx_conf' type-id='type-id-491' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1074' column='1'/>
       </data-member>
     </union-decl>
-    <class-decl name='rte_eth_vmdq_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='718' column='1' id='type-id-491'>
+    <class-decl name='rte_eth_vmdq_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='718' column='1' id='type-id-489'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='nb_queue_pools' type-id='type-id-489' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='719' column='1'/>
+        <var-decl name='nb_queue_pools' type-id='type-id-487' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='719' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='dcb_tc' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='721' column='1'/>
+        <var-decl name='dcb_tc' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='721' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='724' column='1' id='type-id-492'>
+    <class-decl name='rte_eth_dcb_tx_conf' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='724' column='1' id='type-id-490'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='nb_tcs' type-id='type-id-490' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='725' column='1'/>
+        <var-decl name='nb_tcs' type-id='type-id-488' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='725' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='dcb_tc' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='727' column='1'/>
+        <var-decl name='dcb_tc' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='727' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_vmdq_tx_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='730' column='1' id='type-id-493'>
+    <class-decl name='rte_eth_vmdq_tx_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='730' column='1' id='type-id-491'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='nb_queue_pools' type-id='type-id-489' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='731' column='1'/>
+        <var-decl name='nb_queue_pools' type-id='type-id-487' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='731' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_fdir_conf' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1005' column='1' id='type-id-481'>
+    <class-decl name='rte_fdir_conf' size-in-bits='6464' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1005' column='1' id='type-id-479'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='mode' type-id='type-id-494' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1006' column='1'/>
+        <var-decl name='mode' type-id='type-id-492' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1006' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='pballoc' type-id='type-id-495' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1007' column='1'/>
+        <var-decl name='pballoc' type-id='type-id-493' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1007' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='status' type-id='type-id-496' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1008' column='1'/>
+        <var-decl name='status' type-id='type-id-494' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1008' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
         <var-decl name='drop_queue' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1010' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='mask' type-id='type-id-497' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1011' column='1'/>
+        <var-decl name='mask' type-id='type-id-495' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1011' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='672'>
-        <var-decl name='flex_conf' type-id='type-id-498' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1012' column='1'/>
+        <var-decl name='flex_conf' type-id='type-id-496' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1012' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_fdir_mode' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='603' column='1' id='type-id-494'>
+    <enum-decl name='rte_fdir_mode' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='603' column='1' id='type-id-492'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_FDIR_MODE_NONE' value='0'/>
       <enumerator name='RTE_FDIR_MODE_SIGNATURE' value='1'/>
@@ -3878,27 +3871,27 @@
       <enumerator name='RTE_FDIR_MODE_PERFECT_MAC_VLAN' value='3'/>
       <enumerator name='RTE_FDIR_MODE_PERFECT_TUNNEL' value='4'/>
     </enum-decl>
-    <enum-decl name='rte_fdir_pballoc_type' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='984' column='1' id='type-id-495'>
+    <enum-decl name='rte_fdir_pballoc_type' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='984' column='1' id='type-id-493'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_FDIR_PBALLOC_64K' value='0'/>
       <enumerator name='RTE_FDIR_PBALLOC_128K' value='1'/>
       <enumerator name='RTE_FDIR_PBALLOC_256K' value='2'/>
     </enum-decl>
-    <enum-decl name='rte_fdir_status_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='993' column='1' id='type-id-496'>
+    <enum-decl name='rte_fdir_status_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='993' column='1' id='type-id-494'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_FDIR_NO_REPORT_STATUS' value='0'/>
       <enumerator name='RTE_FDIR_REPORT_STATUS' value='1'/>
       <enumerator name='RTE_FDIR_REPORT_STATUS_ALWAYS' value='2'/>
     </enum-decl>
-    <class-decl name='rte_eth_fdir_masks' size-in-bits='544' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='533' column='1' id='type-id-497'>
+    <class-decl name='rte_eth_fdir_masks' size-in-bits='544' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='533' column='1' id='type-id-495'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='vlan_tci_mask' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='534' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='ipv4_mask' type-id='type-id-499' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='536' column='1'/>
+        <var-decl name='ipv4_mask' type-id='type-id-497' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='536' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='ipv6_mask' type-id='type-id-500' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='538' column='1'/>
+        <var-decl name='ipv6_mask' type-id='type-id-498' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='538' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='416'>
         <var-decl name='src_port_mask' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='540' column='1'/>
@@ -3916,7 +3909,7 @@
         <var-decl name='tunnel_type_mask' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='548' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_ipv4_flow' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='342' column='1' id='type-id-499'>
+    <class-decl name='rte_eth_ipv4_flow' size-in-bits='96' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='342' column='1' id='type-id-497'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='src_ip' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='343' column='1'/>
       </data-member>
@@ -3933,12 +3926,12 @@
         <var-decl name='proto' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='347' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_ipv6_flow' size-in-bits='288' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='381' column='1' id='type-id-500'>
+    <class-decl name='rte_eth_ipv6_flow' size-in-bits='288' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='381' column='1' id='type-id-498'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='src_ip' type-id='type-id-378' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='382' column='1'/>
+        <var-decl name='src_ip' type-id='type-id-376' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='382' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='dst_ip' type-id='type-id-378' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='383' column='1'/>
+        <var-decl name='dst_ip' type-id='type-id-376' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='383' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <var-decl name='tc' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='384' column='1'/>
@@ -3950,7 +3943,7 @@
         <var-decl name='hop_limits' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='386' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_fdir_flex_conf' size-in-bits='5792' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='591' column='1' id='type-id-498'>
+    <class-decl name='rte_eth_fdir_flex_conf' size-in-bits='5792' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='591' column='1' id='type-id-496'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='nb_payloads' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='592' column='1'/>
       </data-member>
@@ -3958,21 +3951,21 @@
         <var-decl name='nb_flexmasks' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='593' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='flex_set' type-id='type-id-371' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='594' column='1'/>
+        <var-decl name='flex_set' type-id='type-id-369' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='594' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2336'>
-        <var-decl name='flex_mask' type-id='type-id-368' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='596' column='1'/>
+        <var-decl name='flex_mask' type-id='type-id-366' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='596' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_flex_payload_cfg' size-in-bits='288' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='568' column='1' id='type-id-370'>
+    <class-decl name='rte_eth_flex_payload_cfg' size-in-bits='288' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='568' column='1' id='type-id-368'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='type' type-id='type-id-501' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='569' column='1'/>
+        <var-decl name='type' type-id='type-id-499' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='569' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
-        <var-decl name='src_offset' type-id='type-id-376' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='570' column='1'/>
+        <var-decl name='src_offset' type-id='type-id-374' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='570' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_payload_type' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='555' column='1' id='type-id-501'>
+    <enum-decl name='rte_eth_payload_type' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='555' column='1' id='type-id-499'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_ETH_PAYLOAD_UNKNOWN' value='0'/>
       <enumerator name='RTE_ETH_RAW_PAYLOAD' value='1'/>
@@ -3981,15 +3974,15 @@
       <enumerator name='RTE_ETH_L4_PAYLOAD' value='4'/>
       <enumerator name='RTE_ETH_PAYLOAD_MAX' value='8'/>
     </enum-decl>
-    <class-decl name='rte_eth_fdir_flex_mask' size-in-bits='144' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='581' column='1' id='type-id-367'>
+    <class-decl name='rte_eth_fdir_flex_mask' size-in-bits='144' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='581' column='1' id='type-id-365'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='flow_type' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='582' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='mask' type-id='type-id-384' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='583' column='1'/>
+        <var-decl name='mask' type-id='type-id-382' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='583' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_intr_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1031' column='1' id='type-id-482'>
+    <class-decl name='rte_intr_conf' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1031' column='1' id='type-id-480'>
       <data-member access='public' layout-offset-in-bits='31'>
         <var-decl name='lsc' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1033' column='1'/>
       </data-member>
@@ -4000,7 +3993,7 @@
         <var-decl name='rmv' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1037' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_kernel_driver' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-474'>
+    <enum-decl name='rte_kernel_driver' filepath='../../dpdk/lib/librte_eal/common/include/rte_dev.h' line='60' column='1' id='type-id-472'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_KDRV_UNKNOWN' value='0'/>
       <enumerator name='RTE_KDRV_IGB_UIO' value='1'/>
@@ -4009,325 +4002,325 @@
       <enumerator name='RTE_KDRV_NIC_UIO' value='4'/>
       <enumerator name='RTE_KDRV_NONE' value='5'/>
     </enum-decl>
-    <class-decl name='rte_vlan_filter_conf' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='427' column='1' id='type-id-475'>
+    <class-decl name='rte_vlan_filter_conf' size-in-bits='4096' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='427' column='1' id='type-id-473'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='ids' type-id='type-id-382' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='428' column='1'/>
+        <var-decl name='ids' type-id='type-id-380' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='428' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_dev_owner' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1490' column='1' id='type-id-476'>
+    <class-decl name='rte_eth_dev_owner' size-in-bits='576' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1490' column='1' id='type-id-474'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='id' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1491' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='name' type-id='type-id-358' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1492' column='1'/>
+        <var-decl name='name' type-id='type-id-356' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1492' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='eth_dev_ops' size-in-bits='6016' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='609' column='1' id='type-id-502'>
+    <class-decl name='eth_dev_ops' size-in-bits='6016' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='609' column='1' id='type-id-500'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='dev_configure' type-id='type-id-503' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='610' column='1'/>
+        <var-decl name='dev_configure' type-id='type-id-501' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='610' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='dev_start' type-id='type-id-504' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='611' column='1'/>
+        <var-decl name='dev_start' type-id='type-id-502' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='611' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='dev_stop' type-id='type-id-505' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='612' column='1'/>
+        <var-decl name='dev_stop' type-id='type-id-503' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='612' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='dev_set_link_up' type-id='type-id-506' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='613' column='1'/>
+        <var-decl name='dev_set_link_up' type-id='type-id-504' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='613' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
-        <var-decl name='dev_set_link_down' type-id='type-id-507' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='614' column='1'/>
+        <var-decl name='dev_set_link_down' type-id='type-id-505' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='614' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='320'>
-        <var-decl name='dev_close' type-id='type-id-508' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='615' column='1'/>
+        <var-decl name='dev_close' type-id='type-id-506' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='615' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='384'>
-        <var-decl name='dev_reset' type-id='type-id-509' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='616' column='1'/>
+        <var-decl name='dev_reset' type-id='type-id-507' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='616' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
-        <var-decl name='link_update' type-id='type-id-510' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='617' column='1'/>
+        <var-decl name='link_update' type-id='type-id-508' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='617' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='512'>
-        <var-decl name='is_removed' type-id='type-id-511' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='618' column='1'/>
+        <var-decl name='is_removed' type-id='type-id-509' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='618' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='576'>
-        <var-decl name='promiscuous_enable' type-id='type-id-512' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='621' column='1'/>
+        <var-decl name='promiscuous_enable' type-id='type-id-510' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='621' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='640'>
-        <var-decl name='promiscuous_disable' type-id='type-id-513' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='622' column='1'/>
+        <var-decl name='promiscuous_disable' type-id='type-id-511' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='622' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='704'>
-        <var-decl name='allmulticast_enable' type-id='type-id-514' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='623' column='1'/>
+        <var-decl name='allmulticast_enable' type-id='type-id-512' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='623' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='768'>
-        <var-decl name='allmulticast_disable' type-id='type-id-515' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='624' column='1'/>
+        <var-decl name='allmulticast_disable' type-id='type-id-513' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='624' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='832'>
-        <var-decl name='mac_addr_remove' type-id='type-id-516' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='625' column='1'/>
+        <var-decl name='mac_addr_remove' type-id='type-id-514' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='625' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='mac_addr_add' type-id='type-id-517' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='626' column='1'/>
+        <var-decl name='mac_addr_add' type-id='type-id-515' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='626' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='960'>
-        <var-decl name='mac_addr_set' type-id='type-id-518' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='627' column='1'/>
+        <var-decl name='mac_addr_set' type-id='type-id-516' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='627' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1024'>
-        <var-decl name='set_mc_addr_list' type-id='type-id-519' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='628' column='1'/>
+        <var-decl name='set_mc_addr_list' type-id='type-id-517' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='628' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1088'>
-        <var-decl name='mtu_set' type-id='type-id-520' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='629' column='1'/>
+        <var-decl name='mtu_set' type-id='type-id-518' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='629' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1152'>
-        <var-decl name='stats_get' type-id='type-id-521' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='631' column='1'/>
+        <var-decl name='stats_get' type-id='type-id-519' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='631' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1216'>
-        <var-decl name='stats_reset' type-id='type-id-522' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='632' column='1'/>
+        <var-decl name='stats_reset' type-id='type-id-520' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='632' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1280'>
-        <var-decl name='xstats_get' type-id='type-id-523' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='633' column='1'/>
+        <var-decl name='xstats_get' type-id='type-id-521' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='633' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1344'>
-        <var-decl name='xstats_reset' type-id='type-id-524' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='634' column='1'/>
+        <var-decl name='xstats_reset' type-id='type-id-522' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='634' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1408'>
-        <var-decl name='xstats_get_names' type-id='type-id-525' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='635' column='1'/>
+        <var-decl name='xstats_get_names' type-id='type-id-523' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='635' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1472'>
-        <var-decl name='queue_stats_mapping_set' type-id='type-id-526' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='637' column='1'/>
+        <var-decl name='queue_stats_mapping_set' type-id='type-id-524' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='637' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1536'>
-        <var-decl name='dev_infos_get' type-id='type-id-527' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='640' column='1'/>
+        <var-decl name='dev_infos_get' type-id='type-id-525' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='640' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1600'>
-        <var-decl name='rxq_info_get' type-id='type-id-528' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='641' column='1'/>
+        <var-decl name='rxq_info_get' type-id='type-id-526' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='641' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1664'>
-        <var-decl name='txq_info_get' type-id='type-id-529' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='642' column='1'/>
+        <var-decl name='txq_info_get' type-id='type-id-527' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='642' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1728'>
-        <var-decl name='rx_burst_mode_get' type-id='type-id-530' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='643' column='1'/>
+        <var-decl name='rx_burst_mode_get' type-id='type-id-528' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='643' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1792'>
-        <var-decl name='tx_burst_mode_get' type-id='type-id-530' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='644' column='1'/>
+        <var-decl name='tx_burst_mode_get' type-id='type-id-528' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='644' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1856'>
-        <var-decl name='fw_version_get' type-id='type-id-531' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='645' column='1'/>
+        <var-decl name='fw_version_get' type-id='type-id-529' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='645' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1920'>
-        <var-decl name='dev_supported_ptypes_get' type-id='type-id-532' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='646' column='1'/>
+        <var-decl name='dev_supported_ptypes_get' type-id='type-id-530' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='646' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1984'>
-        <var-decl name='dev_ptypes_set' type-id='type-id-533' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='648' column='1'/>
+        <var-decl name='dev_ptypes_set' type-id='type-id-531' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='648' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2048'>
-        <var-decl name='vlan_filter_set' type-id='type-id-534' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='651' column='1'/>
+        <var-decl name='vlan_filter_set' type-id='type-id-532' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='651' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2112'>
-        <var-decl name='vlan_tpid_set' type-id='type-id-535' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='652' column='1'/>
+        <var-decl name='vlan_tpid_set' type-id='type-id-533' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='652' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2176'>
-        <var-decl name='vlan_strip_queue_set' type-id='type-id-536' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='653' column='1'/>
+        <var-decl name='vlan_strip_queue_set' type-id='type-id-534' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='653' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2240'>
-        <var-decl name='vlan_offload_set' type-id='type-id-537' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='654' column='1'/>
+        <var-decl name='vlan_offload_set' type-id='type-id-535' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='654' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2304'>
-        <var-decl name='vlan_pvid_set' type-id='type-id-538' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='655' column='1'/>
+        <var-decl name='vlan_pvid_set' type-id='type-id-536' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='655' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2368'>
-        <var-decl name='rx_queue_start' type-id='type-id-539' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='657' column='1'/>
+        <var-decl name='rx_queue_start' type-id='type-id-537' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='657' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2432'>
-        <var-decl name='rx_queue_stop' type-id='type-id-540' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='658' column='1'/>
+        <var-decl name='rx_queue_stop' type-id='type-id-538' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='658' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2496'>
-        <var-decl name='tx_queue_start' type-id='type-id-539' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='659' column='1'/>
+        <var-decl name='tx_queue_start' type-id='type-id-537' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='659' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2560'>
-        <var-decl name='tx_queue_stop' type-id='type-id-540' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='660' column='1'/>
+        <var-decl name='tx_queue_stop' type-id='type-id-538' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='660' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2624'>
-        <var-decl name='rx_queue_setup' type-id='type-id-541' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='661' column='1'/>
+        <var-decl name='rx_queue_setup' type-id='type-id-539' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='661' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2688'>
-        <var-decl name='rx_queue_release' type-id='type-id-542' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='662' column='1'/>
+        <var-decl name='rx_queue_release' type-id='type-id-540' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='662' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2752'>
-        <var-decl name='rx_queue_count' type-id='type-id-543' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='663' column='1'/>
+        <var-decl name='rx_queue_count' type-id='type-id-541' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='663' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2816'>
-        <var-decl name='rx_descriptor_done' type-id='type-id-544' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='665' column='1'/>
+        <var-decl name='rx_descriptor_done' type-id='type-id-542' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='665' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2880'>
-        <var-decl name='rx_descriptor_status' type-id='type-id-545' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='666' column='1'/>
+        <var-decl name='rx_descriptor_status' type-id='type-id-543' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='666' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2944'>
-        <var-decl name='tx_descriptor_status' type-id='type-id-546' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='668' column='1'/>
+        <var-decl name='tx_descriptor_status' type-id='type-id-544' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='668' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3008'>
-        <var-decl name='rx_queue_intr_enable' type-id='type-id-547' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='670' column='1'/>
+        <var-decl name='rx_queue_intr_enable' type-id='type-id-545' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='670' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3072'>
-        <var-decl name='rx_queue_intr_disable' type-id='type-id-548' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='671' column='1'/>
+        <var-decl name='rx_queue_intr_disable' type-id='type-id-546' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='671' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3136'>
-        <var-decl name='tx_queue_setup' type-id='type-id-549' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='672' column='1'/>
+        <var-decl name='tx_queue_setup' type-id='type-id-547' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='672' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3200'>
-        <var-decl name='tx_queue_release' type-id='type-id-542' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='673' column='1'/>
+        <var-decl name='tx_queue_release' type-id='type-id-540' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='673' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3264'>
-        <var-decl name='tx_done_cleanup' type-id='type-id-550' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='674' column='1'/>
+        <var-decl name='tx_done_cleanup' type-id='type-id-548' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='674' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3328'>
-        <var-decl name='dev_led_on' type-id='type-id-551' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='676' column='1'/>
+        <var-decl name='dev_led_on' type-id='type-id-549' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='676' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3392'>
-        <var-decl name='dev_led_off' type-id='type-id-552' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='677' column='1'/>
+        <var-decl name='dev_led_off' type-id='type-id-550' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='677' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3456'>
-        <var-decl name='flow_ctrl_get' type-id='type-id-553' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='679' column='1'/>
+        <var-decl name='flow_ctrl_get' type-id='type-id-551' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='679' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3520'>
-        <var-decl name='flow_ctrl_set' type-id='type-id-554' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='680' column='1'/>
+        <var-decl name='flow_ctrl_set' type-id='type-id-552' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='680' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3584'>
-        <var-decl name='priority_flow_ctrl_set' type-id='type-id-555' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='681' column='1'/>
+        <var-decl name='priority_flow_ctrl_set' type-id='type-id-553' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='681' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3648'>
-        <var-decl name='uc_hash_table_set' type-id='type-id-556' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='683' column='1'/>
+        <var-decl name='uc_hash_table_set' type-id='type-id-554' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='683' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3712'>
-        <var-decl name='uc_all_hash_table_set' type-id='type-id-557' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='684' column='1'/>
+        <var-decl name='uc_all_hash_table_set' type-id='type-id-555' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='684' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3776'>
-        <var-decl name='mirror_rule_set' type-id='type-id-558' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='686' column='1'/>
+        <var-decl name='mirror_rule_set' type-id='type-id-556' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='686' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3840'>
-        <var-decl name='mirror_rule_reset' type-id='type-id-559' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='687' column='1'/>
+        <var-decl name='mirror_rule_reset' type-id='type-id-557' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='687' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3904'>
-        <var-decl name='udp_tunnel_port_add' type-id='type-id-560' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='689' column='1'/>
+        <var-decl name='udp_tunnel_port_add' type-id='type-id-558' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='689' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='3968'>
-        <var-decl name='udp_tunnel_port_del' type-id='type-id-561' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='690' column='1'/>
+        <var-decl name='udp_tunnel_port_del' type-id='type-id-559' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='690' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4032'>
-        <var-decl name='l2_tunnel_eth_type_conf' type-id='type-id-562' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='691' column='1'/>
+        <var-decl name='l2_tunnel_eth_type_conf' type-id='type-id-560' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='691' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4096'>
-        <var-decl name='l2_tunnel_offload_set' type-id='type-id-563' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='693' column='1'/>
+        <var-decl name='l2_tunnel_offload_set' type-id='type-id-561' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='693' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4160'>
-        <var-decl name='set_queue_rate_limit' type-id='type-id-564' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='696' column='1'/>
+        <var-decl name='set_queue_rate_limit' type-id='type-id-562' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='696' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4224'>
-        <var-decl name='rss_hash_update' type-id='type-id-565' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='698' column='1'/>
+        <var-decl name='rss_hash_update' type-id='type-id-563' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='698' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4288'>
-        <var-decl name='rss_hash_conf_get' type-id='type-id-566' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='699' column='1'/>
+        <var-decl name='rss_hash_conf_get' type-id='type-id-564' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='699' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4352'>
-        <var-decl name='reta_update' type-id='type-id-567' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='700' column='1'/>
+        <var-decl name='reta_update' type-id='type-id-565' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='700' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4416'>
-        <var-decl name='reta_query' type-id='type-id-568' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='701' column='1'/>
+        <var-decl name='reta_query' type-id='type-id-566' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='701' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4480'>
-        <var-decl name='get_reg' type-id='type-id-569' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='703' column='1'/>
+        <var-decl name='get_reg' type-id='type-id-567' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='703' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4544'>
-        <var-decl name='get_eeprom_length' type-id='type-id-570' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='704' column='1'/>
+        <var-decl name='get_eeprom_length' type-id='type-id-568' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='704' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4608'>
-        <var-decl name='get_eeprom' type-id='type-id-571' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='705' column='1'/>
+        <var-decl name='get_eeprom' type-id='type-id-569' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='705' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4672'>
-        <var-decl name='set_eeprom' type-id='type-id-572' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='706' column='1'/>
+        <var-decl name='set_eeprom' type-id='type-id-570' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='706' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4736'>
-        <var-decl name='get_module_info' type-id='type-id-573' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='708' column='1'/>
+        <var-decl name='get_module_info' type-id='type-id-571' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='708' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4800'>
-        <var-decl name='get_module_eeprom' type-id='type-id-574' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='710' column='1'/>
+        <var-decl name='get_module_eeprom' type-id='type-id-572' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='710' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4864'>
-        <var-decl name='filter_ctrl' type-id='type-id-575' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='713' column='1'/>
+        <var-decl name='filter_ctrl' type-id='type-id-573' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='713' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4928'>
-        <var-decl name='get_dcb_info' type-id='type-id-576' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='715' column='1'/>
+        <var-decl name='get_dcb_info' type-id='type-id-574' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='715' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='4992'>
-        <var-decl name='timesync_enable' type-id='type-id-577' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='717' column='1'/>
+        <var-decl name='timesync_enable' type-id='type-id-575' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='717' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5056'>
-        <var-decl name='timesync_disable' type-id='type-id-578' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='719' column='1'/>
+        <var-decl name='timesync_disable' type-id='type-id-576' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='719' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5120'>
-        <var-decl name='timesync_read_rx_timestamp' type-id='type-id-579' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='721' column='1'/>
+        <var-decl name='timesync_read_rx_timestamp' type-id='type-id-577' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='721' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5184'>
-        <var-decl name='timesync_read_tx_timestamp' type-id='type-id-580' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='723' column='1'/>
+        <var-decl name='timesync_read_tx_timestamp' type-id='type-id-578' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='723' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5248'>
-        <var-decl name='timesync_adjust_time' type-id='type-id-581' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='725' column='1'/>
+        <var-decl name='timesync_adjust_time' type-id='type-id-579' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='725' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5312'>
-        <var-decl name='timesync_read_time' type-id='type-id-582' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='726' column='1'/>
+        <var-decl name='timesync_read_time' type-id='type-id-580' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='726' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5376'>
-        <var-decl name='timesync_write_time' type-id='type-id-583' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='727' column='1'/>
+        <var-decl name='timesync_write_time' type-id='type-id-581' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='727' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5440'>
-        <var-decl name='read_clock' type-id='type-id-584' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='729' column='1'/>
+        <var-decl name='read_clock' type-id='type-id-582' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='729' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5504'>
-        <var-decl name='xstats_get_by_id' type-id='type-id-585' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='731' column='1'/>
+        <var-decl name='xstats_get_by_id' type-id='type-id-583' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='731' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5568'>
-        <var-decl name='xstats_get_names_by_id' type-id='type-id-586' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='733' column='1'/>
+        <var-decl name='xstats_get_names_by_id' type-id='type-id-584' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='733' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5632'>
-        <var-decl name='tm_ops_get' type-id='type-id-587' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='736' column='1'/>
+        <var-decl name='tm_ops_get' type-id='type-id-585' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='736' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5696'>
-        <var-decl name='mtr_ops_get' type-id='type-id-588' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='739' column='1'/>
+        <var-decl name='mtr_ops_get' type-id='type-id-586' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='739' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5760'>
-        <var-decl name='pool_ops_supported' type-id='type-id-589' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='742' column='1'/>
+        <var-decl name='pool_ops_supported' type-id='type-id-587' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='742' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5824'>
-        <var-decl name='hairpin_cap_get' type-id='type-id-590' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='745' column='1'/>
+        <var-decl name='hairpin_cap_get' type-id='type-id-588' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='745' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5888'>
-        <var-decl name='rx_hairpin_queue_setup' type-id='type-id-591' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='747' column='1'/>
+        <var-decl name='rx_hairpin_queue_setup' type-id='type-id-589' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='747' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='5952'>
-        <var-decl name='tx_hairpin_queue_setup' type-id='type-id-592' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='749' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='eth_dev_configure_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='31' column='1' id='type-id-503'/>
-    <typedef-decl name='eth_dev_start_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='34' column='1' id='type-id-504'/>
-    <typedef-decl name='eth_dev_stop_t' type-id='type-id-594' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='37' column='1' id='type-id-505'/>
-    <typedef-decl name='eth_dev_set_link_up_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='40' column='1' id='type-id-506'/>
-    <typedef-decl name='eth_dev_set_link_down_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='43' column='1' id='type-id-507'/>
-    <typedef-decl name='eth_dev_close_t' type-id='type-id-594' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='46' column='1' id='type-id-508'/>
-    <typedef-decl name='eth_dev_reset_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='49' column='1' id='type-id-509'/>
-    <typedef-decl name='eth_link_update_t' type-id='type-id-595' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='155' column='1' id='type-id-510'/>
-    <typedef-decl name='eth_is_removed_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='52' column='1' id='type-id-511'/>
-    <typedef-decl name='eth_promiscuous_enable_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='78' column='1' id='type-id-512'/>
-    <typedef-decl name='eth_promiscuous_disable_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='103' column='1' id='type-id-513'/>
-    <typedef-decl name='eth_allmulticast_enable_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='128' column='1' id='type-id-514'/>
-    <typedef-decl name='eth_allmulticast_disable_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='153' column='1' id='type-id-515'/>
-    <typedef-decl name='eth_mac_addr_remove_t' type-id='type-id-596' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='391' column='1' id='type-id-516'/>
-    <typedef-decl name='eth_mac_addr_add_t' type-id='type-id-597' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='394' column='1' id='type-id-517'/>
-    <typedef-decl name='eth_mac_addr_set_t' type-id='type-id-598' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='400' column='1' id='type-id-518'/>
-    <typedef-decl name='eth_set_mc_addr_list_t' type-id='type-id-599' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='436' column='1' id='type-id-519'/>
-    <typedef-decl name='mtu_set_t' type-id='type-id-600' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='315' column='1' id='type-id-520'/>
-    <typedef-decl name='eth_stats_get_t' type-id='type-id-601' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='159' column='1' id='type-id-521'/>
-    <typedef-decl name='eth_stats_reset_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='182' column='1' id='type-id-522'/>
-    <typedef-decl name='eth_xstats_get_t' type-id='type-id-602' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='184' column='1' id='type-id-523'/>
-    <class-decl name='rte_eth_xstat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1337' column='1' id='type-id-603'>
+        <var-decl name='tx_hairpin_queue_setup' type-id='type-id-590' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='749' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='eth_dev_configure_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='31' column='1' id='type-id-501'/>
+    <typedef-decl name='eth_dev_start_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='34' column='1' id='type-id-502'/>
+    <typedef-decl name='eth_dev_stop_t' type-id='type-id-592' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='37' column='1' id='type-id-503'/>
+    <typedef-decl name='eth_dev_set_link_up_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='40' column='1' id='type-id-504'/>
+    <typedef-decl name='eth_dev_set_link_down_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='43' column='1' id='type-id-505'/>
+    <typedef-decl name='eth_dev_close_t' type-id='type-id-592' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='46' column='1' id='type-id-506'/>
+    <typedef-decl name='eth_dev_reset_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='49' column='1' id='type-id-507'/>
+    <typedef-decl name='eth_link_update_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='155' column='1' id='type-id-508'/>
+    <typedef-decl name='eth_is_removed_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='52' column='1' id='type-id-509'/>
+    <typedef-decl name='eth_promiscuous_enable_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='78' column='1' id='type-id-510'/>
+    <typedef-decl name='eth_promiscuous_disable_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='103' column='1' id='type-id-511'/>
+    <typedef-decl name='eth_allmulticast_enable_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='128' column='1' id='type-id-512'/>
+    <typedef-decl name='eth_allmulticast_disable_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='153' column='1' id='type-id-513'/>
+    <typedef-decl name='eth_mac_addr_remove_t' type-id='type-id-594' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='391' column='1' id='type-id-514'/>
+    <typedef-decl name='eth_mac_addr_add_t' type-id='type-id-595' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='394' column='1' id='type-id-515'/>
+    <typedef-decl name='eth_mac_addr_set_t' type-id='type-id-596' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='400' column='1' id='type-id-516'/>
+    <typedef-decl name='eth_set_mc_addr_list_t' type-id='type-id-597' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='436' column='1' id='type-id-517'/>
+    <typedef-decl name='mtu_set_t' type-id='type-id-598' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='315' column='1' id='type-id-518'/>
+    <typedef-decl name='eth_stats_get_t' type-id='type-id-599' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='159' column='1' id='type-id-519'/>
+    <typedef-decl name='eth_stats_reset_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='182' column='1' id='type-id-520'/>
+    <typedef-decl name='eth_xstats_get_t' type-id='type-id-600' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='184' column='1' id='type-id-521'/>
+    <class-decl name='rte_eth_xstat' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1337' column='1' id='type-id-601'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='id' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1338' column='1'/>
       </data-member>
@@ -4335,21 +4328,21 @@
         <var-decl name='value' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1339' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_xstats_reset_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='213' column='1' id='type-id-524'/>
-    <typedef-decl name='eth_xstats_get_names_t' type-id='type-id-604' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='215' column='1' id='type-id-525'/>
-    <class-decl name='rte_eth_xstat_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1349' column='1' id='type-id-605'>
+    <typedef-decl name='eth_xstats_reset_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='213' column='1' id='type-id-522'/>
+    <typedef-decl name='eth_xstats_get_names_t' type-id='type-id-602' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='215' column='1' id='type-id-523'/>
+    <class-decl name='rte_eth_xstat_name' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1349' column='1' id='type-id-603'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='name' type-id='type-id-358' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1350' column='1'/>
+        <var-decl name='name' type-id='type-id-356' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1350' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_queue_stats_mapping_set_t' type-id='type-id-606' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='224' column='1' id='type-id-526'/>
-    <typedef-decl name='eth_dev_infos_get_t' type-id='type-id-607' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='230' column='1' id='type-id-527'/>
-    <class-decl name='rte_eth_dev_info' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1226' column='1' id='type-id-608'>
+    <typedef-decl name='eth_queue_stats_mapping_set_t' type-id='type-id-604' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='224' column='1' id='type-id-524'/>
+    <typedef-decl name='eth_dev_infos_get_t' type-id='type-id-605' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='230' column='1' id='type-id-525'/>
+    <class-decl name='rte_eth_dev_info' size-in-bits='2560' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1226' column='1' id='type-id-606'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='device' type-id='type-id-429' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1227' column='1'/>
+        <var-decl name='device' type-id='type-id-427' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1227' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='driver_name' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1228' column='1'/>
+        <var-decl name='driver_name' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1228' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <var-decl name='if_index' type-id='type-id-2' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1229' column='1'/>
@@ -4361,7 +4354,7 @@
         <var-decl name='max_mtu' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1232' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='dev_flags' type-id='type-id-609' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1233' column='1'/>
+        <var-decl name='dev_flags' type-id='type-id-607' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1233' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='256'>
         <var-decl name='min_rx_bufsize' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1234' column='1'/>
@@ -4412,10 +4405,10 @@
         <var-decl name='flow_type_rss_offloads' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1257' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='896'>
-        <var-decl name='default_rxconf' type-id='type-id-610' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1258' column='1'/>
+        <var-decl name='default_rxconf' type-id='type-id-608' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1258' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1280'>
-        <var-decl name='default_txconf' type-id='type-id-611' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1259' column='1'/>
+        <var-decl name='default_txconf' type-id='type-id-609' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1259' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1728'>
         <var-decl name='vmdq_queue_base' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1260' column='1'/>
@@ -4427,10 +4420,10 @@
         <var-decl name='vmdq_pool_base' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1262' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1776'>
-        <var-decl name='rx_desc_lim' type-id='type-id-612' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1263' column='1'/>
+        <var-decl name='rx_desc_lim' type-id='type-id-610' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1263' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1856'>
-        <var-decl name='tx_desc_lim' type-id='type-id-612' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1264' column='1'/>
+        <var-decl name='tx_desc_lim' type-id='type-id-610' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1264' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='1952'>
         <var-decl name='speed_capa' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1265' column='1'/>
@@ -4442,16 +4435,16 @@
         <var-decl name='nb_tx_queues' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1268' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2016'>
-        <var-decl name='default_rxportconf' type-id='type-id-613' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1270' column='1'/>
+        <var-decl name='default_rxportconf' type-id='type-id-611' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1270' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2064'>
-        <var-decl name='default_txportconf' type-id='type-id-613' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1272' column='1'/>
+        <var-decl name='default_txportconf' type-id='type-id-611' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1272' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2112'>
         <var-decl name='dev_capa' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1274' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2176'>
-        <var-decl name='switch_info' type-id='type-id-614' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1279' column='1'/>
+        <var-decl name='switch_info' type-id='type-id-612' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1279' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='2304'>
         <var-decl name='reserved_64s' type-id='type-id-138' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1281' column='1'/>
@@ -4460,9 +4453,9 @@
         <var-decl name='reserved_ptrs' type-id='type-id-60' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1282' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_rxconf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='818' column='1' id='type-id-610'>
+    <class-decl name='rte_eth_rxconf' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='818' column='1' id='type-id-608'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='rx_thresh' type-id='type-id-615' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='819' column='1'/>
+        <var-decl name='rx_thresh' type-id='type-id-613' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='819' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='rx_free_thresh' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='820' column='1'/>
@@ -4483,7 +4476,7 @@
         <var-decl name='reserved_ptrs' type-id='type-id-60' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='831' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_thresh' size-in-bits='24' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='327' column='1' id='type-id-615'>
+    <class-decl name='rte_eth_thresh' size-in-bits='24' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='327' column='1' id='type-id-613'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='pthresh' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='328' column='1'/>
       </data-member>
@@ -4494,9 +4487,9 @@
         <var-decl name='wthresh' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='330' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_txconf' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='837' column='1' id='type-id-611'>
+    <class-decl name='rte_eth_txconf' size-in-bits='448' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='837' column='1' id='type-id-609'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tx_thresh' type-id='type-id-615' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='838' column='1'/>
+        <var-decl name='tx_thresh' type-id='type-id-613' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='838' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='tx_rs_thresh' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='839' column='1'/>
@@ -4517,7 +4510,7 @@
         <var-decl name='reserved_ptrs' type-id='type-id-60' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='852' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_desc_lim' size-in-bits='80' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='898' column='1' id='type-id-612'>
+    <class-decl name='rte_eth_desc_lim' size-in-bits='80' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='898' column='1' id='type-id-610'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='nb_max' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='899' column='1'/>
       </data-member>
@@ -4534,7 +4527,7 @@
         <var-decl name='nb_mtu_seg_max' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='924' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_dev_portconf' size-in-bits='48' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1189' column='1' id='type-id-613'>
+    <class-decl name='rte_eth_dev_portconf' size-in-bits='48' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1189' column='1' id='type-id-611'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='burst_size' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1190' column='1'/>
       </data-member>
@@ -4545,9 +4538,9 @@
         <var-decl name='nb_queues' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1192' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_switch_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1204' column='1' id='type-id-614'>
+    <class-decl name='rte_eth_switch_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1204' column='1' id='type-id-612'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='name' type-id='type-id-399' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1205' column='1'/>
+        <var-decl name='name' type-id='type-id-397' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1205' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
         <var-decl name='domain_id' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1206' column='1'/>
@@ -4556,13 +4549,13 @@
         <var-decl name='port_id' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1207' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_rxq_info_get_t' type-id='type-id-616' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='306' column='1' id='type-id-528'/>
-    <class-decl name='rte_eth_rxq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1289' column='1' id='type-id-617'>
+    <typedef-decl name='eth_rxq_info_get_t' type-id='type-id-614' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='306' column='1' id='type-id-526'/>
+    <class-decl name='rte_eth_rxq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1289' column='1' id='type-id-615'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='mp' type-id='type-id-265' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1290' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='conf' type-id='type-id-610' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1291' column='1'/>
+        <var-decl name='conf' type-id='type-id-608' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1291' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
         <var-decl name='scattered_rx' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1292' column='1'/>
@@ -4571,55 +4564,55 @@
         <var-decl name='nb_desc' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1293' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_txq_info_get_t' type-id='type-id-618' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='309' column='1' id='type-id-529'/>
-    <class-decl name='rte_eth_txq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1300' column='1' id='type-id-619'>
+    <typedef-decl name='eth_txq_info_get_t' type-id='type-id-616' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='309' column='1' id='type-id-527'/>
+    <class-decl name='rte_eth_txq_info' size-in-bits='512' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1300' column='1' id='type-id-617'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='conf' type-id='type-id-611' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1301' column='1'/>
+        <var-decl name='conf' type-id='type-id-609' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1301' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='448'>
         <var-decl name='nb_desc' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1302' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_burst_mode_get_t' type-id='type-id-620' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='312' column='1' id='type-id-530'/>
-    <class-decl name='rte_eth_burst_mode' size-in-bits='8256' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1318' column='1' id='type-id-621'>
+    <typedef-decl name='eth_burst_mode_get_t' type-id='type-id-618' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='312' column='1' id='type-id-528'/>
+    <class-decl name='rte_eth_burst_mode' size-in-bits='8256' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1318' column='1' id='type-id-619'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='flags' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1319' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='info' type-id='type-id-356' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1322' column='1'/>
+        <var-decl name='info' type-id='type-id-354' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1322' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_fw_version_get_t' type-id='type-id-622' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='299' column='1' id='type-id-531'/>
-    <typedef-decl name='eth_dev_supported_ptypes_get_t' type-id='type-id-623' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='234' column='1' id='type-id-532'/>
-    <typedef-decl name='eth_dev_ptypes_set_t' type-id='type-id-624' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='249' column='1' id='type-id-533'/>
-    <typedef-decl name='vlan_filter_set_t' type-id='type-id-625' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='318' column='1' id='type-id-534'/>
-    <typedef-decl name='vlan_tpid_set_t' type-id='type-id-626' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='323' column='1' id='type-id-535'/>
-    <enum-decl name='rte_vlan_type' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='416' column='1' id='type-id-627'>
+    <typedef-decl name='eth_fw_version_get_t' type-id='type-id-620' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='299' column='1' id='type-id-529'/>
+    <typedef-decl name='eth_dev_supported_ptypes_get_t' type-id='type-id-621' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='234' column='1' id='type-id-530'/>
+    <typedef-decl name='eth_dev_ptypes_set_t' type-id='type-id-622' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='249' column='1' id='type-id-531'/>
+    <typedef-decl name='vlan_filter_set_t' type-id='type-id-623' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='318' column='1' id='type-id-532'/>
+    <typedef-decl name='vlan_tpid_set_t' type-id='type-id-624' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='323' column='1' id='type-id-533'/>
+    <enum-decl name='rte_vlan_type' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='416' column='1' id='type-id-625'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='ETH_VLAN_TYPE_UNKNOWN' value='0'/>
       <enumerator name='ETH_VLAN_TYPE_INNER' value='1'/>
       <enumerator name='ETH_VLAN_TYPE_OUTER' value='2'/>
       <enumerator name='ETH_VLAN_TYPE_MAX' value='3'/>
     </enum-decl>
-    <typedef-decl name='vlan_strip_queue_set_t' type-id='type-id-628' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='335' column='1' id='type-id-536'/>
-    <typedef-decl name='vlan_offload_set_t' type-id='type-id-595' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='327' column='1' id='type-id-537'/>
-    <typedef-decl name='vlan_pvid_set_t' type-id='type-id-625' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='330' column='1' id='type-id-538'/>
-    <typedef-decl name='eth_queue_start_t' type-id='type-id-600' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='252' column='1' id='type-id-539'/>
-    <typedef-decl name='eth_queue_stop_t' type-id='type-id-600' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='256' column='1' id='type-id-540'/>
-    <typedef-decl name='eth_rx_queue_setup_t' type-id='type-id-629' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='260' column='1' id='type-id-541'/>
-    <typedef-decl name='eth_queue_release_t' type-id='type-id-630' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='283' column='1' id='type-id-542'/>
-    <typedef-decl name='eth_rx_queue_count_t' type-id='type-id-631' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='286' column='1' id='type-id-543'/>
-    <typedef-decl name='eth_rx_descriptor_done_t' type-id='type-id-632' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='290' column='1' id='type-id-544'/>
-    <typedef-decl name='eth_rx_descriptor_status_t' type-id='type-id-632' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='293' column='1' id='type-id-545'/>
-    <typedef-decl name='eth_tx_descriptor_status_t' type-id='type-id-632' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='296' column='1' id='type-id-546'/>
-    <typedef-decl name='eth_rx_enable_intr_t' type-id='type-id-600' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='275' column='1' id='type-id-547'/>
-    <typedef-decl name='eth_rx_disable_intr_t' type-id='type-id-600' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='279' column='1' id='type-id-548'/>
-    <typedef-decl name='eth_tx_queue_setup_t' type-id='type-id-633' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='268' column='1' id='type-id-549'/>
-    <typedef-decl name='eth_tx_done_cleanup_t' type-id='type-id-634' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='303' column='1' id='type-id-550'/>
-    <typedef-decl name='eth_dev_led_on_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='385' column='1' id='type-id-551'/>
-    <typedef-decl name='eth_dev_led_off_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='388' column='1' id='type-id-552'/>
-    <typedef-decl name='flow_ctrl_get_t' type-id='type-id-635' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='355' column='1' id='type-id-553'/>
-    <class-decl name='rte_eth_fc_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='942' column='1' id='type-id-636'>
+    <typedef-decl name='vlan_strip_queue_set_t' type-id='type-id-626' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='335' column='1' id='type-id-534'/>
+    <typedef-decl name='vlan_offload_set_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='327' column='1' id='type-id-535'/>
+    <typedef-decl name='vlan_pvid_set_t' type-id='type-id-623' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='330' column='1' id='type-id-536'/>
+    <typedef-decl name='eth_queue_start_t' type-id='type-id-598' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='252' column='1' id='type-id-537'/>
+    <typedef-decl name='eth_queue_stop_t' type-id='type-id-598' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='256' column='1' id='type-id-538'/>
+    <typedef-decl name='eth_rx_queue_setup_t' type-id='type-id-627' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='260' column='1' id='type-id-539'/>
+    <typedef-decl name='eth_queue_release_t' type-id='type-id-628' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='283' column='1' id='type-id-540'/>
+    <typedef-decl name='eth_rx_queue_count_t' type-id='type-id-629' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='286' column='1' id='type-id-541'/>
+    <typedef-decl name='eth_rx_descriptor_done_t' type-id='type-id-630' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='290' column='1' id='type-id-542'/>
+    <typedef-decl name='eth_rx_descriptor_status_t' type-id='type-id-630' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='293' column='1' id='type-id-543'/>
+    <typedef-decl name='eth_tx_descriptor_status_t' type-id='type-id-630' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='296' column='1' id='type-id-544'/>
+    <typedef-decl name='eth_rx_enable_intr_t' type-id='type-id-598' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='275' column='1' id='type-id-545'/>
+    <typedef-decl name='eth_rx_disable_intr_t' type-id='type-id-598' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='279' column='1' id='type-id-546'/>
+    <typedef-decl name='eth_tx_queue_setup_t' type-id='type-id-631' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='268' column='1' id='type-id-547'/>
+    <typedef-decl name='eth_tx_done_cleanup_t' type-id='type-id-632' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='303' column='1' id='type-id-548'/>
+    <typedef-decl name='eth_dev_led_on_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='385' column='1' id='type-id-549'/>
+    <typedef-decl name='eth_dev_led_off_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='388' column='1' id='type-id-550'/>
+    <typedef-decl name='flow_ctrl_get_t' type-id='type-id-633' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='355' column='1' id='type-id-551'/>
+    <class-decl name='rte_eth_fc_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='942' column='1' id='type-id-634'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='high_water' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='943' column='1'/>
       </data-member>
@@ -4633,7 +4626,7 @@
         <var-decl name='send_xon' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='946' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
-        <var-decl name='mode' type-id='type-id-637' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='947' column='1'/>
+        <var-decl name='mode' type-id='type-id-635' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='947' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <var-decl name='mac_ctrl_frame_fwd' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='948' column='1'/>
@@ -4642,27 +4635,27 @@
         <var-decl name='autoneg' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='949' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_fc_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='930' column='1' id='type-id-637'>
+    <enum-decl name='rte_eth_fc_mode' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='930' column='1' id='type-id-635'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_FC_NONE' value='0'/>
       <enumerator name='RTE_FC_RX_PAUSE' value='1'/>
       <enumerator name='RTE_FC_TX_PAUSE' value='2'/>
       <enumerator name='RTE_FC_FULL' value='3'/>
     </enum-decl>
-    <typedef-decl name='flow_ctrl_set_t' type-id='type-id-635' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='359' column='1' id='type-id-554'/>
-    <typedef-decl name='priority_flow_ctrl_set_t' type-id='type-id-638' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='363' column='1' id='type-id-555'/>
-    <class-decl name='rte_eth_pfc_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='957' column='1' id='type-id-639'>
+    <typedef-decl name='flow_ctrl_set_t' type-id='type-id-633' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='359' column='1' id='type-id-552'/>
+    <typedef-decl name='priority_flow_ctrl_set_t' type-id='type-id-636' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='363' column='1' id='type-id-553'/>
+    <class-decl name='rte_eth_pfc_conf' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='957' column='1' id='type-id-637'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='fc' type-id='type-id-636' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='958' column='1'/>
+        <var-decl name='fc' type-id='type-id-634' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='958' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='160'>
         <var-decl name='priority' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='959' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_uc_hash_table_set_t' type-id='type-id-640' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='404' column='1' id='type-id-556'/>
-    <typedef-decl name='eth_uc_all_hash_table_set_t' type-id='type-id-641' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='409' column='1' id='type-id-557'/>
-    <typedef-decl name='eth_mirror_rule_set_t' type-id='type-id-642' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='418' column='1' id='type-id-558'/>
-    <class-decl name='rte_eth_mirror_conf' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='670' column='1' id='type-id-643'>
+    <typedef-decl name='eth_uc_hash_table_set_t' type-id='type-id-638' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='404' column='1' id='type-id-554'/>
+    <typedef-decl name='eth_uc_all_hash_table_set_t' type-id='type-id-639' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='409' column='1' id='type-id-555'/>
+    <typedef-decl name='eth_mirror_rule_set_t' type-id='type-id-640' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='418' column='1' id='type-id-556'/>
+    <class-decl name='rte_eth_mirror_conf' size-in-bits='1216' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='670' column='1' id='type-id-641'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='rule_type' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='671' column='1'/>
       </data-member>
@@ -4673,20 +4666,20 @@
         <var-decl name='pool_mask' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='673' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='vlan' type-id='type-id-644' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='675' column='1'/>
+        <var-decl name='vlan' type-id='type-id-642' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='675' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_vlan_mirror' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='661' column='1' id='type-id-644'>
+    <class-decl name='rte_eth_vlan_mirror' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='661' column='1' id='type-id-642'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='vlan_mask' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='662' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='vlan_id' type-id='type-id-377' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='664' column='1'/>
+        <var-decl name='vlan_id' type-id='type-id-375' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='664' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_mirror_rule_reset_t' type-id='type-id-641' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='424' column='1' id='type-id-559'/>
-    <typedef-decl name='eth_udp_tunnel_port_add_t' type-id='type-id-645' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='428' column='1' id='type-id-560'/>
-    <class-decl name='rte_eth_udp_tunnel' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1023' column='1' id='type-id-646'>
+    <typedef-decl name='eth_mirror_rule_reset_t' type-id='type-id-639' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='424' column='1' id='type-id-557'/>
+    <typedef-decl name='eth_udp_tunnel_port_add_t' type-id='type-id-643' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='428' column='1' id='type-id-558'/>
+    <class-decl name='rte_eth_udp_tunnel' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1023' column='1' id='type-id-644'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='udp_port' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1024' column='1'/>
       </data-member>
@@ -4694,11 +4687,11 @@
         <var-decl name='prot_type' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1025' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_udp_tunnel_port_del_t' type-id='type-id-645' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='432' column='1' id='type-id-561'/>
-    <typedef-decl name='eth_l2_tunnel_eth_type_conf_t' type-id='type-id-647' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='494' column='1' id='type-id-562'/>
-    <class-decl name='rte_eth_l2_tunnel_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='751' column='1' id='type-id-648'>
+    <typedef-decl name='eth_udp_tunnel_port_del_t' type-id='type-id-643' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='432' column='1' id='type-id-559'/>
+    <typedef-decl name='eth_l2_tunnel_eth_type_conf_t' type-id='type-id-645' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='494' column='1' id='type-id-560'/>
+    <class-decl name='rte_eth_l2_tunnel_conf' size-in-bits='160' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='751' column='1' id='type-id-646'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='l2_tunnel_type' type-id='type-id-649' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='752' column='1'/>
+        <var-decl name='l2_tunnel_type' type-id='type-id-647' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='752' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='ether_type' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='753' column='1'/>
@@ -4713,7 +4706,7 @@
         <var-decl name='pool' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='756' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_eth_tunnel_type' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='965' column='1' id='type-id-649'>
+    <enum-decl name='rte_eth_tunnel_type' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='965' column='1' id='type-id-647'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_TUNNEL_TYPE_NONE' value='0'/>
       <enumerator name='RTE_TUNNEL_TYPE_VXLAN' value='1'/>
@@ -4725,22 +4718,22 @@
       <enumerator name='RTE_TUNNEL_TYPE_VXLAN_GPE' value='7'/>
       <enumerator name='RTE_TUNNEL_TYPE_MAX' value='8'/>
     </enum-decl>
-    <typedef-decl name='eth_l2_tunnel_offload_set_t' type-id='type-id-650' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='498' column='1' id='type-id-563'/>
-    <typedef-decl name='eth_set_queue_rate_limit_t' type-id='type-id-651' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='413' column='1' id='type-id-564'/>
-    <typedef-decl name='rss_hash_update_t' type-id='type-id-652' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='377' column='1' id='type-id-565'/>
-    <typedef-decl name='rss_hash_conf_get_t' type-id='type-id-652' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='381' column='1' id='type-id-566'/>
-    <typedef-decl name='reta_update_t' type-id='type-id-653' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='367' column='1' id='type-id-567'/>
-    <class-decl name='rte_eth_rss_reta_entry64' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='684' column='1' id='type-id-654'>
+    <typedef-decl name='eth_l2_tunnel_offload_set_t' type-id='type-id-648' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='498' column='1' id='type-id-561'/>
+    <typedef-decl name='eth_set_queue_rate_limit_t' type-id='type-id-649' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='413' column='1' id='type-id-562'/>
+    <typedef-decl name='rss_hash_update_t' type-id='type-id-650' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='377' column='1' id='type-id-563'/>
+    <typedef-decl name='rss_hash_conf_get_t' type-id='type-id-650' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='381' column='1' id='type-id-564'/>
+    <typedef-decl name='reta_update_t' type-id='type-id-651' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='367' column='1' id='type-id-565'/>
+    <class-decl name='rte_eth_rss_reta_entry64' size-in-bits='1088' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='684' column='1' id='type-id-652'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='mask' type-id='type-id-11' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='685' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='reta' type-id='type-id-377' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='687' column='1'/>
+        <var-decl name='reta' type-id='type-id-375' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='687' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='reta_query_t' type-id='type-id-653' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='372' column='1' id='type-id-568'/>
-    <typedef-decl name='eth_get_reg_t' type-id='type-id-655' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='471' column='1' id='type-id-569'/>
-    <class-decl name='rte_dev_reg_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='13' column='1' id='type-id-656'>
+    <typedef-decl name='reta_query_t' type-id='type-id-651' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='372' column='1' id='type-id-566'/>
+    <typedef-decl name='eth_get_reg_t' type-id='type-id-653' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='471' column='1' id='type-id-567'/>
+    <class-decl name='rte_dev_reg_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='13' column='1' id='type-id-654'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='data' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='14' column='1'/>
       </data-member>
@@ -4757,9 +4750,9 @@
         <var-decl name='version' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='18' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_get_eeprom_length_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='475' column='1' id='type-id-570'/>
-    <typedef-decl name='eth_get_eeprom_t' type-id='type-id-657' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='478' column='1' id='type-id-571'/>
-    <class-decl name='rte_dev_eeprom_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='24' column='1' id='type-id-658'>
+    <typedef-decl name='eth_get_eeprom_length_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='475' column='1' id='type-id-568'/>
+    <typedef-decl name='eth_get_eeprom_t' type-id='type-id-655' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='478' column='1' id='type-id-569'/>
+    <class-decl name='rte_dev_eeprom_info' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='24' column='1' id='type-id-656'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='data' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='25' column='1'/>
       </data-member>
@@ -4773,9 +4766,9 @@
         <var-decl name='magic' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='28' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_set_eeprom_t' type-id='type-id-657' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='482' column='1' id='type-id-572'/>
-    <typedef-decl name='eth_get_module_info_t' type-id='type-id-659' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='486' column='1' id='type-id-573'/>
-    <class-decl name='rte_eth_dev_module_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='34' column='1' id='type-id-660'>
+    <typedef-decl name='eth_set_eeprom_t' type-id='type-id-655' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='482' column='1' id='type-id-570'/>
+    <typedef-decl name='eth_get_module_info_t' type-id='type-id-657' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='486' column='1' id='type-id-571'/>
+    <class-decl name='rte_eth_dev_module_info' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='34' column='1' id='type-id-658'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='type' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='35' column='1'/>
       </data-member>
@@ -4783,9 +4776,9 @@
         <var-decl name='eeprom_len' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_dev_info.h' line='36' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_get_module_eeprom_t' type-id='type-id-657' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='490' column='1' id='type-id-574'/>
-    <typedef-decl name='eth_filter_ctrl_t' type-id='type-id-661' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='506' column='1' id='type-id-575'/>
-    <enum-decl name='rte_filter_type' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='28' column='1' id='type-id-662'>
+    <typedef-decl name='eth_get_module_eeprom_t' type-id='type-id-655' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='490' column='1' id='type-id-572'/>
+    <typedef-decl name='eth_filter_ctrl_t' type-id='type-id-659' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='506' column='1' id='type-id-573'/>
+    <enum-decl name='rte_filter_type' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='28' column='1' id='type-id-660'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_ETH_FILTER_NONE' value='0'/>
       <enumerator name='RTE_ETH_FILTER_MACVLAN' value='1'/>
@@ -4800,7 +4793,7 @@
       <enumerator name='RTE_ETH_FILTER_GENERIC' value='10'/>
       <enumerator name='RTE_ETH_FILTER_MAX' value='11'/>
     </enum-decl>
-    <enum-decl name='rte_filter_op' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='46' column='1' id='type-id-663'>
+    <enum-decl name='rte_filter_op' filepath='../../dpdk/lib/librte_ethdev/rte_eth_ctrl.h' line='46' column='1' id='type-id-661'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_ETH_FILTER_NOP' value='0'/>
       <enumerator name='RTE_ETH_FILTER_ADD' value='1'/>
@@ -4813,30 +4806,30 @@
       <enumerator name='RTE_ETH_FILTER_STATS' value='8'/>
       <enumerator name='RTE_ETH_FILTER_OP_MAX' value='9'/>
     </enum-decl>
-    <typedef-decl name='eth_get_dcb_info' type-id='type-id-664' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='518' column='1' id='type-id-576'/>
-    <class-decl name='rte_eth_dcb_info' size-in-bits='16520' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1377' column='1' id='type-id-665'>
+    <typedef-decl name='eth_get_dcb_info' type-id='type-id-662' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='518' column='1' id='type-id-574'/>
+    <class-decl name='rte_eth_dcb_info' size-in-bits='16520' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1377' column='1' id='type-id-663'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='nb_tcs' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1378' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8'>
-        <var-decl name='prio_tc' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1379' column='1'/>
+        <var-decl name='prio_tc' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1379' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='72'>
-        <var-decl name='tc_bws' type-id='type-id-385' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1380' column='1'/>
+        <var-decl name='tc_bws' type-id='type-id-383' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1380' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='136'>
-        <var-decl name='tc_queue' type-id='type-id-666' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1382' column='1'/>
+        <var-decl name='tc_queue' type-id='type-id-664' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1382' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_dcb_tc_queue_mapping' size-in-bits='16384' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1360' column='1' id='type-id-666'>
+    <class-decl name='rte_eth_dcb_tc_queue_mapping' size-in-bits='16384' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1360' column='1' id='type-id-664'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tc_rxq' type-id='type-id-354' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1365' column='1'/>
+        <var-decl name='tc_rxq' type-id='type-id-352' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1365' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='8192'>
-        <var-decl name='tc_txq' type-id='type-id-349' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1370' column='1'/>
+        <var-decl name='tc_txq' type-id='type-id-352' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1370' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='__anonymous_struct__9' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1362' column='1' id='type-id-348'>
+    <class-decl name='__anonymous_struct__9' size-in-bits='16' is-struct='yes' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1362' column='1' id='type-id-351'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='base' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1363' column='1'/>
       </data-member>
@@ -4844,33 +4837,33 @@
         <var-decl name='nb_queue' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1364' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_timesync_enable_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='441' column='1' id='type-id-577'/>
-    <typedef-decl name='eth_timesync_disable_t' type-id='type-id-593' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='444' column='1' id='type-id-578'/>
-    <typedef-decl name='eth_timesync_read_rx_timestamp_t' type-id='type-id-667' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='447' column='1' id='type-id-579'/>
-    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-668'>
+    <typedef-decl name='eth_timesync_enable_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='441' column='1' id='type-id-575'/>
+    <typedef-decl name='eth_timesync_disable_t' type-id='type-id-591' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='444' column='1' id='type-id-576'/>
+    <typedef-decl name='eth_timesync_read_rx_timestamp_t' type-id='type-id-665' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='447' column='1' id='type-id-577'/>
+    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='9' column='1' id='type-id-666'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tv_sec' type-id='type-id-669' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
+        <var-decl name='tv_sec' type-id='type-id-667' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='11' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tv_nsec' type-id='type-id-670' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='__time_t' type-id='type-id-364' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-669'/>
-    <typedef-decl name='__syscall_slong_t' type-id='type-id-364' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-670'/>
-    <typedef-decl name='eth_timesync_read_tx_timestamp_t' type-id='type-id-671' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='452' column='1' id='type-id-580'/>
-    <typedef-decl name='eth_timesync_adjust_time' type-id='type-id-672' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='456' column='1' id='type-id-581'/>
-    <typedef-decl name='int64_t' type-id='type-id-673' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-674'/>
-    <typedef-decl name='__int64_t' type-id='type-id-364' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-673'/>
-    <typedef-decl name='eth_timesync_read_time' type-id='type-id-671' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='459' column='1' id='type-id-582'/>
-    <typedef-decl name='eth_timesync_write_time' type-id='type-id-675' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='463' column='1' id='type-id-583'/>
-    <typedef-decl name='eth_read_clock' type-id='type-id-676' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='467' column='1' id='type-id-584'/>
-    <typedef-decl name='eth_xstats_get_by_id_t' type-id='type-id-677' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='188' column='1' id='type-id-585'/>
-    <typedef-decl name='eth_xstats_get_names_by_id_t' type-id='type-id-678' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='219' column='1' id='type-id-586'/>
-    <typedef-decl name='eth_tm_ops_get_t' type-id='type-id-679' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='512' column='1' id='type-id-587'/>
-    <typedef-decl name='eth_mtr_ops_get_t' type-id='type-id-679' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='515' column='1' id='type-id-588'/>
-    <typedef-decl name='eth_pool_ops_supported_t' type-id='type-id-680' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='522' column='1' id='type-id-589'/>
-    <typedef-decl name='eth_hairpin_cap_get_t' type-id='type-id-681' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='543' column='1' id='type-id-590'/>
-    <class-decl name='rte_eth_hairpin_cap' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='861' column='1' id='type-id-682'>
+        <var-decl name='tv_nsec' type-id='type-id-668' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='__time_t' type-id='type-id-362' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-667'/>
+    <typedef-decl name='__syscall_slong_t' type-id='type-id-362' filepath='/usr/include/bits/types.h' line='196' column='1' id='type-id-668'/>
+    <typedef-decl name='eth_timesync_read_tx_timestamp_t' type-id='type-id-669' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='452' column='1' id='type-id-578'/>
+    <typedef-decl name='eth_timesync_adjust_time' type-id='type-id-670' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='456' column='1' id='type-id-579'/>
+    <typedef-decl name='int64_t' type-id='type-id-671' filepath='/usr/include/bits/stdint-intn.h' line='27' column='1' id='type-id-672'/>
+    <typedef-decl name='__int64_t' type-id='type-id-362' filepath='/usr/include/bits/types.h' line='44' column='1' id='type-id-671'/>
+    <typedef-decl name='eth_timesync_read_time' type-id='type-id-669' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='459' column='1' id='type-id-580'/>
+    <typedef-decl name='eth_timesync_write_time' type-id='type-id-673' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='463' column='1' id='type-id-581'/>
+    <typedef-decl name='eth_read_clock' type-id='type-id-674' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='467' column='1' id='type-id-582'/>
+    <typedef-decl name='eth_xstats_get_by_id_t' type-id='type-id-675' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='188' column='1' id='type-id-583'/>
+    <typedef-decl name='eth_xstats_get_names_by_id_t' type-id='type-id-676' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='219' column='1' id='type-id-584'/>
+    <typedef-decl name='eth_tm_ops_get_t' type-id='type-id-677' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='512' column='1' id='type-id-585'/>
+    <typedef-decl name='eth_mtr_ops_get_t' type-id='type-id-677' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='515' column='1' id='type-id-586'/>
+    <typedef-decl name='eth_pool_ops_supported_t' type-id='type-id-678' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='522' column='1' id='type-id-587'/>
+    <typedef-decl name='eth_hairpin_cap_get_t' type-id='type-id-679' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='543' column='1' id='type-id-588'/>
+    <class-decl name='rte_eth_hairpin_cap' size-in-bits='64' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='861' column='1' id='type-id-680'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='max_nb_queues' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='863' column='1'/>
       </data-member>
@@ -4884,16 +4877,16 @@
         <var-decl name='max_nb_desc' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='868' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_rx_hairpin_queue_setup_t' type-id='type-id-683' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='571' column='1' id='type-id-591'/>
-    <class-decl name='rte_eth_hairpin_conf' size-in-bits='1040' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='890' column='1' id='type-id-684'>
+    <typedef-decl name='eth_rx_hairpin_queue_setup_t' type-id='type-id-681' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='571' column='1' id='type-id-589'/>
+    <class-decl name='rte_eth_hairpin_conf' size-in-bits='1040' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='890' column='1' id='type-id-682'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='peer_count' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='891' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16'>
-        <var-decl name='peers' type-id='type-id-373' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='892' column='1'/>
+        <var-decl name='peers' type-id='type-id-371' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='892' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_hairpin_peer' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='879' column='1' id='type-id-372'>
+    <class-decl name='rte_eth_hairpin_peer' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='879' column='1' id='type-id-370'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='port' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='880' column='1'/>
       </data-member>
@@ -4901,16 +4894,16 @@
         <var-decl name='queue' type-id='type-id-4' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='881' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='eth_tx_hairpin_queue_setup_t' type-id='type-id-683' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='601' column='1' id='type-id-592'/>
-    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-456'>
+    <typedef-decl name='eth_tx_hairpin_queue_setup_t' type-id='type-id-681' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='601' column='1' id='type-id-590'/>
+    <class-decl name='rte_intr_handle' size-in-bits='213248' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='69' column='1' id='type-id-454'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='' type-id='type-id-685' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1'/>
+        <var-decl name='' type-id='type-id-683' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='75' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='type' type-id='type-id-686' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
+        <var-decl name='type' type-id='type-id-684' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='76' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='96'>
         <var-decl name='max_intr' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='77' column='1'/>
@@ -4922,16 +4915,16 @@
         <var-decl name='efd_counter_size' type-id='type-id-14' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='79' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
-        <var-decl name='efds' type-id='type-id-362' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
+        <var-decl name='efds' type-id='type-id-360' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='80' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='16576'>
-        <var-decl name='elist' type-id='type-id-366' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
+        <var-decl name='elist' type-id='type-id-364' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='81' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='213184'>
         <var-decl name='intr_vec' type-id='type-id-347' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='83' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__3' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-685'>
+    <union-decl name='__anonymous_union__3' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='71' column='1' id='type-id-683'>
       <data-member access='private'>
         <var-decl name='vfio_dev_fd' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='72' column='1'/>
       </data-member>
@@ -4939,7 +4932,7 @@
         <var-decl name='uio_cfg_fd' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='73' column='1'/>
       </data-member>
     </union-decl>
-    <enum-decl name='rte_intr_handle_type' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-686'>
+    <enum-decl name='rte_intr_handle_type' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='27' column='1' id='type-id-684'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_INTR_HANDLE_UNKNOWN' value='0'/>
       <enumerator name='RTE_INTR_HANDLE_UIO' value='1'/>
@@ -4954,9 +4947,9 @@
       <enumerator name='RTE_INTR_HANDLE_VFIO_REQ' value='10'/>
       <enumerator name='RTE_INTR_HANDLE_MAX' value='11'/>
     </enum-decl>
-    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-365'>
+    <class-decl name='rte_epoll_event' size-in-bits='384' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='61' column='1' id='type-id-363'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='status' type-id='type-id-687' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
+        <var-decl name='status' type-id='type-id-685' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='62' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='32'>
         <var-decl name='fd' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='63' column='1'/>
@@ -4965,10 +4958,10 @@
         <var-decl name='epfd' type-id='type-id-1' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='64' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='epdata' type-id='type-id-688' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
+        <var-decl name='epdata' type-id='type-id-686' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='65' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-688'>
+    <class-decl name='rte_epoll_data' size-in-bits='256' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='47' column='1' id='type-id-686'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='event' type-id='type-id-7' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='48' column='1'/>
       </data-member>
@@ -4976,49 +4969,49 @@
         <var-decl name='data' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='49' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
-        <var-decl name='cb_fun' type-id='type-id-689' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
+        <var-decl name='cb_fun' type-id='type-id-687' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='50' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='192'>
         <var-decl name='cb_arg' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='51' column='1'/>
       </data-member>
     </class-decl>
-    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-690' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-689'/>
-    <class-decl name='rte_eth_dev_cb_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1' id='type-id-466'>
+    <typedef-decl name='rte_intr_event_cb_t' type-id='type-id-688' filepath='../../dpdk/lib/librte_eal/common/include/rte_eal_interrupts.h' line='45' column='1' id='type-id-687'/>
+    <class-decl name='rte_eth_dev_cb_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1' id='type-id-464'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqh_first' type-id='type-id-691' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
+        <var-decl name='tqh_first' type-id='type-id-689' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqh_last' type-id='type-id-692' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
+        <var-decl name='tqh_last' type-id='type-id-690' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='22' column='1'/>
       </data-member>
     </class-decl>
-    <class-decl name='rte_eth_rxtx_callback' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='758' column='1' id='type-id-693'>
+    <class-decl name='rte_eth_rxtx_callback' size-in-bits='192' is-struct='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='758' column='1' id='type-id-691'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='next' type-id='type-id-374' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='759' column='1'/>
+        <var-decl name='next' type-id='type-id-372' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='759' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='fn' type-id='type-id-694' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='763' column='1'/>
+        <var-decl name='fn' type-id='type-id-692' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='763' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='128'>
         <var-decl name='param' type-id='type-id-59' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='764' column='1'/>
       </data-member>
     </class-decl>
-    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='760' column='1' id='type-id-694'>
+    <union-decl name='__anonymous_union__4' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='760' column='1' id='type-id-692'>
       <data-member access='private'>
-        <var-decl name='rx' type-id='type-id-695' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='761' column='1'/>
+        <var-decl name='rx' type-id='type-id-693' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='761' column='1'/>
       </data-member>
       <data-member access='private'>
-        <var-decl name='tx' type-id='type-id-696' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='762' column='1'/>
+        <var-decl name='tx' type-id='type-id-694' visibility='default' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev_core.h' line='762' column='1'/>
       </data-member>
     </union-decl>
-    <typedef-decl name='rte_rx_callback_fn' type-id='type-id-697' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1437' column='1' id='type-id-695'/>
-    <typedef-decl name='rte_tx_callback_fn' type-id='type-id-698' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1461' column='1' id='type-id-696'/>
-    <enum-decl name='rte_eth_dev_state' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1467' column='1' id='type-id-467'>
+    <typedef-decl name='rte_rx_callback_fn' type-id='type-id-695' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1437' column='1' id='type-id-693'/>
+    <typedef-decl name='rte_tx_callback_fn' type-id='type-id-696' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1461' column='1' id='type-id-694'/>
+    <enum-decl name='rte_eth_dev_state' filepath='../../dpdk/lib/librte_ethdev/rte_ethdev.h' line='1467' column='1' id='type-id-465'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='RTE_ETH_DEV_UNUSED' value='0'/>
       <enumerator name='RTE_ETH_DEV_ATTACHED' value='1'/>
       <enumerator name='RTE_ETH_DEV_REMOVED' value='2'/>
     </enum-decl>
-    <class-decl name='dpaa_device_id' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='63' column='1' id='type-id-455'>
+    <class-decl name='dpaa_device_id' size-in-bits='32' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='63' column='1' id='type-id-453'>
       <data-member access='public' layout-offset-in-bits='0'>
         <var-decl name='fman_id' type-id='type-id-14' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='64' column='1'/>
       </data-member>
@@ -5029,166 +5022,166 @@
         <var-decl name='dev_id' type-id='type-id-4' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='66' column='1'/>
       </data-member>
     </class-decl>
-    <enum-decl name='rte_dpaa_type' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='50' column='1' id='type-id-393'>
+    <enum-decl name='rte_dpaa_type' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='50' column='1' id='type-id-391'>
       <underlying-type type-id='type-id-17'/>
       <enumerator name='FSL_DPAA_ETH' value='1'/>
       <enumerator name='FSL_DPAA_CRYPTO' value='2'/>
     </enum-decl>
-    <class-decl name='rte_dpaa_driver_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='45' column='1' id='type-id-405'>
+    <class-decl name='rte_dpaa_driver_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='45' column='1' id='type-id-403'>
       <data-member access='public' layout-offset-in-bits='0'>
-        <var-decl name='tqh_first' type-id='type-id-396' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='45' column='1'/>
+        <var-decl name='tqh_first' type-id='type-id-394' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='45' column='1'/>
       </data-member>
       <data-member access='public' layout-offset-in-bits='64'>
-        <var-decl name='tqh_last' type-id='type-id-397' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='45' column='1'/>
-      </data-member>
-    </class-decl>
-    <typedef-decl name='rte_dpaa_probe_t' type-id='type-id-699' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='83' column='1' id='type-id-394'/>
-    <typedef-decl name='rte_dpaa_remove_t' type-id='type-id-700' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='85' column='1' id='type-id-395'/>
-    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-438'/>
-    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-701'/>
-    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-399'/>
-    <qualified-type-def type-id='type-id-502' const='yes' id='type-id-702'/>
-    <pointer-type-def type-id='type-id-702' size-in-bits='64' id='type-id-464'/>
-    <qualified-type-def type-id='type-id-403' const='yes' id='type-id-703'/>
-    <pointer-type-def type-id='type-id-703' size-in-bits='64' id='type-id-427'/>
-    <qualified-type-def type-id='type-id-448' const='yes' id='type-id-704'/>
+        <var-decl name='tqh_last' type-id='type-id-395' visibility='default' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='45' column='1'/>
+      </data-member>
+    </class-decl>
+    <typedef-decl name='rte_dpaa_probe_t' type-id='type-id-697' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='83' column='1' id='type-id-392'/>
+    <typedef-decl name='rte_dpaa_remove_t' type-id='type-id-698' filepath='../../dpdk/drivers/bus/dpaa/rte_dpaa_bus.h' line='85' column='1' id='type-id-393'/>
+    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-436'/>
+    <qualified-type-def type-id='type-id-45' const='yes' id='type-id-699'/>
+    <pointer-type-def type-id='type-id-699' size-in-bits='64' id='type-id-397'/>
+    <qualified-type-def type-id='type-id-500' const='yes' id='type-id-700'/>
+    <pointer-type-def type-id='type-id-700' size-in-bits='64' id='type-id-462'/>
+    <qualified-type-def type-id='type-id-401' const='yes' id='type-id-701'/>
+    <pointer-type-def type-id='type-id-701' size-in-bits='64' id='type-id-425'/>
+    <qualified-type-def type-id='type-id-446' const='yes' id='type-id-702'/>
+    <pointer-type-def type-id='type-id-702' size-in-bits='64' id='type-id-703'/>
+    <qualified-type-def type-id='type-id-422' const='yes' id='type-id-704'/>
     <pointer-type-def type-id='type-id-704' size-in-bits='64' id='type-id-705'/>
-    <qualified-type-def type-id='type-id-424' const='yes' id='type-id-706'/>
-    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-707'/>
-    <qualified-type-def type-id='type-id-391' const='yes' id='type-id-708'/>
-    <pointer-type-def type-id='type-id-708' size-in-bits='64' id='type-id-426'/>
-    <qualified-type-def type-id='type-id-684' const='yes' id='type-id-709'/>
+    <qualified-type-def type-id='type-id-389' const='yes' id='type-id-706'/>
+    <pointer-type-def type-id='type-id-706' size-in-bits='64' id='type-id-424'/>
+    <qualified-type-def type-id='type-id-682' const='yes' id='type-id-707'/>
+    <pointer-type-def type-id='type-id-707' size-in-bits='64' id='type-id-708'/>
+    <qualified-type-def type-id='type-id-608' const='yes' id='type-id-709'/>
     <pointer-type-def type-id='type-id-709' size-in-bits='64' id='type-id-710'/>
-    <qualified-type-def type-id='type-id-610' const='yes' id='type-id-711'/>
+    <qualified-type-def type-id='type-id-609' const='yes' id='type-id-711'/>
     <pointer-type-def type-id='type-id-711' size-in-bits='64' id='type-id-712'/>
-    <qualified-type-def type-id='type-id-611' const='yes' id='type-id-713'/>
+    <qualified-type-def type-id='type-id-666' const='yes' id='type-id-713'/>
     <pointer-type-def type-id='type-id-713' size-in-bits='64' id='type-id-714'/>
